{"text": "E-learning theory describes the cognitive science principles of effective multimedia learning using electronic educational technology.\n\n\n== Multimedia instructional design principles ==\nBeginning with cognitive load theory as their motivating scientific premise, researchers such as Richard E. Mayer, John Sweller, and Roxana Moreno established within the scientific literature a set of multimedia instructional design principles that promote effective learning. Many of these principles have been \"field tested\" in everyday learning settings and found to be effective there as well. The majority of this body of research has been performed using university students given relatively short lessons on technical concepts with which they held low prior knowledge. However, David Roberts has tested the method with students in nine social science disciplines including sociology, politics and business studies. His longitudinal research programme over 3 years established a clear improvement in levels of student engagement and in the development of active learning principles among students exposed to a combination of images and text, over students exposed only to text. A number of other studies have shown these principles to be effective with learners of other ages and with non-technical learning content.Research using learners who have greater prior knowledge in the lesson material sometimes finds results that contradict these design principles. This has led some researchers to put forward the \"expertise effect\" as an instructional design principle unto itself.The underlying theoretical premise, cognitive load theory, describes the amount of mental effort that is related to performing a task as falling into one of three categories: germane, intrinsic, and extraneous. Germane cognitive load is the mental effort required to process the task's information, make sense of it, and access and/or store it in long-term memory (for example, seeing a math problem, identifying the values and operations involved, and understanding that your task is to solve the math problem). Intrinsic cognitive load is the mental effort required to perform the task itself (for example, actually solving the math problem). Extraneous cognitive load is the mental effort imposed by the way that the task is delivered, which may or may not be efficient (for example, finding the math problem you are supposed to solve on a page that also contains advertisements for books about math).\nThe multimedia instructional design principles identified by Mayer, Sweller, Moreno, and their colleagues are largely focused on minimizing extraneous cognitive load and managing intrinsic and germane loads at levels that are appropriate for the learner. Examples of these principles in practice include \n\nReducing extraneous load by eliminating visual and auditory effects and elements that are not central to the lesson, such as seductive details (the coherence principle)\nReducing germane load by delivering verbal information through audio presentation (narration) while delivering relevant visual information through static images or animations (the modality principle)\nControlling intrinsic load by breaking the lesson into smaller segments and giving learners control over the pace at which they move forward through the lesson material (the segmenting principle).Cognitive load theory (and by extension many of the multimedia instructional design principles) is based in part on a model of working memory by Alan Baddeley and Graham Hitch who proposed that working memory has two largely independent, limited capacity sub-components that tend to work in parallel – one visual and one verbal/acoustic. This gave rise to dual-coding theory, first proposed by Allan Paivio and later applied to multimedia learning by Richard Mayer. According to Mayer, separate channels of working memory process auditory and visual information during any lesson. Consequently, a learner can use more cognitive processing capacities to study materials that combine auditory verbal information with visual graphical information than to process materials that combine printed (visual) text with visual graphical information. In other words, the multi-modal materials reduce the cognitive load imposed on working memory.\nIn a series of studies, Mayer and his colleagues tested Paivio's dual-coding theory, with multimedia lesson materials. They repeatedly found that students given multimedia with animation and narration consistently did better on transfer questions than those who learn from animation and text-based materials. That is, they were significantly better when it came to applying what they had learned after receiving multimedia rather than mono-media (visual only) instruction. These results were then later confirmed by other groups of researchers.\nThe initial studies of multimedia learning were limited to logical scientific processes that centered on cause-and-effect systems like automobile braking systems, how a bicycle pump works or cloud formation. However, subsequent investigations found that the modality effect extended to other areas of learning.\n\n\n=== Empirically established principles ===\nMultimedia principle: Deeper learning is observed when words and relevant graphics are both presented than when words are presented alone (also called the multimedia effect). Simply put, the three most common elements in multimedia presentations are relevant graphics, audio narration, and explanatory text. Combining any two of these three elements works better than using just one or all three.\nModality principle:  Deeper learning occurs when graphics are explained by audio narration instead of onscreen text. Exceptions have been observed when learners are familiar with the content, are not native speakers of the narration language, or when only printed words appear on the screen. Generally speaking, audio narration leads to better learning than the same words presented as text on the screen. This is especially true for walking someone through graphics on the screen, and when the material to be learned is complex or the terminology being used is already understood by the student (otherwise see \"pre-training\"). One exception to this is when the learner will be using the information as a reference and will need to look back to it again and again.\nCoherence principle: Avoid using unnecessary content (irrelevant video, graphics, music, stories, narration, etc.) in order to minimize cognitive load imposed on memory during learning by irrelevant and possibly distracting content. Basically, the less learners know about the lesson content, the easier it is for them to get distracted by anything shown that is not directly relevant to the lesson. For learners with greater prior knowledge, however, some motivational imagery may increase their interest and learning effectiveness just a bit.\nContiguity principle: Keep related pieces of information together. Deeper learning occurs when relevant text (for example, a label) is placed close to graphics or when spoken words and graphics are presented at the same time, or when feedback is presented next to the answer given by the learner.\nSegmenting principle: Deeper learning occurs when content is broken into small chunks. Break down long lessons into several shorter lessons.  Break down long text passages into multiple shorter ones.\nSignalling principle: The use of visual, auditory, or temporal cues to draw attention to critical elements of the lesson. Common techniques include arrows, circles, highlighting or bolding text, and pausing or vocal emphasis in narration. Ending lesson segments after the critical information has been given may also serve as a signalling cue.\nLearner control principle:  Deeper learning occurs when learners can control the rate at which they move forward through segmented content. Learners tend to do best when the narration stops after a short, meaningful segment of content is given and the learner has to click a \"continue\" button in order to start the next segment. Some research suggests not overwhelming the learner with too many control options, however. Giving just pause and play buttons may work better than giving pause, play, fast forward, reverse buttons. Also, high prior-knowledge learners may learn better when the lesson moves forward automatically, but they have a pause button that allows them to stop when they choose to do so.\nPersonalization principle: Deeper learning in multimedia lessons occur when learners experience a stronger social presence, as when a conversational script or learning agents are used. The effect is best seen when the tone of voice is casual, informal, and in a 1st person (\"I\" or \"we\") or 2nd person (\"you\") voice. For example, of the following two sentences, the second version conveys more of a casual, informal, conversational tone:A. The learner should have the sense that someone is talking directly to them when they hear the narration.\nB. Your learner should feel like someone is talking directly to them when they hear your narration.\nAlso, research suggests that using a polite tone of voice (\"You may want to try multiplying both sides of the equation by 10.\") leads to deeper learning for low prior knowledge learners than does a less polite, more directive tone of voice (\"Multiply both sides of the equation by 10.\"), but may impair deeper learning in high prior knowledge learners. Finally, adding pedagogical agents (computer characters) can help if used to reinforce important content. For example, have the character narrate the lesson, point out critical features in on-screen graphics, or visually demonstrate concepts to the learner.Pre-training principle: Deeper learning occurs when lessons present key concepts or vocabulary prior to presenting the processes or procedures related to those concepts. According to Mayer, Mathias, and Wetzel, \"Before presenting a multimedia explanation, make sure learners visually recognize each major component, can name each component and can describe the major state changes of each component. In short, make sure learners build component models before presenting a cause-and-effect explanation of how a system works.\" However, others have noted that including pre-training content appears to be more important for low prior knowledge learners than for high prior knowledge learners.\nRedundancy principle: Deeper learning occurs when lesson graphics are explained by audio narration alone rather than audio narration and on-screen text. This effect is stronger when the lesson is fast-paced and the words are familiar to the learners. Exceptions to this principle include: screens with no visuals, learners who are not native speakers of the course language, and placement of only a few key words on the screen (i.e., labelling critical elements of the graphic image).\nExpertise effect: Instructional methods, such as those described above, that are helpful to domain novices or low prior knowledge learners may have no effect or may even depress learning in high prior knowledge learners.Such principles may not apply outside of laboratory conditions. For example, Muller found that adding approximately 50% additional extraneous but interesting material did not result in any significant difference in learner performance. There is ongoing debate concerning the mechanisms underlying these beneficial principles, and on what boundary conditions may apply.\n\n\n== Learning theories ==\n\nGood pedagogical practice has a theory of learning at its core. However, no single best-practice e-learning standard has emerged. This may be unlikely given the range of learning and teaching styles, the potential ways technology can be implemented and the ways in which educational technology itself is changing. Various pedagogical approaches or learning theories may be considered in designing and interacting with e-learning programs.\nSocial-constructivist – this pedagogy is particularly well afforded by the use of discussion forums, blogs, wiki and online collaborative activities. It is a collaborative approach that opens educational content creation to a wider group including the students themselves. The One Laptop Per Child Foundation attempted to use a constructivist approach in its project.Laurillard's conversational model is also particularly relevant to eLearning, and Gilly Salmon's Five-Stage Model is a pedagogical approach to the use of discussion boards.Cognitive perspective focuses on the cognitive processes involved in learning as well as how the brain works.Emotional perspective focuses on the emotional aspects of learning, like motivation, engagement, fun, etc.Behavioural perspective focuses on the skills and behavioural outcomes of the learning process. Role-playing and application to on-the-job settings.Contextual perspective focuses on the environmental and social aspects which can stimulate learning. Interaction with other people, collaborative discovery and the importance of peer support as well as pressure.Mode neutral Convergence or promotion of ‘transmodal’ learning where online and classroom learners can coexist within one learning environment thus encouraging interconnectivity and the harnessing of collective intelligence.For many theorists, it’s the interaction between student and teacher and student and student in the online environment that enhances learning (Mayes and de Freitas 2004). Pask’s theory that learning occurs through conversations about a subject which in turn helps to make knowledge explicit has an obvious application to learning within a  VLE.Salmon developed a five-stage model of e-learning and e-moderating that for some time has had a major influence where online courses and online discussion forums have been used. In her five-stage model, individual access and the ability of students to use the technology are the first steps to involvement and achievement. The second step involves students creating an identity online and finding others with whom to interact; online socialisation is a critical element of the e-learning process in this model. In step 3 students are giving and sharing information relevant to the course to each other. Collaborative interaction amongst students is central to step 4. The fifth step in Salmon’s model involves students looking for benefits from the system and using resources from outside of it to deepen their learning. Throughout all of this, the tutor/teacher/lecturer fulfils the role of moderator or e-moderator, acting as a facilitator of student learning.\nSome criticism is now beginning to emerge. Her model does not easily transfer to other contexts (she developed it with experience from an Open University distance learning course). It ignores the variety of learning approaches that are possible within computer mediated communication (CMC) and the range of learning theories that are available (Moule 2007).\n\n\n=== Self-regulation ===\nSelf-regulated learning refers to several concepts that play major roles in learning, and which have significant relevance in e-learning. Zimmerman (1998) explains that in order to develop self-regulation, learning courses should offer opportunities for students to practice strategies and skills by themselves. Self-regulation is also strongly related to a student's social sources such as parents and teachers. Moreover, Steinberg (1996) found that high-achieving students usually have high-expectation parents who monitor their children closely.With the academic environment, self-regulated learners usually set their academic goals and monitor and react themselves in process in order to achieve their goals. Schunk argues, \"students must regulate not only their actions but also their underlying achievement-related cognitions, beliefs, intentions and effects\"(p. 359). Moreover, academic self-regulation also helps students develop confidence in their ability to perform well in e-learning courses.\n\n\n=== Theoretical framework ===\nE-learning literature identifies an ecology of concepts, from  a bibliometric study  were identified the most used concepts associated with the use of computers in learning contexts, e.g. computer assisted  instruction (CAI), computer assisted learning (CAL), computer-based education (CBE), e-learning, learning management systems (LMS), self-directed learning (SDL), and massive open online courses (MOOC). All these concepts have two aspects in common: learning and computers; except the SDL concept, which derives from psychology, and does not necessarily apply to computer usage. These concepts are yet to be studied in scientific research, and stand in contrast to MOOCs. Nowadays, e-learning can also mean massive distribution of content and global classes for all the Internet users. E-learning studies can be focused on three principal dimensions: users, technology, and services. According to Aparicio, Bacao & Oliveira \"The e-learning systems' theoretical framework contains the three main components of information systems. These components are people, technologies, and services. People interact with e-learning systems. E-learning technologies enable the direct or indirect interaction of the different groups of users. Technologies provide support to integrate content, enable communication, and provide collaboration tools. E-learning services integrate all the activities corresponding to pedagogical models and to instructional strategies. The complex interaction combination is the direct or indirect action with e-learning systems. At the same time, systems provide services according to the specified strategies for activities. In other words, service specifications are e-learning activities aligned with the e-learning pedagogical models and the instructional strategies\".\n\n\n== Teacher use of technology ==\nComputing technology was not created by teachers. There has been little consultation between those who promote its use in schools and those who teach with it. Decisions to purchase technology for education are very often political decisions. Most staff using these technologies did not grow up with them. Training teachers to use computer technology did improve their confidence in its use, but there was considerable dissatisfaction with training content and style of delivery. The communication element, in particular, was highlighted as the least satisfactory part of the training, by which many teachers meant the use of a VLE and discussion forums to deliver online training (Leask 2002). Technical support for online learning, lack of access to hardware, poor monitoring of teacher progress and a lack of support by online tutors were just some of the issues raised by the asynchronous online delivery of training (Davies 2004).\nNewer generation web 2.0 services provide customizable, inexpensive platforms for authoring and disseminating multimedia-rich e-learning courses, and do not need specialised information technology (IT) support.Pedagogical theory may have application in encouraging and assessing online participation. Assessment methods for on-line participation have reviewed.\n\n\n== See also ==\nDual-coding theory\nEvidence-based learning\nMedia psychology\nSplit attention effect – Learning effect inherent within some poorly designed instructional materials\nWorked-example effect\n\n\n== References =="}