{"text": "Educational technology is the use of both physical hardware, software, and educational theoretic to facilitate learning and improving performance by creating, using, and managing appropriate technological processes and resources . \nIt encompasses several domains including learning theory, computer-based training, online learning, and where mobile technologies are used, m-learning. Accordingly, there are several discrete aspects to describing the intellectual and technical development of educational technology:\n\nEducational technology as the theory and practice of educational approaches to learning.\nEducational technology as technological tools and media, for instance massive online courses, that assist in the communication of knowledge, and its development and exchange. This is usually what people are referring to when they use the term \"EdTech\".\nEducational technology for learning management systems (LMS), such as tools for student and curriculum management, and education management information systems (EMIS).\nEducational technology as back-office management, such as training management systems for logistics and budget management, and Learning Record Store (LRS) for learning data storage and analysis.\nEducational technology itself as an educational subject; such courses may be called \"Computer Studies\" or \"Information and communications technology (ICT)\".\n\n\n== Definition ==\nThe Association for Educational Communications and Technology (AECT) defined educational technology as \"the study and ethical practice of facilitating learning and improving performance by creating, using and managing appropriate technological processes and resources\". It denoted instructional technology as \"the theory and practice of design, development, utilization, management, and evaluation of processes and resources for learning\". As such, educational technology refers to all valid and reliable applied education sciences, such as equipment, as well as processes and procedures that are derived from scientific research, and in a given context may refer to theoretical, algorithmic or heuristic processes: it does not necessarily imply physical technology. Educational technology is the process of integrating technology into education in a positive manner that promotes a more diverse learning environment and a way for students to learn how to use technology as well as their common assignments.\n\n\n== Related terms ==\n\nEducational technology is an inclusive term for both the material tools and the theoretical foundations for supporting learning and teaching. Educational technology is not restricted to high technology but is anything that enhances classroom learning in the utilization of blended, face to face, or online learning.An educational technologist is someone who is trained in the field of educational technology. Educational technologists try to analyze, design, develop, implement, and evaluate process and tools to enhance learning. While the term educational technologist is used primarily in the United States, learning technologist is synonymous and used in the UK as well as Canada.\nModern electronic educational technology is an important part of society today. Educational technology encompasses e-learning, instructional technology, information and communication technology (ICT) in education, EdTech,  learning technology, multimedia learning, technology-enhanced learning (TEL), computer-based instruction (CBI), computer managed instruction, computer-based training (CBT), computer-assisted instruction or computer-aided instruction (CAI), internet-based training (IBT), flexible learning, web-based training (WBT), online education,  digital educational collaboration, distributed learning, computer-mediated communication, cyber-learning, and multi-modal instruction, virtual education, personal learning environments, networked learning, virtual learning environments (VLE) (which are also called learning platforms), m-learning, ubiquitous learning and digital education.\nEach of these numerous terms has had its advocates, who point up potential distinctive features. However, many terms and concepts in educational technology have been defined nebulously; for example, Fiedler's review of the literature found a complete lack agreement of the components of a personal learning environment. Moreover, Moore saw these terminologies as emphasizing particular features such as digitization approaches, components or delivery methods rather than being fundamentally dissimilar in concept or principle. For example, m-learning emphasizes mobility, which allows for altered timing, location, accessibility and context of learning; nevertheless, its purpose and conceptual principles are those of educational technology.In practice, as technology has advanced, the particular \"narrowly defined\" terminological aspect that was initially emphasized by name has blended into the general field of educational technology. Initially, \"virtual learning\" as narrowly defined in a semantic sense implied entering an environmental simulation within a virtual world, for example in treating posttraumatic stress disorder (PTSD). In practice, a \"virtual education course\" refers to any instructional course in which all, or at least a significant portion, is delivered by the Internet. \"Virtual\" is used in that broader way to describe a course that is not taught in a classroom face-to-face but through a substitute mode that can conceptually be associated \"virtually\" with classroom teaching, which means that people do not have to go to the physical classroom to learn. Accordingly, virtual education refers to a form of distance learning in which course content is delivered by various methods such as course management applications, multimedia resources, and videoconferencing. Virtual education and simulated learning opportunities, such as games or dissections, offer opportunities for students to connect classroom content to authentic situations.Educational content, pervasively embedded in objects, is all around the learner, who may not even be conscious of the learning process. The combination of adaptive learning, using an individualized interface and materials, which accommodate to an individual, who thus receives personally differentiated instruction, with ubiquitous access to digital resources and learning opportunities in a range of places and at various times, has been termed smart learning. Smart learning is a component of the smart city concept.\n\n\n== History ==\n\nHelping people and children learn in ways that are easier, faster, more accurate, or less expensive can be traced back to the emergence of very early tools, such as paintings on cave walls. Various types of abacus have been used. Writing slates and blackboards have been used for at least a millennium. From their introduction, books and pamphlets have held a prominent role in education. From the early twentieth century, duplicating machines such as the mimeograph and Gestetner stencil devices were used to produce short copy runs (typically 10–50 copies) for classroom or home use. The use of media for instructional purposes is generally traced back to the first decade of the 20th century with the introduction of educational films (1900s) and Sidney Pressey's mechanical teaching machines (1920s).  The first all multiple choice, large-scale assessment was the Army Alpha, used to assess the intelligence and more specifically the aptitudes of World War I military recruits. Further large-scale use of technologies was employed in training soldiers during and after WWII using films and other mediated materials, such as overhead projectors. The concept of hypertext is traced to the description of memex by Vannevar Bush in 1945.\n\nSlide projectors were widely used during the 1950s in educational institutional settings. Cuisenaire rods were devised in the 1920s and saw widespread use from the late 1950s.\nIn the mid-1960s, Stanford University psychology professors, Patrick Suppes and Richard C. Atkinson, experimented with using computers to teach arithmetic and spelling via Teletypes to elementary school students in the Palo Alto Unified School District in California.  Stanford's Education Program for Gifted Youth is descended from those early experiments.\nOnline education originated from the University of Illinois in 1960. Although internet would not be created for another nine years, students were able to access class information with linked computer terminals. The first online course was offered in 1986 by the Electronic University Network for DOS and Commodore 64 computers. Computer Assisted Learning eventually offered the first online courses with real interaction. In 2002, MIT began providing online classes free of charge. As of 2009, approximately 5.5 millions students were taking at least one class online. Currently, one out of three college students takes at least one online course while in college. At DeVry University, out of all students that are earning a bachelor's degree, 80% earn two-thirds of their requirements online. Also in 2014, 2.85 millions students out of 5.8 million students that took courses online, took all of their courses online. From this information, it can be concluded that the number of students taking classes online is on the steady increase.\n\nIn 1971, Ivan Illich published a hugely influential book called, Deschooling Society, in which he envisioned \"learning webs\" as a model for people to network the learning they needed. The 1970s and 1980s saw notable contributions in computer-based learning by Murray Turoff and Starr Roxanne Hiltz at the New Jersey Institute of Technology as well as developments at the University of Guelph in Canada. In the UK, the Council for Educational Technology supported the use of educational technology, in particular administering the government's National Development Programme in Computer Aided Learning (1973–77) and the Microelectronics Education Programme (1980–86).\nBy the mid-1980s, accessing course content became possible at many college libraries. In computer-based training (CBT) or computer-based learning (CBL), the learning interaction was between the student and computer drills or micro-world simulations.\nDigitized communication and networking in education started in the mid-1980s. Educational institutions began to take advantage of the new medium by offering distance learning courses using computer networking for information. Early e-learning systems, based on computer-based learning/training often replicated autocratic teaching styles whereby the role of the e-learning system was assumed to be for transferring knowledge, as opposed to systems developed later based on computer supported collaborative learning (CSCL), which encouraged the shared development of knowledge.\nVideoconferencing was an important forerunner to the educational technologies known today. This work was especially popular with museum education. Even in recent years, videoconferencing has risen in popularity to reach over 20,000 students across the United States and Canada in 2008–2009. Disadvantages of this form of educational technology are readily apparent: image and sound quality is often grainy or pixelated; videoconferencing requires setting up a type of mini-television studio within the museum for broadcast, space becomes an issue; and specialised equipment is required for both the provider and the participant.The Open University in Britain and the University of British Columbia (where Web CT, now incorporated into Blackboard Inc., was first developed) began a revolution of using the Internet to deliver learning, making heavy use of web-based training, online distance learning and online discussion between students. Practitioners such as Harasim (1995) put heavy emphasis on the use of learning networks.\nWith the advent of World Wide Web in the 1990s, teachers embarked on the method using emerging technologies to employ multi-object oriented sites, which are text-based online virtual reality systems, to create course websites along with simple sets of instructions for its students.\nBy 1994, the first online high school had been founded. In 1997, Graziadei described criteria for evaluating products and developing technology-based courses that include being portable, replicable, scalable, affordable, and having a high probability of long-term cost-effectiveness.Improved Internet functionality enabled new schemes of communication with multimedia or webcams. The National Center for Education Statistics estimate the number of K-12 students enrolled in online distance learning programs increased by 65 percent from 2002 to 2005, with greater flexibility, ease of communication between teacher and student, and quick lecture and assignment feedback.\nAccording to a 2008 study conducted by the U.S Department of Education, during the 2006–2007 academic year about 66% of postsecondary public and private schools participating in student financial aid programs offered some distance learning courses; records show 77% of enrollment in for-credit courses with an online component. In 2008, the Council of Europe passed a statement endorsing e-learning's potential to drive equality and education improvements across the EU.Computer-mediated communication (CMC) is between learners and instructors, mediated by the computer. In contrast, CBT/CBL usually means individualized (self-study) learning, while CMC involves educator/tutor facilitation and requires scenarization of flexible learning activities. In addition, modern ICT provides education with tools for sustaining learning communities and associated knowledge management tasks.\nStudents growing up in this digital age have extensive exposure to a variety of media. Major high-tech companies have funded schools to provide them the ability to teach their students through technology.2015 was the first year that private nonprofit organizations enrolled more online students than for-profits, although public universities still enrolled the highest number of online students.  In the fall of 2015, more than 6 million students enrolled in at least one online course.\n\n\n== Theory ==\n\nVarious pedagogical perspectives or learning theories may be considered in designing and interacting with educational technology. E-learning theory examines these approaches. These theoretical perspectives are grouped into three main theoretical schools or philosophical frameworks: behaviorism, cognitivism and constructivism.\n\n\n=== Behaviorism ===\nThis theoretical framework was developed in the early 20th century based on animal learning experiments by Ivan Pavlov, Edward Thorndike, Edward C. Tolman, Clark L. Hull, and B.F. Skinner. Many psychologists used these results to develop theories of human learning, but modern educators generally see behaviorism as one aspect of a holistic synthesis. Teaching in behaviorism has been linked to training, emphasizing the animal learning experiments. Since behaviorism consists of the view of teaching people how to do something with rewards and punishments, it is related to training people.B.F. Skinner wrote extensively on improvements of teaching based on his functional analysis of verbal behavior and wrote \"The Technology of Teaching\", an attempt to dispel the myths underlying contemporary education as well as promote his system he called programmed instruction. Ogden Lindsley developed a learning system, named Celeration, that was based on behavior analysis but that substantially differed from Keller's and Skinner's models.\n\n\n=== Cognitivism ===\nCognitive science underwent significant change in the 1960s and 1970s to the point that some described the period as a \"cognitive revolution\" particularly in reaction to behaviorism. While retaining the empirical framework of behaviorism, cognitive psychology theories look beyond behavior to explain brain-based learning by considering how human memory works to promote learning. It refers to learning as \"all processes by which the sensory input is transformed, reduced, elaborated, stored, recovered, and used\" by the human mind. The Atkinson-Shiffrin memory model and Baddeley's working memory model were established as theoretical frameworks. Computer Science and Information Technology have had a major influence on Cognitive Science theory. The Cognitive concepts of working memory (formerly known as short-term memory) and long-term memory have been facilitated by research and technology from the field of Computer Science. Another major influence on the field of Cognitive Science is Noam Chomsky. Today researchers are concentrating on topics like cognitive load, information processing, and media psychology. These theoretical perspectives influence instructional design.There are two separate schools of cognitivism and these are the cognitivist and social cognitivist. The former focuses on the understanding of the thinking or cognitive processes of an individual while the latter includes social processes as influences in learning besides cognition. These two schools, however, share the view that learning is more than a behavioral change but as a mental process used by the learner.\n\n\n=== Constructivism ===\nEducational psychologists distinguish between several types of constructivism: individual (or psychological) constructivism, such as Piaget's theory of cognitive development, and social constructivism. This form of constructivism has a primary focus on how learners construct their own meaning from new information, as they interact with reality and with other learners who bring different perspectives. Constructivist learning environments require students to use their prior knowledge and experiences to formulate new, related, and/or adaptive concepts in learning (Termos, 2012). Under this framework the role of the teacher becomes that of a facilitator, providing guidance so that learners can construct their own knowledge. Constructivist educators must make sure that the prior learning experiences are appropriate and related to the concepts being taught. Jonassen (1997) suggests \"well-structured\" learning environments are useful for novice learners and that \"ill-structured\" environments are only useful for more advanced learners. Educators utilizing a constructivist perspective may emphasize an active learning environment that may incorporate learner centered problem-based learning, project-based learning, and inquiry-based learning, ideally involving real-world scenarios, in which students are actively engaged in critical thinking activities. An illustrative discussion and example can be found in the 1980s deployment of constructivist cognitive learning in computer literacy, which involved programming as an instrument of learning. LOGO, a programming language, embodied an attempt to integrate Piagetan ideas with computers and technology. Initially there were broad, hopeful claims, including \"perhaps the most controversial claim\" that it would \"improve general problem-solving skills\" across disciplines. However, LOGO programming skills did not consistently yield cognitive benefits. It was \"not as concrete\" as advocates claimed, it privileged \"one form of reasoning over all others,\" and it was difficult to apply the thinking activity to non-LOGO-based activities. By the late 1980s, LOGO and other similar programming languages had lost their novelty and dominance and were gradually de-emphasized amid criticisms.From a constructivist approach, the research works on the human learning process as a complex adaptive system developed by Peter Belohlavek showed that it is the concept that the individual has that drives the accommodation process to assimilate new knowledge in the long-term memory, defining learning as an intrinsically freedom-oriented and active process. As a student-centered learning approach, the unicist reflection driven learning installs adaptive knowledge objects in the mind of the learner based on a cyclic process of: “action-reflection-action” to foster an adaptive behavior.\n\n\n== Practice ==\n\nThe extent to which e-learning assists or replaces other learning and teaching approaches is variable, ranging on a continuum from none to fully online distance learning. A variety of descriptive terms have been employed (somewhat inconsistently) to categorize the extent to which technology is used. For example, \"hybrid learning\" or \"blended learning\" may refer to classroom aids and laptops, or may refer to approaches in which traditional classroom time is reduced but not eliminated, and is replaced with some online learning. \"Distributed learning\" may describe either the e-learning component of a hybrid approach, or fully online distance learning environments.\n\n\n=== Synchronous and asynchronous ===\nE-learning may either be synchronous or asynchronous. Synchronous learning occurs in real-time, with all participants interacting at the same time, while asynchronous learning is self-paced and allows participants to engage in the exchange of ideas or information without the dependency of other participants′ involvement at the same time.\nSynchronous learning refers to the exchange of ideas and information with one or more participants during the same period. Examples are face-to-face discussion, online real-time live teacher instruction and feedback, Skype conversations, and chat rooms or virtual classrooms where everyone is online and working collaboratively at the same time. Since students are working collaboratively, synchronized learning helps students become more open minded because they have to actively listen and learn from their peers.  Synchronized learning fosters online awareness and improves many students' writing skills.Asynchronous learning may use technologies such as learning management systems,  email, blogs, wikis, and discussion boards, as well as web-supported textbooks, hypertext documents,  audio video courses, and social networking using web 2.0. At the professional educational level, training may include virtual operating rooms. Asynchronous learning is beneficial for students who have health problems or who have child care responsibilities.  They have the opportunity to complete their work in a low stress environment and within a more flexible time frame. In asynchronous online courses, students proceed at their own pace.  If they need to listen to a lecture a second time, or think about a question for a while, they may do so without fearing that they will hold back the rest of the class. Through online courses, students can earn their diplomas more quickly, or repeat failed courses without the embarrassment of being in a class with younger students. Students have access to an incredible variety of enrichment courses in online learning, and can participate in college courses, internships, sports, or work and still graduate with their class.\n\n\n=== Linear learning ===\nComputer-based training (CBT) refers to self-paced learning activities delivered on a computer or handheld device such as a tablet or smartphone.  CBT initially delivered content via CD-ROM, and typically presented content linearly, much like reading an online book or manual.  For this reason, CBT is often used to teach static processes, such as using software or completing mathematical equations.  Computer-based training is conceptually similar to web-based training (WBT) which are delivered via Internet using a web browser.\nAssessing learning in a CBT is often by assessments that can be easily scored by a computer such as multiple choice questions, drag-and-drop, radio button, simulation or other interactive means. Assessments are easily scored and recorded via online software, providing immediate end-user feedback and completion status. Users are often able to print completion records in the form of certificates.CBTs provide learning stimulus beyond traditional learning methodology from textbook, manual, or classroom-based instruction.  CBTs can be a good alternative to printed learning materials since rich media, including videos or animations, can be embedded to enhance the learning.Help, CBTs pose some learning challenges.  Typically, the creation of effective CBTs requires enormous resources.  The software for developing CBTs is often more complex than a subject matter expert or teacher is able to use. The lack of human interaction can limit both the type of content that can be presented and the type of assessment that can be performed, and may need supplementation with online discussion or other interactive elements.\n\n\n=== Collaborative learning ===\n\nComputer-supported collaborative learning (CSCL) uses instructional methods designed to encourage or require students to work together on learning tasks, allowing social learning. CSCL is similar in concept to the terminology, \"e-learning 2.0\" and \"networked collaborative learning\" (NCL). With Web 2.0 advances, sharing information between multiple people in a network has become much easier and use has increased. One of the main reasons for its usage states that it is \"a breeding ground for creative and engaging educational endeavors.\" Learning takes place through conversations about content and grounded interaction about problems and actions. This collaborative learning differs from instruction in which the instructor is the principal source of knowledge and skills. The neologism \"e-learning 1.0\" refers to direct instruction used in early computer-based learning and training systems (CBL). In contrast to that linear delivery of content, often directly from the instructor's material, CSCL uses social software such as blogs, social media, wikis, podcasts, cloud-based document portals, and discussion groups and virtual worlds. This phenomenon has been referred to as Long Tail Learning. Advocates of social learning claim that one of the best ways to learn something is to teach it to others. Social networks have been used to foster online learning communities around subjects as diverse as test preparation and language education. mobile-assisted language learning (MALL) is the use of handheld computers or cell phones to assist in language learning.\nCollaborative apps allow students and teachers to interact while studying. Apps are designed after games, which provide a fun way to revise. When the experience is enjoyable the students become more engaged. Games also usually come with a sense of progression, which can help keep students motivated and consistent while trying to improve.Classroom 2.0 refers to online multi-user virtual environments (MUVEs) that connect schools across geographical frontiers. Known as \"eTwinning\", computer-supported collaborative learning (CSCL) allows learners in one school to communicate with learners in another that they would not get to know otherwise, enhancing educational outcomes and cultural integration.\nFurther, many researchers distinguish between collaborative and cooperative approaches to group learning. For example, Roschelle and Teasley (1995) argue that \"cooperation is accomplished by the division of labour among participants, as an activity where each person is responsible for a portion of the problem solving\", in contrast with collaboration that involves the \"mutual engagement of participants in a coordinated effort to solve the problem together.\"\n\n\n=== Flipped classroom ===\n\nThis is an instructional strategy in which computer-assisted teaching is integrated with classroom instruction. Students are given basic essential instruction, such as lectures, before class instead of during class. Instructional content is delivered outside of the classroom, often online. The out-of-class delivery includes streaming video, reading materials, online chats, and other resources. This frees up classroom time for teachers to more actively engage with learners.\n\n\n== Technologies ==\n\nEducational media and tools can be used for:\n\ntask structuring support: help with how to do a task (procedures and processes),\naccess to knowledge bases (help user find information needed)\nalternate forms of knowledge representation (multiple representations of knowledge, e.g. video, audio, text, image, data)Numerous types of physical technology are currently used: digital cameras, video cameras, interactive whiteboard tools, document cameras, electronic media, and LCD projectors. Combinations of these techniques include blogs, collaborative software, ePortfolios, and virtual classrooms.\nThe current design of this type of applications includes the evaluation through tools of cognitive analysis that allow to identify which elements optimize the use of these platforms.\n\n\n=== Audio and video ===\nVideo technology has included VHS tapes and DVDs, as well as on-demand and synchronous methods with digital video via server or web-based options such as streamed video and webcams. Telecommuting can connect with speakers and other experts. Interactive digital video games are being used at K-12 and higher education institutions.Radio offers a synchronous educational vehicle, while streaming audio over the internet with webcasts and podcasts can be asynchronous.  Classroom microphones, often wireless, can enable learners and educators to interact more clearly.\nScreencasting allows users to share their screens directly from their browser and make the video available online so that other viewers can stream the video directly. The presenter thus has the ability to show their ideas and flow of thoughts rather than simply explain them as simple text content. In combination with audio and video, the educator can mimic the one-on-one experience of the classroom. Learners have an ability to pause and rewind, to review at their own pace, something a classroom cannot always offer.\nWebcams and webcasting have enabled creation of virtual classrooms and virtual learning environment. Webcams are also being used to counter plagiarism and other forms of academic dishonesty that might occur in an e-learning environment.\n\n\n=== Computers, tablets and mobile devices ===\n\nCollaborative learning is a group-based learning approach in which learners are mutually engaged in a coordinated fashion to achieve a learning goal or complete a learning task. With recent developments in smartphone technology, the processing powers and storage capabilities of modern mobiles allow for advanced development and use of apps. Many app developers and education experts have been exploring smartphone and tablet apps as a medium for collaborative learning.\nComputers and tablets enable learners and educators to access websites as well as applications. Many mobile devices support m-learning.\nMobile devices such as clickers and smartphones can be used for interactive audience response feedback. Mobile learning can provide performance support for checking the time, setting reminders, retrieving worksheets, and instruction manuals.Such devices as iPads are used for helping disabled (visually impaired or with multiple disabilities) children in communication development as well as in improving physiological activity, according to the iStimulation Practice Report.\n\n\n=== Collaborative and social learning ===\n\nGroup webpages, blogs, wikis, and Twitter allow learners and educators to post thoughts, ideas, and comments on a website in an interactive learning environment. Social networking sites are virtual communities for people interested in a particular subject to communicate by voice, chat, instant message, video conference, or blogs. The National School Boards Association found that 96% of students with online access have used social networking technologies, and more than 50% talk online about schoolwork. Social networking encourages collaboration and engagement and can be a motivational tool for self-efficacy amongst students.\n\n\n=== Whiteboards ===\n\nThere are three types of whiteboards. The initial whiteboards, analogous to blackboards, date from the late 1950s. The term whiteboard is also used metaphorically to refer to virtual whiteboards in which computer software applications simulate whiteboards by allowing writing or drawing. This is a common feature of groupware for virtual meeting, collaboration, and instant messaging. Interactive whiteboards allow learners and instructors to write on the touch screen. The screen markup can be on either a blank whiteboard or any computer screen content. Depending on permission settings, this visual learning can be interactive and participatory, including writing and manipulating images on the interactive whiteboard.\n\n\n=== Virtual classroom ===\n \nA virtual learning environment (VLE), also known as a learning platform, simulates a virtual classroom or meetings by simultaneously mixing several communication technologies. Web conferencing software enables students and instructors to communicate with each other via webcam, microphone, and real-time chatting in a group setting. Participants can raise hands, answer polls or take tests.  Students are able to whiteboard and screencast when given rights by the instructor, who sets permission levels for text notes, microphone rights and mouse control.A virtual classroom provides the opportunity for students to receive direct instruction from a qualified teacher in an interactive environment.  Learners can have direct and immediate access to their instructor for instant feedback and direction.  The virtual classroom provides a structured schedule of classes, which can be helpful for students who may find the freedom of asynchronous learning to be overwhelming.  In addition, the virtual classroom provides a social learning environment that replicates the traditional \"brick and mortar\" classroom.  Most virtual classroom applications provide a recording feature.  Each class is recorded and stored on a server, which allows for instant playback of any class over the course of the school year.  This can be extremely useful for students to retrieve missed material or review concepts for an upcoming exam.  Parents and auditors have the conceptual ability to monitor any classroom to ensure that they are satisfied with the education the learner is receiving.\nIn higher education especially, a virtual learning environment (VLE) is sometimes combined with a management information system (MIS) to create a managed learning environment, in which all aspects of a course are handled through a consistent user interface throughout the institution. Physical universities and newer online-only colleges offer select academic degrees and certificate programs via the Internet. Some programs require students to attend some campus classes or orientations, but many are delivered completely online.  Several universities offer online student support services, such as online advising and registration, e-counseling, online textbook purchases, student governments and student newspapers.\n\n\n==== Augmented Reality ====\nAugmented reality (AR) provides students and teachers the opportunity to create layers of digital information, including both virtual world and real world elements, to interact with in real time. An example tool is Lumilo, a mixed-reality smart glass that provides teachers with real-time analytics of every student in the classroom. Prior studies have shown that Lumilo can change classroom dynamics and direct teachers' time and attention to students who require human assistance, such as those who exhibit unproductive persistence or game the system. Using Lumilo, teachers were able to more frequently offer unsolicited help, without having to wait for students to raise their hands.\nAR technology plays an important role in the future of the classroom where human / AI co-orchestration takes place seamlessly. Students would switch between individual and collaborative learning dynamically, based on their own learning pace, while teachers, with the help of AR, monitor the classroom and provide necessary interventions in cases where computer systems are not yet designed to handle. In this vision, the technology's role is to enhance, rather than replace, human teachers' capabilities.\n\n\n=== Learning management system ===\n\nA learning management system (LMS) is software used for delivering, tracking and managing training and education. It tracks data about attendance, time on task, and student progress. Educators can post announcements, grade assignments, check on course activity, and participate in class discussions. Students can submit their work, read and respond to discussion questions, and take quizzes. An LMS may allow teachers, administrators, students, and permitted additional parties (such as parents, if appropriate) to track various metrics. LMSs range from systems for managing training/educational records to software for distributing courses over the Internet and offering features for online collaboration. The creation and maintenance of comprehensive learning content requires substantial initial and ongoing investments of human labor. Effective translation into other languages and cultural contexts requires even more investment by knowledgeable personnel.Internet-based learning management systems include Canvas, Blackboard Inc. and Moodle. These types of LMS allow educators to run a learning system partially or fully online, asynchronously or synchronously. Learning Management Systems also offer a non-linear presentation of content and curricular goals, giving students the choice of pace and order of information learned. Blackboard can be used for K-12 education, Higher Education, Business, and Government collaboration. Moodle is a free-to-download Open Source Course Management System that provides blended learning opportunities as well as platforms for distance learning courses. Eliademy is a free cloud-based Course Management System that provides blended learning opportunities as well as platforms for distance learning courses.\n\n\n==== Learning content management system ====\nA learning content management system (LCMS) is software for author content (courses, reusable content objects). An LCMS may be solely dedicated to producing and publishing content that is hosted on an LMS, or it can host the content itself.  The Aviation Industry Computer-Based Training Committee (AICC) specification provides support for content that is hosted separately from the LMS.\nA recent trend in LCMSs is to address this issue through crowdsourcing (cf.SlideWiki).\n\n\n==== Computer-aided assessment ====\nComputer-aided assessment (e-assessment) ranges from automated multiple-choice tests to more sophisticated systems. With some systems, feedback can be geared towards a student's specific mistakes or the computer can navigate the student through a series of questions adapting to what the student appears to have learned or not learned. Formative assessment sifts out the incorrect answers, and these questions are then explained by the teacher. The learner then practices with slight variations of the sifted out questions. The process is completed by summative assessment using a new set of questions that only cover the topics previously taught.\n\n\n==== Electronic performance support system ====\nAn electronic performance support system (EPSS) is, according to Barry Raybould, \"a computer-based system that improves worker productivity by providing on-the-job access to integrated information, advice, and learning experiences\".\n\n\n==== Training management system ====\nA training management system or training resource management system is a software designed to optimize instructor-led training management. Similar to an enterprise resource planning (ERP), it is a back office tool which aims at streamlining every aspect of the training process: planning (training plan and budget forecasting), logistics (scheduling and resource management), financials (cost tracking, profitability), reporting, and sales for-profit training providers. A training management system can be used to schedule instructors, venues and equipment through graphical agendas, optimize resource utilization, create a training plan and track remaining budgets, generate reports and share data between different teams.\nWhile training management systems focus on managing instructor-led training, they can complete an LMS. In this situation, an LMS will manage e-learning delivery and assessment, while a training management system will manage ILT and back-office budget planning, logistic and reporting.\n\n\n== Standards and ecosystem ==\n\n\n=== Learning objects ===\n\n\n=== Content ===\nContent and design architecture issues include pedagogy and learning object re-use. One approach looks at five aspects:\nFact – unique data (e.g. symbols for Excel formula, or the parts that make up a learning objective)\nConcept – a category that includes multiple examples (e.g. Excel formulas, or the various types/theories of instructional design)\nProcess – a flow of events or activities (e.g. how a spreadsheet works, or the five phases in ADDIE)\nProcedure – step-by-step task (e.g. entering a formula into a spreadsheet, or the steps that should be followed within a phase in ADDIE)\nStrategic principle – task performed by adapting guidelines (e.g. doing a financial projection in a spreadsheet, or using a framework for designing learning environments)\n\n\n==== Pedagogical elements ====\nPedagogical elements are defined as structures or units of educational material. They are the educational content that is to be delivered. These units are independent of format, meaning that although the unit may be delivered in various ways, the pedagogical structures themselves are not the textbook, web page, video conference, Podcast, lesson, assignment, multiple choice question, quiz, discussion group or a case study, all of which are possible methods of delivery.\n\n\n=== Learning objects standards ===\nMuch effort has been put into the technical reuse of electronically based teaching materials and in particular creating or re-using learning objects. These are self-contained units that are properly tagged with keywords, or other metadata, and often stored in an XML file format. Creating a course requires putting together a sequence of learning objects. There are both proprietary and open, non-commercial and commercial, peer-reviewed repositories of learning objects such as the Merlot repository. Sharable Content Object Reference Model (SCORM) is a collection of standards and specifications that applies to certain web-based e-learning. Other specifications such as Schools Interoperability Framework allow for the transporting of learning objects, or for categorizing metadata (LOM).\n\n\n=== Artificial intelligence ===\n\nAs artificial intelligence (AI) becomes more prominent in this age of big data, it has also been widely adopted in K-12 classrooms. One prominent class of AI-enhanced educational technology is intelligent tutoring systems (ITSs), designed to provide immediate and personalized feedbacks to students. The incentive to develop ITS comes from educational studies showing that individual tutoring is much more effective than group teaching, in addition to the need for promoting learning on a larger scale. Over the years, a combination of cognitive science theories and data-driven techniques have greatly enhanced the capabilities of ITS, allowing it to model a wide range of students' characteristics, such as knowledge, affect, off-task behavior and wheel spinning. There is ample evidence that ITSs are highly effective in helping students learn.Recent works have also focused on developing AI-enhanced learning tools that supports human teachers in coordinating classroom activities. The teacher can support students in a way that AI cannot, but is unable to process the large amount of real-time data analytics provided by the computer system. On the other hand, AI can share the workload and recommend the best course of actions (e.g., by pointing out which students require the most help), but can only operate in the pre-specified domain and cannot handle tasks such as providing emotional support or remedial lessons to students in need. However, existing systems were designed under the assumption that students progress at the same pace. Understanding how to support teachers in a realistic, highly differentiated, self-paced classroom, remains an open research problem.Academic conferences that promote cutting-edge research in this field include Artificial Intelligence in Education (AIED), Intelligent Tutoring Systems (ITS), Educational Data Mining (EDM) and Learning Analytics & Knowledge (LAK).\n\n\n== Settings and sectors ==\n\n\n=== Preschool ===\nVarious forms of electronic media can be a feature of preschool life. Although parents report a positive experience, the impact of such use has not been systematically assessed.The age when a given child might start using a particular technology such as a cellphone or computer might depend on matching a technological resource to the recipient's developmental capabilities, such as the age-anticipated stages labeled by Swiss psychologist, Jean Piaget. Parameters, such as age-appropriateness, coherence with sought-after values, and concurrent entertainment and educational aspects, have been suggested for choosing media.At the preschool level, technology can be introduced in several ways. At the most basic is the use of computers, tablets, and audio and video resources in classrooms. Additionally, there are many resources available for parents and educators to introduce technology to young children or to use technology to augment lessons and enhance learning. Some options that are age-appropriate are video- or audio- recording of their creations, introducing them to the use of the internet through browsing age-appropriate websites, providing assistive technology to allow differently-abled children to participate with the rest of their peers, educational apps, electronic books, and educational videos. There are many free and paid educational website and apps that are directly targeting the educational needs of preschool children. These include Starfall, ABC mouse, PBS Kids Video, Teachme, and Montessori crosswords. Educational technology in the form of electronic books [109] offer preschool children the option to store and retrieve several books on one device, thus bringing together the traditional action of reading along with the use of educational technology. Educational technology is also thought to improve hand-eye coordination, language skills, visual attention and motivation to complete educational tasks, and allows children to experience things they otherwise wouldn't. There are several keys to making the most educational use out of introducing technology at the preschool level: technology must be used appropriately, should allow access to learning opportunities, should include the interaction of parents and other adults with the preschool children, and should be developmentally appropriate. Allowing access to learning opportunities especially for allowing disabled children to have access to learning opportunities, giving bilingual children the opportunity to communicate and learn in more than one language, bringing in more information about STEM subjects, and bringing in images of diversity that may be lacking in the child's immediate environment.\n\n\n=== Primary and secondary ===\n\nE-learning is utilized by public K–12 schools in the United States as well as private schools. Some e-learning environments take place in a traditional classroom, others allow students to attend classes from home or other locations. There are several states that are utilizing virtual school platforms for e-learning across the country that continue to increase. Virtual school enables students to log into synchronous learning or asynchronous learning courses anywhere there is an internet connection.\nE-learning is increasingly being utilized by students who may not want to go to traditional brick and mortar schools due to severe allergies or other medical issues, fear of school violence and school bullying and students whose parents would like to homeschool but do not feel qualified. Online schools create a haven for students to receive a quality education while almost completely avoiding these common problems. Online charter schools also often are not limited by location, income level or class size in the way brick and mortar charter schools are.E-learning also has been rising as a supplement to the traditional classroom. Students with special talents or interests outside of the available curricula use e-learning to advance their skills or exceed grade restrictions. Some online institutions connect students with instructors via web conference technology to form a digital classroom.\nNational private schools are also available online. These provide the benefits of e-learning to students in states where charter online schools are not available. They also may allow students greater flexibility and exemption from state testing. Some of these schools are available at the high school level and offer college prep courses to students.\nVirtual education in K-12 schooling often refers to virtual schools, and in higher education to virtual universities. Virtual schools are \"cybercharter schools\" with innovative administrative models and course delivery technology.Education technology also seems to be an interesting method of engaging gifted youths that are under-stimulated in their current educational program. This can be achieved with after-school programs or even technologically-integrated curricula, for example: Virtual reality integrated courses (VRIC) can be developed for any course in order to give them such stimulation. 3D printing integrated courses (3dPIC) can also give youths the stimulation they need in their educational journey. Université de Montréal's Projet SEUR in collaboration with Collège Mont-Royal and La Variable are heavily developing this field.\n\n\n=== Higher education ===\n\nOnline college course enrolment has seen a 29% increase in enrolment with nearly one third of all college students, or an estimated 6.7 million students are currently enrolled in online classes. In 2009, 44 percent of post-secondary students in the USA were taking some or all of their courses online, which was projected to rise to 81 percent by 2014.Although a large proportion of for-profit higher education institutions now offer online classes, only about half of private, non-profit schools do so.  Private institutions may become more involved with on-line presentations as the costs decrease. Properly trained staff must also be hired to work with students online. These staff members need to understand the content area, and also be highly trained in the use of the computer and Internet. Online education is rapidly increasing, and online doctoral programs have even developed at leading research universities.Although massive open online courses (MOOCs) may have limitations that preclude them from fully replacing college education, such programs have significantly expanded. MIT, Stanford and Princeton University offer classes to a global audience, but not for college credit.  University-level programs, like edX founded by Massachusetts Institute of Technology and Harvard University, offer wide range of disciplines at no charge, while others permit students to audit a course at no charge but require a small fee for accreditation. MOOCs have not had a significant impact on higher education and declined after the initial expansion, but are expected to remain in some form.\n\n\n=== Corporate and professional ===\nE-learning is being used by companies to deliver mandatory compliance training and updates for regulatory compliance, soft skills and IT skills training, continuing professional development (CPD) and other valuable workplace skills. Companies with spread out distribution chains use e-learning for delivering information about the latest product developments. Most of corporate e-learning is asynchronous and delivered and managed via learning management systems. The big challenge in corporate e-learning is to engage the staff, especially on compliance topics for which periodic staff training is mandated by the law or regulations.\n\n\n=== Government and public ===\nThere is an important need for recent, reliable, and high-quality health information to be made available to the public as well as in summarized form for public health providers. Providers have indicated the need for automatic notification of the latest research, a single searchable portal of information, and access to grey literature. The Maternal and Child Health (MCH) Library is funded by the U.S. Maternal and Child Health Bureau to screen the latest research and develop automatic notifications to providers through the MCH Alert. Another application in public health is the development of mHealth (use of mobile telecommunication and multimedia into global public health). MHealth has been used to promote prenatal and newborn services, with positive outcomes. In addition, \"Health systems have implemented mHealth programs to facilitate emergency medical responses, point-of-care support, health promotion and data collection.\"\nIn low and middle income countries, mHealth is most frequently used as one-way text messages or phone reminders to promote treatment adherence and gather data.\n\n\n== Benefits ==\nEffective technology use deploys multiple evidence-based strategies concurrently (e.g. adaptive content, frequent testing, immediate feedback, etc.), as do effective teachers. Using computers or other forms of technology can give students practice on core content and skills while the teacher can work with others, conduct assessments, or perform other tasks.  Through the use of educational technology, education is able to be individualized for each student allowing for better differentiation and allowing students to work for mastery at their own pace.Modern educational technology can improve access to education, including full degree programs. It enables better integration for non-full-time students, particularly in continuing education, and improved interactions between students and instructors. Learning material can be used for long distance learning and are accessible to a wider audience. Course materials are easy to access. In 2010, 70.3% of American family households had access to the internet. In 2013, according to Canadian Radio Television and Telecommunications Commission Canada, 79% of homes have access to the internet. Students can access and engage with numerous online resources at home. Using online resources can help students spend more time on specific aspects of what they may be learning in school, but at home.  Schools like the Massachusetts Institute of Technology (MIT) have made certain course materials free online. Although some aspects of a classroom setting are missed by using these resources, they are helpful tools to add additional support to the educational system. The necessity to pay for transport to the educational facility is removed.\nStudents appreciate the convenience of e-learning, but report greater engagement in face-to-face learning environments. Colleges and universities are working towards combating this issue by utilizing WEB 2.0 technologies as well as incorporating more mentorships between students and faculty members. According to James Kulik, who studies the effectiveness of computers used for instruction, students usually learn more in less time when receiving computer-based instruction and they like classes more and develop more positive attitudes toward computers in computer-based classes. Students can independently solve problems. There are no intrinsic age-based restrictions on difficulty level, i.e. students can go at their own pace. Students editing their written work on word processors improve the quality of their writing. According to some studies, the students are better at critiquing and editing written work that is exchanged over a computer network with students they know. Studies completed in \"computer intensive\" settings found increases in student-centric, cooperative and higher order learning, writing skills, problem solving, and using technology. In addition, attitudes toward technology as a learning tool by parents, students and teachers are also improved.\nEmployers' acceptance of online education has risen over time. More than 50% of human resource managers SHRM surveyed for an August 2010 report said that if two candidates with the same level of experience were applying for a job, it would not have any kind of effect whether the candidate's obtained degree was acquired through an online or a traditional school. Seventy-nine percent said they had employed a candidate with an online degree in the past 12 months. However, 66% said candidates who get degrees online were not seen as positively as a job applicant with traditional degrees.The use of educational apps generally has a positive effect on learning. Pre- and post- tests reveal that the use of apps on mobile devices reduces the achievement gap between struggling and average students. Some educational apps improve group work by allowing students to receive feedback on answers and promoting collaboration in solving problems, examples of these apps can be found in the third paragraph. The benefits of app-assisted learning have been exhibited in all age groups. Kindergarten students that use iPads show much higher rates of literacy than non-users.  Medical students at University of California Irvine that utilized iPad academically have been reported to score 23% higher on national exams than \nprevious classes that did not.\n\n\n== Disadvantages ==\nGlobally, factors like change management, technology obsolescence and vendor- developer partnership are major restraints that are hindering the growth of Educational technology market.In US, state and the federal government increased funding, as well as private venture capital has been flowing into education sector. However, as of 2013, none were looking at technology return on investment (ROI) to connect expenditures on technology with improved student outcomes.New technologies are frequently accompanied by unrealistic hype and promise regarding their transformative power to change education for the better or in allowing better educational opportunities to reach the masses. Examples include silent film, broadcast radio, and television, none of which have maintained much of a foothold in the daily practices of mainstream, formal education. Technology, in and of itself, does not necessarily result in fundamental improvements to educational practice. The focus needs to be on the learner's interaction with technology—not the technology itself. It needs to be recognized as \"ecological\" rather than \"additive\" or \"subtractive\". In this ecological change, one significant change will create total change.According to Branford et al., \"technology does not guarantee effective learning\" and inappropriate use of technology can even hinder it. A University of Washington study of infant vocabulary shows that it is slipping due to educational baby DVDs. Published in the Journal of Pediatrics, a 2007 University of Washington study on the vocabulary of babies surveyed over 1,000 parents in Washington and Minnesota. The study found that for every one hour that babies 8–16 months of age watched DVDs and Videos they knew 6-8 fewer of 90 common baby words than the babies that did not watch them. Andrew Meltzoff, a surveyor in this study states that the result makes sense, that if the baby's \"alert time\" is spent in front of DVDs and TV, instead of with people speaking, the babies are not going to get the same linguistic experience. Dr. Dimitri Chistakis, another surveyor reported that the evidence is mounting that baby DVDs are of no value and may be harmful.Adaptive instructional materials tailor questions to each student's ability and calculate their scores, but this encourages students to work individually rather than socially or collaboratively (Kruse, 2013). Social relationships are important but high-tech environments may compromise the balance of trust, care and respect between teacher and student.Massively open online courses (MOOCs), although quite popular in discussions of technology and education in developed countries (more so in the US), are not a major concern in most developing or low-income countries. One of the stated goals of MOOCs is to provide less fortunate populations (i.e., in developing countries) an opportunity to experience courses with US-style content and structure. However, research shows only 3% of the registrants are from low-income countries and although many courses have thousands of registered students only 5-10% of them complete the course.  MOOCs also implies that certain curriculum and teaching methods are superior and this could eventually wash over (or possibly washing out) local educational institutions, cultural norms and educational traditions.With the Internet and social media, using educational apps makes the students highly susceptible to distraction and sidetracking. Even though proper use has shown to increase student performances, being distracted would be detrimental. Another disadvantage is increased potential for cheating. Smartphones can be very easy to hide and use inconspicuously, especially if their use is normalized in the classroom. These disadvantages can be managed with strict rules and regulations on mobile phone use.\n\n\n=== Over-stimulation ===\nElectronic devices such as cellphones and computers facilitate rapid access to a stream of sources, each of which may receive cursory attention. Michel Rich, an associate professor at Harvard Medical School and executive director of the center on Media and Child Health in Boston, said of the digital generation, \"Their brains are rewarded not for staying on task, but for jumping to the next thing. The worry is we're raising a generation of kids in front of screens whose brains are going to be wired differently.\" Students have always faced distractions; computers and cellphones are a particular challenge because the stream of data can interfere with focusing and learning. Although these technologies affect adults too, young people may be more influenced by it as their developing brains can easily become habituated to switching tasks and become unaccustomed to sustaining attention. Too much information, coming too rapidly, can overwhelm thinking.Technology is \"rapidly and profoundly altering our brains.\"  High exposure levels stimulate brain cell alteration and release neurotransmitters, which causes the strengthening of some neural pathways and weakening of others. This leads to heightened stress levels on the brain that, at first, boost energy levels, but, over time, actually augment memory, impair cognition, lead to depression, alter the neural circuitry of the hippocampus, amygdala and prefrontal cortex. These are the brain regions that control mood and thought. If unchecked, the underlying structure of the brain could be altered. Over-stimulation due to technology may begin too young. When children are exposed before the age of seven, important developmental tasks may be delayed, and bad learning habits might develop, which \"deprives children of the exploration and play that they need to develop.\" Media psychology is an emerging specialty field that embraces electronic devices and the sensory behaviors occurring from the use of educational technology in learning.\n\n\n=== Sociocultural criticism ===\nAccording to Lai, \"the learning environment is a complex system where the interplay and interactions of many things impact the outcome of learning.\" When technology is brought into an educational setting, the pedagogical setting changes in that technology-driven teaching can change the entire meaning of an activity without adequate research validation. If technology monopolizes an activity, students can begin to develop the sense that \"life would scarcely be thinkable without technology.\"Leo Marx considered the word \"technology\" itself as problematic, susceptible to reification and \"phantom objectivity\", which conceals its fundamental nature as something that is only valuable insofar as it benefits the human condition.  Technology ultimately comes down to affecting the relations between people, but this notion is obfuscated when technology is treated as an abstract notion devoid of good and evil.  Langdon Winner makes a similar point by arguing that the underdevelopment of the philosophy of technology leaves us with an overly simplistic reduction in our discourse to the supposedly dichotomous notions of the \"making\" versus the \"uses\" of new technologies, and that a narrow focus on \"use\" leads us to believe that all technologies are neutral in moral standing.  These critiques would have us ask not, \"How do we maximize the role or advancement of technology in education?\", but, rather, \"What are the social and human consequences of adopting any particular technology?\"\nWinner viewed technology as a \"form of life\" that not only aids human activity, but that also represents a powerful force in reshaping that activity and its meaning. For example, the use of robots in the industrial workplace may increase productivity, but they also radically change the process of production itself, thereby redefining what is meant by \"work\" in such a setting.  In education, standardized testing has arguably redefined the notions of learning and assessment. We rarely explicitly reflect on how strange a notion it is that a number between, say, 0 and 100 could accurately reflect a person's knowledge about the world. According to Winner, the recurring patterns in everyday life tend to become an unconscious process that we learn to take for granted.  Winner writes,\n\nBy far the greatest latitude of choice exists the very first time a particular instrument, system, or technique is introduced.  Because choices tend to become strongly fixed in material equipment, economic investment, and social habit, the original flexibility vanishes for all practical purposes once the initial commitments are made.  In that sense, technological innovations are similar to legislative acts or political foundings that establish a framework for public order that will endure over many generations. (p. 29) \nWhen adopting new technologies, there may be one best chance to \"get it right.\" Seymour Papert (p. 32) points out a good example of a (bad) choice that has become strongly fixed in social habit and material equipment: our \"choice\" to use the QWERTY keyboard. The QWERTY arrangement of letters on the keyboard was originally chosen, not because it was the most efficient for typing, but because early typewriters were prone to jam when adjacent keys were struck in quick succession.  Now that typing has become a digital process, this is no longer an issue, but the QWERTY arrangement lives on as a social habit, one that is very difficult to change.\nNeil Postman endorsed the notion that technology impacts human cultures, including the culture of classrooms, and that this is a consideration even more important than considering the efficiency of a new technology as a tool for teaching.  Regarding the computer's impact on education, Postman writes (p. 19):\n\nWhat we need to consider about the computer has nothing to do with its efficiency as a teaching tool.  We need to know in what ways it is altering our conception of learning, and how in conjunction with television, it undermines the old idea of school.There is an assumption that technology is inherently interesting so it must be helpful in education; based on research by Daniel Willingham, that is not always the case.  He argues that it does not necessarily matter what the technological medium is, but whether or not the content is engaging and utilizes the medium in a beneficial way.\n\n\n==== Digital divide ====\n\nThe concept of the digital divide is a gap between those who have access to digital technologies and those who do not. Access may be associated with age, gender, socio-economic status, education, income, ethnicity, and geography.\n\n\n==== Data protection ====\nAccording to a report by the Electronic Frontier Foundation, large amounts of personal data on children is collected by electronic devices that are distributed in schools in the United States. Often far more information than necessary is collected, uploaded and stored indefinitely. Aside name and date of birth, this information can include the child's browsing history, search terms, location data, contact lists, as well as behavioral information. Parents are not informed or, if informed, have little choice. According to the report, this constant surveillance resulting from educational technology can \"warp children's privacy expectations, lead them to self-censor, and limit their creativity\".\n\n\n== Teacher training ==\nSince technology is not the end goal of education, but rather a means by which it can be accomplished, educators must have a good grasp of the technology and its advantages and disadvantages. Teacher training aims for effective integration of classroom technology.The evolving nature of technology may unsettle teachers, who may experience themselves as perpetual novices. Finding quality materials to support classroom objectives is often difficult. Random professional development days are inadequate.According to Jenkins, \"Rather than dealing with each technology in isolation, we would do better to take an ecological approach, thinking about the interrelationship among different communication technologies, the cultural communities that grow up around them, and the activities they support.\" Jenkins also suggested that the traditional school curriculum guided teachers to train students to be autonomous problem solvers. However, today's workers are increasingly asked to work in teams, drawing on different sets of expertise, and collaborating to solve problem. Learning styles and the methods of collecting information have evolved, and \"students often feel locked out of the worlds described in their textbooks through the depersonalized and abstract prose used to describe them\". These twenty-first century skills can be attained through the incorporation and engagement with technology. Changes in instruction and use of technology can also promote a higher level of learning among students with different types of intelligence.\n\n\n== Assessment ==\n\nThere are two distinct issues of assessment: the assessment of educational technology  and assessment with technology.Assessments of educational technology have included the Follow Through project.\nEducational assessment with technology may be either formative assessment or summative assessment. Instructors use both types of assessment to understand student progress and learning in the classroom. Technology has helped teachers create better assessments to help understand where students who are having trouble with the material are having issues.\nFormative assessment is more difficult, as the perfect form is ongoing and allows the students to show their learning in different ways depending on their learning styles. Technology has helped some teachers make their formative assessments better, particularly through the use of classroom response systems (CRS). A CRS is a tool in which the students each have a handheld device that partners up with the teacher's computer. The instructor then asks multiple choice or true or false questions and the students answer on their device. Depending on the software used, the answers may then be shown on a graph so students and teacher can see the percentage of students who gave each answer and the teacher can focus on what went wrong.Summative assessments are more common in classrooms and are usually set up to be more easily graded, as they take the form of tests or projects with specific grading schemes.  One huge benefit to tech-based testing is the option to give students immediate feedback on their answers. When students get these responses, they are able to know how they are doing in the class which can help push them to improve or give them confidence that they are doing well. Technology also allows for different kinds of summative assessment, such as digital presentations, videos, or anything else the teacher/students may come up with, which allows different learners to show what they learned more effectively. Teachers can also use technology to post graded assessments online for students to have a better idea of what a good project is.\nElectronic assessment uses information technology. It encompasses several potential applications, which may be teacher or student-oriented, including educational assessment throughout the continuum of learning, such as computerized classification testing, computerized adaptive testing, student testing, and grading an exam. E-Marking is an examiner led activity closely related to other e-assessment activities such as e-testing, or e-learning which are student-led. E-marking allows markers to mark a scanned script or online response on a computer screen rather than on paper.\nThere are no restrictions to the types of tests that can use e-marking, with e-marking applications designed to accommodate multiple choice, written, and even video submissions for performance examinations. E-marking software is used by individual educational institutions and can also be rolled out to the participating schools of awarding exam organisations. e-marking has been used to mark many well known high stakes examinations, which in the United Kingdom include  A levels and GCSE exams, and in the US includes the SAT test for college admissions. Ofqual reports that e-marking is the main type of marking used for general qualifications in the United Kingdom.\nIn 2014, the Scottish Qualifications Authority (SQA) announced that most of the National 5 question papers would be e-marked.In June 2015, the Odisha state government in India announced that it planned to use e-marking for all Plus II papers from 2016.\n\n\n== Analytics ==\nThe importance of self-assessment through tools made available on Educational Technology platforms has been growing. Self-assessment in education technology relies on students analyzing their strengths, weaknesses and areas where improvement is possible to set realistic goals in learning, improve their educational performances and track their progress. One of the unique tools for self-assessment made possible by education technology is Analytics. Analytics is data gathered on the student's activities on the learning platform, drawn into meaningful patterns that lead to a valid conclusion, usually through the medium of data visualization such as graphs. Learning analytics is the field that focuses on analyzing and reporting data about student's activities in order to facilitate learning.\n\n\n== Expenditure ==\nThe five key sectors of the e-learning industry are consulting, content, technologies, services and support. Worldwide, e-learning was estimated in 2000 to be over $48 billion according to conservative estimates. Commercial growth has been brisk. In 2014, the worldwide commercial market activity was estimated at $6 billion venture capital over the past five years, with self-paced learning generating $35.6 billion in 2011. North American e-learning generated $23.3 billion in revenue in 2013, with a 9% growth rate in cloud-based authoring tools and learning platforms.\n\n\n== Careers ==\n\nEducational technologists and psychologists apply basic educational and psychological research into an evidence-based applied science (or a technology) of learning or instruction. In research, these professions typically require a graduate degree (Master's, Doctorate, Ph.D., or D.Phil.) in a field related to educational psychology, educational media, experimental psychology, cognitive psychology or, more purely, in the fields of educational, instructional or human performance technology or instructional design. In industry, educational technology is utilized to train students and employees by a wide range of learning and communication practitioners, including instructional designers, technical trainers, technical communication and professional communication specialists, technical writers, and of course primary school and college teachers of all levels. The transformation of educational technology from a cottage industry to a profession is discussed by Shurville et al.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n Media related to Educational practices at Wikimedia Commons"}