{"text": "A massive open online course (MOOC ) is an online course aimed at unlimited participation and open access via the web. In addition to traditional course materials, such as filmed lectures, readings, and problem sets, many MOOCs provide interactive courses with user forums to support community interactions among students, professors, and teaching assistants (TAs), as well as immediate feedback to quick quizzes and assignments. MOOCs are a recent and widely researched development in distance education, first introduced in 2006 and emerged as a popular mode of learning in 2012.Early MOOCs often emphasized open-access features, such as open licensing of content, structure and learning goals, to promote the reuse and remixing of resources.  Some later MOOCs use closed licenses for their course materials while maintaining free access for students.\n\n\n== History ==\n\n\n=== Precursors ===\n\nBefore the Digital Age, distance learning appeared in the form of correspondence courses in the 1890s–1920s and later radio and television broadcast of courses and early forms of e-learning. Typically fewer than five percent of the students would complete a course. The 2000s saw changes in online, or e-learning and distance education, with increasing online presence, open learning opportunities, and the development of MOOCs. By 2010 audiences for the most popular college courses such as \"Justice\" with Michael J. Sandel and \"Human Anatomy\" with Marian Diamond were reaching millions.\n\n\n=== Early approaches ===\n\nThe first MOOCs emerged from the open educational resources (OER) movement, which was sparked by MIT OpenCourseWare project. The OER movement was motivated from work by researchers who pointed out that class size and learning outcomes had no established connection, with Daniel Barwick's work being the most often-cited example.  The term MOOC was coined in 2008 by Dave Cormier of the University of Prince Edward Island in response to a course called Connectivism and Connective Knowledge (also known as CCK08). CCK08, which was led by George Siemens of Athabasca University and Stephen Downes of the National Research Council, consisted of 25 tuition-paying students in Extended Education at the University of Manitoba, as well as over 2200 online students from the general public who paid nothing.  All course content was available through RSS feeds, and online students could participate through collaborative tools, including blog posts, threaded discussions in Moodle, and Second Life meetings. Stephen Downes considers these so-called cMOOCs to be more \"creative and dynamic\" than the current xMOOCs, which he believes \"resemble television shows or digital textbooks.\"Other cMOOCs were then developed; for example, Jim Groom from The University of Mary Washington and Michael Branson Smith of York College, City University of New York hosted MOOCs through several universities starting with 2011's 'Digital Storytelling' (ds106) MOOC. MOOCs from private, non-profit institutions emphasized prominent faculty members and expanded existing distance learning offerings (e.g., podcasts) into free and open online courses.Alongside the development of these open courses, other E-learning platforms emerged — such as Khan Academy, Peer-to-Peer University (P2PU), Udemy, and ALISON — which are viewed as similar to MOOCs and work outside the university system or emphasize individual self-paced lessons.\n\n\n=== cMOOCs and xMOOCs ===\n\nAs MOOCs developed with time, multiple conceptions of the platform seem to have emerged. Mostly two different types can be differentiated: those that emphasize a connectivist philosophy, and those that resemble more traditional courses. To distinguish the two, several early adopters of the platform proposed the terms \"cMOOC\" and \"xMOOC\".cMOOCs are based on principles from connectivist pedagogy indicating that material should be aggregated (rather than pre-selected), remixable, re-purposable, and feeding forward (i.e. evolving materials should be targeted at future learning).  cMOOC instructional design approaches attempt to connect learners to each other to answer questions or collaborate on joint projects. This may include emphasizing collaborative development of the MOOC. Andrew Ravenscroft of the London Metropolitan University claimed that connectivist MOOCs better support collaborative dialogue and knowledge building.xMOOCs have a much more traditional course structure. They are characterized by a specified aim of completing the course obtaining certain knowledge certification of the subject matter. They are presented typically with a clearly specified syllabus of recorded lectures and self-test problems. However, some providers require paid subscriptions for acquiring graded materials and certificates. They employ elements of the original MOOC, but are, in some effect, branded IT platforms that offer content distribution partnerships to institutions.   The instructor is the expert provider of knowledge, and student interactions are usually limited to asking for assistance and advising each other on difficult points.\n\n\n== Emergence of MOOC providers ==\nAccording to The New York Times, 2012 became \"the year of the MOOC\" as several well-financed providers, associated with top universities, emerged, including Coursera, Udacity, and edX.\n\nDuring a presentation at SXSWedu in early 2013, Instructure CEO Josh Coates suggested that MOOCs are in the midst of a hype cycle, with expectations undergoing wild swings. Dennis Yang, President of MOOC provider Udemy, later made the point in an article for the Huffington Post.Many universities scrambled to join in the \"next big thing\", as did more established online education service providers such as Blackboard Inc, in what has been called a \"stampede.\" Dozens of universities in Canada, Mexico, Europe and Asia have announced partnerships with the large American MOOC providers. By early 2013, questions emerged about whether academia was \"MOOC'd out.\" This trend was later confirmed in continuing analysis.The industry has an unusual structure, consisting of linked groups including MOOC providers, the larger non-profit sector, universities, related companies and venture capitalists. The Chronicle of Higher Education lists the major providers as the non-profits Khan Academy and edX, and the for-profits Udacity and Coursera.The larger non-profit organizations include the Bill & Melinda Gates Foundation, the MacArthur Foundation, the National Science Foundation, and the American Council on Education. University pioneers include Stanford, Harvard, MIT, the University of Pennsylvania, Caltech, the University of Texas at Austin, the University of California at Berkeley, and San Jose State University. Related companies investing in MOOCs include Google and educational publisher Pearson PLC. Venture capitalists include Kleiner Perkins Caufield & Byers, New Enterprise Associates and Andreessen Horowitz.In the fall of 2011 Stanford University launched three courses. The first of those courses was Introduction Into AI, launched by Sebastian Thrun and Peter Norvig. Enrollment quickly reached 160,000 students. The announcement was followed within weeks by the launch of two more MOOCs, by Andrew Ng and Jennifer Widom. Following the publicity and high enrollment numbers of these courses, Thrun started a company he named Udacity and Daphne Koller and Andrew Ng launched Coursera.In January 2013, Udacity launched its first MOOCs-for-credit, in collaboration with San Jose State University. In May 2013 the company announced the first entirely MOOC-based master's degree, a collaboration between Udacity, AT&T and the Georgia Institute of Technology, costing $7,000, a fraction of its normal tuition.Concerned about the commercialization of online education, in 2012 MIT created the not-for-profit MITx. The inaugural course, 6.002x, launched in March 2012. Harvard joined the group, renamed edX, that spring, and University of California, Berkeley joined in the summer. The initiative then added the University of Texas System, Wellesley College and Georgetown University.\nIn September 2013, edX announced a partnership with Google to develop MOOC.org, a site for non-xConsortium groups to build and host courses. Google will work on the core platform development with edX partners. In addition, Google and edX will collaborate on research into how students learn and how technology can transform learning and teaching. MOOC.org will adopt Google's infrastructure. The Chinese Tsinghua University MOOC platform XuetangX.com (launched Oct. 2013) uses the Open edX platform.Before 2013 each MOOC tended to develop its own delivery platform. EdX in April 2013 joined with Stanford University, which previously had its own platform called Class2Go, to work on XBlock SDK, a joint open-source platform. It is available to the public under the Affero GPL open source license, which requires that all improvements to the platform be publicly posted and made available under the same license. Stanford Vice Provost John Mitchell said that the goal was to provide the \"Linux of online learning.\" This is unlike companies such as Coursera that have developed their own platform.By November 2013, EdX offered 94 courses from 29 institutions around the world. During its first 13 months of operation (ending March 2013), Coursera offered about 325 courses, with 30% in the sciences, 28% in arts and humanities, 23% in information technology, 13% in business and 6% in mathematics. Udacity offered 26 courses. The number of courses offered has since increased dramatically: As of January 2016, Edx offers 820 courses, Coursera offers 1580 courses and Udacity offers more than 120 courses. According to FutureLearn, the British Council's Understanding IELTS: Techniques for English Language Tests has an enrollment of over 440,000 students.\n\n\n=== Notable providers ===\n\n\n=== Emergence of innovative courses ===\nEarly cMOOCs such as CCK08 and ds106 used innovative pedagogy, with distributed learning materials rather than a video-lecture format, and a focus on education and learning, and digital storytelling respectivelyFollowing the 2011 launch of three Stanford xMOOCs, including Introduction Into AI, launched by Sebastian Thrun and Peter Norvig a number of other innovative courses have emerged. As of May 2014, more than 900 MOOCs are offered by US universities and colleges. As of February 2013 dozens of universities had affiliated with MOOCs, including many international institutions. In addition, some organisations operate their own MOOCs – including Google's Power Search.\nA range of courses have emerged; \"There was a real question of whether this would work for humanities and social science\", said Ng. However, psychology and philosophy courses are among Coursera's most popular. Student feedback and completion rates suggest that they are as successful as math and science courses  even though the corresponding completion rates are lower.In January 2012, University of Helsinki launched a Finnish MOOC in programming. The MOOC is used as a way to offer high-schools the opportunity to provide programming courses for their students, even if no local premises or faculty that can organize such courses exist. The course has been offered recurringly, and the top-performing students are admitted to a BSc and MSc program in Computer Science at the University of Helsinki. At a meeting on E-Learning and MOOCs, Jaakko Kurhila, Head of studies for University of Helsinki, Department of Computer Science, claimed that to date, there has been over 8000 participants in their MOOCs altogether.On 18 June 2012, Ali Lemus from Galileo University launched the first Latin American MOOC titled \"Desarrollando Aplicaciones para iPhone y iPad\" This MOOC is a Spanish remix of Stanford University's popular \"CS 193P iPhone Application Development\" and had 5,380 students enrolled. The technology used to host the MOOC was the Galileo Educational System platform (GES) which is based on the .LRN project.\"Gender Through Comic Books\" was a course taught by Ball State University's Christina Blanch on Instructure's Canvas Network, a MOOC platform launched in November 2012. The course used examples from comic books to teach academic concepts about gender and perceptions.In November 2012, the University of Miami launched its first high school MOOC as part of Global Academy, its online high school. The course became available for high school students preparing for the SAT Subject Test in biology.During the Spring 2013 semester, Cathy Davidson and Dan Ariely taught the \"Surprise Endings: Social Science and Literature\" a SPOC course taught in-person at Duke University and also as a MOOC, with students from Duke running the online discussions.In the UK of summer 2013, Physiopedia ran their first MOOC regarding Professional Ethics in collaboration with University of the Western Cape in South Africa. This was followed by a second course in 2014, Physiotherapy Management of Spinal Cord Injuries, which was accredited by the World Confederation of Physical Therapy and attracted approximately 4000 participants with a 40% completion rate. Physiopedia is the first provider of physiotherapy/physical therapy MOOCs, accessible to participants worldwide.In March 2013, Coursolve piloted a crowdsourced business strategy course for 100 organizations with the University of Virginia. A data science MOOC began in May 2013.In May 2013 Coursera announced free e-books for some courses in partnership with Chegg, an online textbook-rental company. Students would use Chegg's e-reader, which limits copying and printing and could use the book only while enrolled in the class.In June 2013, the University of North Carolina at Chapel Hill launched Skynet University, which offers MOOCs on introductory astronomy. Participants gain access to the university's global network of robotic telescopes, including those in the Chilean Andes and Australia.\nIn July 2013 the University of Tasmania launched Understanding Dementia. The course had a completion rate of (39%), the course was recognized in the journal Nature.Startup Veduca launched the first MOOCs in Brazil, in partnership with the University of São Paulo in June 2013. The first two courses were Basic Physics, taught by Vanderlei Salvador Bagnato, and Probability and Statistics, taught by Melvin Cymbalista and André Leme Fleury. In the first two weeks following the launch at Polytechnic School of the University of São Paulo, more than 10,000 students enrolled.Startup Wedubox (Finalist at MassChallenge 2013) launched the first MOOC in finance and third MOOC in Latam, the MOOC was created by Jorge Borrero (MBA Universidad de la Sabana) with the title \"WACC and the cost of capital\" it reached 2.500 students in Dec 2013 only 2 months after the launch.In the fall 2014 Georgia Institute of Technology launched the first MOOD (massive online open degree) (Master's degree) in computer science for $7000 by partnering with Udacity and AT&T.In September 2014, the high street retailer, Marks & Spencer partnered up with University of Leeds to construct an MOOC business course  \"which will use case studies from the Company Archive alongside research from the University to show how innovation and people are key to business success. The course will be offered by the UK based MOOC platform, FutureLearn.On 16 March 2015, the University of Cape Town launched its first MOOC, Medicine and the Arts on the UK-led platform, Futurelearn.In July 2015, OpenClassrooms, jointly with IESA Multimedia, launches first MOOC-based Bachelor degree in multimedia project management, recognized by French state.In January 2018, Brown University opened its first \"game-ified\" course on Edx. Titled Fantastic Places, Unhuman Humans: Exploring Humanity Through Literature by Professor James Egan. It featured a storyline and plot to help Leila, a lost humanoid wandering different worlds, in which a learner had to play mini games to advance through the course.The Pacific Open Learning Health Net, set up by the WHO in 2003, developed an online learning platform in 2004-5 for continuing development of health professionals.  Courses were originally delivered by Moodle, but were looking more like other MOOCs by 2012.\n\n\n== Student experience and pedagogy ==\n\n\n=== Students served ===\nBy June 2012 more than 1.5 million people had registered for classes through Coursera, Udacity or edX. As of 2013, the range of students registered appears to be broad, diverse and non-traditional, but concentrated among English-speakers in rich countries. By March 2013, Coursera alone had registered about 2.8 million learners. By October 2013, Coursera enrollment continued to surge, surpassing 5 million, while edX had independently reached 1.3 million.\nA course billed as \"Asia's first MOOC\" given by the Hong Kong University of Science and Technology through Coursera starting in April 2013 registered 17,000 students. About 60% were from \"rich countries\" with many of the rest from middle-income countries in Asia, South Africa, Brazil or Mexico. Fewer students enrolled from areas with more limited access to the internet, and students from the People's Republic of China may have been discouraged by Chinese government policies.Koller stated in May 2013 that a majority of the people taking Coursera courses had already earned college degrees.According to a Stanford University study of a more general group of students \"active learners\" – anybody who participated beyond just registering – found that 64% of high school active learners were male and 88% were male for undergraduate- and graduate-level courses.A study from Stanford University's Learning Analytics group identified four types of students: auditors, who watched video throughout the course, but took few quizzes or exams; completers, who viewed most lectures and took part in most assessments; disengaged learners, who quickly dropped the course; and sampling learners, who might only occasionally watch lectures. They identified the following percentages in each group:\nJonathan Haber focused on questions of what students are learning and student demographics. About half the students taking US courses are from other countries and do not speak English as their first language. He found some courses to be meaningful, especially about reading comprehension. Video lectures followed by multiple choice questions can be challenging since they are often the \"right questions.\" Smaller discussion boards paradoxically offer the best conversations. Larger discussions can be \"really, really thoughtful and really, really misguided\", with long discussions becoming rehashes or \"the same old stale left/right debate.\"MIT and Stanford University offered initial MOOCs in Computer Science and Electrical Engineering. Since engineering courses need prerequisites so at the outset upper-level engineering courses were nearly absent from the MOOC list. Now several universities are presenting undergraduate and advanced-level engineering courses.\n\n\n=== Educator experience ===\nIn 2013, the Chronicle of Higher Education surveyed 103 professors who had taught MOOCs. \"Typically a professor spent over 100 hours on his MOOC before it even started, by recording online lecture videos and doing other preparation\", though some instructors' pre-class preparation was \"a few dozen hours\". The professors then spent 8–10 hours per week on the course, including participation in discussion forums.The medians were: 33,000 students enrollees; 2,600 passing; and 1 teaching assistant helping with the class. 74% of the classes used automated grading, and 34% used peer grading. 97% of the instructors used original videos, 75% used open educational resources and 27% used other resources. 9% of the classes required a physical textbook and 5% required an e-book.Unlike traditional courses, MOOCs require additional skills, provided by videographers, instructional designers, IT specialists and platform specialists. Georgia Tech professor Karen Head reports that 19 people work on their MOOCs and that more are needed. The platforms have availability requirements similar to media/content sharing websites, due to the large number of enrollees. MOOCs typically use cloud computing and are often created with authoring systems. Authoring tools for the creation of MOOCs are specialized packages of educational software like Elicitus, IMC Content Studio and Lectora that are easy-to-use and support e-learning standards like SCORM and AICC.\n\n\n=== Completion rates ===\nDespite their potential to support learning and education, MOOCs have a major concern related to attrition rates and course drop out. Even though the number of learners who enroll in the courses tends to be in the thousands range, only a very small portion of the enrolled learners complete the course. According to the visualizations and analysis conducted by Katy Jordan (2015), the investigated MOOCs have a typical enrollment of 25,000, even though enrollment has reached a value up to ~230,000. Jordan reports that the average completion rate for such MOOCs is approximately 15%. Early data from Coursera suggest a completion rate of 7%–9%. Coffrin et al. (2012) report the completion rates are even lower (between 3 and 5%), while they say there is a consistent and noticeable decline in the number of students who participate in the course every week. Others  have also shown attrition rates similar to Coffrin. One example is the course Bioelectricity, in the Fall of 2012 at Duke University, where 12,725 students enrolled, but only 7,761 ever watched a video, 3,658 attempted a quiz, 345 attempted the final exam, and 313 passed, earning a certificate.  Students paying $50 for a feature (designed to prevent cheating on exams) have completion rates of about 70%. Yang et al. (2013) suggest that even though there is a large proportion of students who drop out early on due to a variety of reasons, there is a significant proportion of the students who remain in the course and drop out later, thus causing attrition to happen over time.\nBefore analyzing some factors which is related to attrition rates and course drop out, one important thing should be keep in mind is that average completion rate for MOOCs is not a good indicator. Completion rate can not reflect the overall view of every student because different students have diverse purposes. For example, Khe Foon Hew (2016) indicates that some students take part in the MOOCs just for interest or finding extrinsic value of course. They drop the course if the course can not satisfy their purpose. However, completion rate is objective enough to reflect engagement of students.\nMuch research has investigated why students drop out of MOOC courses or what factors could contribute to them dropping out. For example, Rosé et al. (2014) investigate how three social factors make predictions on student attrition, for students who participated in the course discussion forum. The authors found that students who serve as authorities in the community seem to be more committed to the community and thus less inclined to drop out the course. In addition, students who actively participated in the course since the first week were 35% less likely to drop out of the course, compared with the average population. Lastly, the analysis of the patterns of attrition in a sub community showed that attrition was related to the engagement of the particular students with one another. One interpretation of this finding according to Rosé et al. (2014) is that while participating in MOOCs, students create virtual cohorts who progress and engage with the material in similar ways. Thus, if students start dropping out, then that might cause other students to drop out as they might perceive the environment as less supportive or engaging without their peers.\nOther studies focus on exploring how motivation and self-regulated learning could be related to MOOC dropout and attrition. Carson (2002) investigated characteristics of self-directed learning in students of grades 8–12 who took online courses through a statewide online program. Two of the hypothesis that the study explored were whether there exist underlying distinct classes (categories) of self-regulated learners and if the membership in these classes was associated with measures such significantly different online course completion, online final grade, or GPA. The results show that there exist different latent classes of self-regulated learning within the population of online students, designated as high, moderate, and low self-directed learning. In addition, the results support the hypothesis that there is an association between the self-directed learning class the student belongs to with the significantly different course completion rate or course achievement (course achievement was measured by the completion of the online courses, the final online course grade and the cumulative GPA). In other words, course completion and self-directed learning in students were found to be significantly related.\nOne online survey published a \"top ten\" list of reasons for dropping out of a MOOC. The list involved reasons such as the course required too much time, or was too difficult or too basic. Reasons related to poor course design included \"lecture fatigue\" from courses that were just lecture videos, lack of a proper introduction to course technology and format, clunky technology and abuse on discussion boards. Hidden costs were cited, including required readings from expensive textbooks written by the instructor that also significantly limited students' access to learning material. Other non-completers were \"just shopping around\" when they registered, or were participating for knowledge rather than a credential. Other reasons for the poor completion rates include the workload, length and difficulty of a course. In addition, some participants participate peripherally (\"lurk\"). For example, one of the first MOOCs in 2008 had 2200 registered members, of whom 150 actively interacted at various times.Besides those factors cause the low completion rate in MOOCs, the inequality on receiving knowledge affected by different characters of individual also has huge influence on the consequence of completion rate. Actually, MOOC is not as fair as we expected. Russian researchers Semenova, T.V. and Rudakova, L.M (2016), indicate that MOOC is designed to decrease the unequal access to getting knowledge, but that doesn't mean every individual can enjoy the same equality in course completion rate. From their research, there are three main factors cause the inequality, which are degree of education, experience of MOOCs and gender. The survey shows that 18% high-education students complete the course while only 3% low-education students complete. To be more visualized, 84–88% students who have completed the course are high-educational. What's more, among students who have completed the course, 65–80% students have at least one experience of using online learning platform comparing to 6–31% students who have no experience . Gender also influence the completion rate, in general, 6%–7% more men than women complete the course because women are supposed to do household in many countries, which distract women's attention in learning.The effectiveness of MOOCs is an open question as completion rates are substantially less than traditional online education courses. Alraimi et al. (2015) explained in their research model a substantial percentage of the variance for the intention to continue using MOOCs, which is significantly influenced by perceived reputation, perceived openness, perceived usefulness, and perceived user satisfaction. Perceived reputation and perceived openness were the strongest predictors and have not previously been examined in the context of MOOCs\nHowever research indicates that completion rates is not the right metric to measure success of MOOCs. Alternate metrics are proposed to measure effectiveness of MOOCs and online learning.\n\n\n=== Instructional design ===\nMany MOOCs use video lectures, employing the old form of teaching (lecturing) using a new technology. Thrun testified before the President’s Council of Advisors on Science and Technology (PCAST) that MOOC \"courses are 'designed to be challenges,' not lectures, and the amount of data generated from these assessments can be evaluated 'massively using machine learning' at work behind the scenes. This approach, he said, dispels 'the medieval set of myths' guiding teacher efficacy and student outcomes, and replaces it with evidence-based, 'modern, data-driven' educational methodologies that may be the instruments responsible for a 'fundamental transformation of education' itself\".Some view the videos and other material produced by the MOOC as the next form of the textbook. \"MOOC is the new textbook\", according to David Finegold of Rutgers University. A study of edX student habits found that certificate-earning students generally stop watching videos longer than 6 to 9 minutes. They viewed the first 4.4 minutes (median) of 12- to 15-minute videos. Some traditional schools blend online and offline learning, sometimes called flipped classrooms. Students watch lectures online at home and work on projects and interact with faculty while in class. Such hybrids can even improve student performance in traditional in-person classes. One fall 2012 test by San Jose State and edX found that incorporating content from an online course into a for-credit campus-based course increased pass rates to 91% from as low as 55% without the online component. \"We do not recommend selecting an online-only experience over a blended learning experience\", says Coursera's Andrew Ng.Because of massive enrollments, MOOCs require instructional design that facilitates large-scale feedback and interaction. The two basic approaches are:\n\nPeer-review and group collaboration\nAutomated feedback through objective, online assessments, e.g. quizzes and exams Machine grading of written assignments is also underway.So-called connectivist MOOCs rely on the former approach; broadcast MOOCs rely more on the latter. This marks a key distinction between cMOOCs  where the 'C' stands for 'connectivist', and xMOOCs where the x stands for extended (as in TEDx, edX) and represents that the MOOC is designed to be in addition to something else (university courses for example).Assessment can be the most difficult activity to conduct online, and online assessments can be quite different from the bricks-and-mortar version. Special attention has been devoted to proctoring and cheating.Peer review is often based upon sample answers or rubrics, which guide the grader on how many points to award different answers. These rubrics cannot be as complex for peer grading as for teaching assistants. Students are expected to learn via grading others and become more engaged with the course. Exams may be proctored at regional testing centers. Other methods, including \"eavesdropping technologies worthy of the C.I.A.\" allow testing at home or office, by using webcams, or monitoring mouse clicks and typing styles. Special techniques such as adaptive testing may be used, where the test tailors itself given the student's previous answers, giving harder or easier questions accordingly.\n\"The most important thing that helps students succeed in an online course is interpersonal interaction and support\", says Shanna Smith Jaggars, assistant director of Columbia University's Community College Research Center. Her research compared online-only and face-to-face learning in studies of community-college students and faculty in Virginia and Washington state. Among her findings: In Virginia, 32% of students failed or withdrew from for-credit online courses, compared with 19% for equivalent in-person courses.Assigning mentors to students is another interaction-enhancing technique. In 2013 Harvard offered a popular class, The Ancient Greek Hero, instructed by Gregory Nagy and taken by thousands of Harvard students over prior decades. It appealed to alumni to volunteer as online mentors and discussion group managers. About 10 former teaching fellows also volunteered. The task of the volunteers, which required 3–5 hours per week, was to focus online class discussion.  The edX course registered 27,000 students.Research by Kop and Fournier highlighted as major challenges the lack of social presence and the high level of autonomy required. Techniques for maintaining connection with students include adding audio comments on assignments instead of writing them, participating with students in the discussion forums, asking brief questions in the middle of the lecture, updating weekly videos about the course and sending congratulatory emails on prior accomplishments to students who are slightly behind. Grading by peer review has had mixed results. In one example, three fellow students grade one assignment for each assignment that they submit. The grading key or rubric tends to focus the grading, but discourages more creative writing.A. J. Jacobs in an op-ed in the New York Times graded his experience in 11 MOOC classes overall as a \"B\". He rated his professors as '\"B+\", despite \"a couple of clunkers\", even comparing them to pop stars and \"A-list celebrity professors.\" Nevertheless, he rated teacher-to-student interaction as a \"D\" since he had almost no contact with the professors. The highest rated (\"A\") aspect of Jacobs' experience was the ability to watch videos at any time. Student-to-student interaction and assignments both received \"B-\". Study groups that didn't meet, trolls on message boards and the relative slowness of online vs. personal conversations lowered that rating. Assignments included multiple choice quizzes and exams as well as essays and projects. He found the multiple choice tests stressful and peer graded essays painful. He completed only 2 of the 11 classes.\n\n\n== Information architecture ==\nWhen searching for the desired course the courses are usually organized by \"most popular\" or a \"topical scheme\". Courses planned for synchronous learning are structured as an exact organizational scheme called a chronological scheme,  Courses planned for asynchronous learning are also presented as a chronological scheme, but the order the information is learned as a hybrid scheme. In this way it can be harder to understand the course content and complete, because they are not based on an existing mental model.\n\n\n== Industry ==\nMOOCs are widely seen as a major part of a larger disruptive innovation taking place in higher education. In particular, the many services offered under traditional university business models are predicted to become unbundled and sold to students individually or in newly formed bundles. These services include research, curriculum design, content generation (such as textbooks), teaching, assessment and certification (such as granting degrees) and student placement. MOOCs threaten existing business models by potentially selling teaching, assessment, or placement separately from the current package of services.President Barack Obama has cited recent developments, including the online learning innovations at Carnegie Mellon University, Arizona State University and Georgia Institute of Technology, as having potential to reduce the rising costs of higher education.James Mazoue, Director of Online Programs at Wayne State University describes one possible innovation:\n\nThe next disruptor will likely mark a tipping point: an entirely free online curriculum leading to a degree from an accredited institution. With this new business model, students might still have to pay to certify their credentials, but not for the process leading to their acquisition. If free access to a degree-granting curriculum were to occur, the business model of higher education would dramatically and irreversibly change.\nBut how universities will benefit by \"giving our product away free online\" is unclear.\nNo one's got the model that's going to work yet. I expect all the current ventures to fail, because the expectations are too high. People think something will catch on like wildfire. But more likely, it's maybe a decade later that somebody figures out how to do it and make money.\n\nPrinciples of openness inform the creation, structure and operation of MOOCs. The extent to which practices of Open Design in educational technology are applied vary.\n\n\n=== Fee opportunities ===\nIn the freemium business model the basic product – the course content – is given away free. \"Charging for content would be a tragedy\", said Andrew Ng. But \"premium\" services such as certification or placement would be charged a fee – however financial aids are given in some cases.Course developers could charge licensing fees for educational institutions that use its materials. Introductory or \"gateway\" courses and some remedial courses may earn the most fees. Free introductory courses may attract new students to follow-on fee-charging classes. Blended courses supplement MOOC material with face-to-face instruction. Providers can charge employers for recruiting its students. Students may be able to pay to take a proctored exam to earn transfer credit at a degree-granting university, or for certificates of completion. Udemy allows teachers to sell online courses, with the course creators keeping 70–85% of the proceeds and intellectual property rights.Coursera found that students who paid $30 to $90 were substantially more likely to finish the course. The fee was ostensibly for the company's identity-verification program, which confirms that they took and passed a course.\nIn February 2013 the American Council on Education (ACE) recommended that its members provide transfer credit from a few MOOC courses, though even the universities who deliver the courses had said that they would not. The University of Wisconsin offered multiple, competency-based bachelor's and master's degrees starting Fall 2013, the first public university to do so on a system-wide basis. The university encouraged students to take online-courses such as MOOCs and complete assessment tests at the university to receive credit. As of 2013 few students had applied for college credit for MOOC classes. Colorado State University-Global Campus received no applications in the year after they offered the option.Academic Partnerships is a company that helps public universities move their courses online. According to its chairman, Randy Best, \"We started it, frankly, as a campaign to grow enrollment. But 72 to 84 percent of those who did the first course came back and paid to take the second course.\"While Coursera takes a larger cut of any revenue generated – but requires no minimum payment – the not-for-profit edX has a minimum required payment from course providers, but takes a smaller cut of any revenues, tied to the amount of support required for each course.\n\n\n== Benefits ==\n\n\n=== Improving access to higher education ===\nMOOCs are regarded by many as an important tool to widen access to higher education (HE) for millions of people, including those in the developing world, and ultimately enhance their quality of life. MOOCs may be regarded as contributing to the democratisation of HE, not only locally or regionally but globally as well. MOOCs can help democratise content and make knowledge reachable for everyone. Students are able to access complete courses offered by universities all over the world, something previously unattainable. With the availability of affordable technologies, MOOCs increase access to an extraordinary number of courses offered by world-renowned institutions and teachers.\n\n\n=== Providing an affordable alternative to formal education ===\nThe costs of tertiary education continue to increase because institutions tend to bundle too many services. With MOOCs, some of these services can be transferred to other suitable players in the public or private sector. MOOCs are for large numbers of participants, can be accessed by anyone anywhere as long as they have an Internet connection, are open to everyone without entry qualifications and offer a full/complete course experience online for free.\n\n\n=== Sustainable Development Goals ===\n\nMOOCs can be seen as a form of open education offered for free through online platforms. The (initial) philosophy of MOOCs is to open up quality Higher Education to a wider audience. As such, MOOCs are an important tool to achieve Goal 4 of the 2030 Agenda for Sustainable Development.\n\n\n=== Offers a flexible learning schedule ===\nCertain lectures, videos, and tests through MOOCs can be accessed at any time compared to scheduled class times. By allowing learners to complete their coursework in their own time, this provides flexibility to learners based on their own personal schedules.\n\n\n=== Online collaboration ===\nThe learning environments of MOOCs make it easier for learners across the globe to work together on common goals. Instead of having to physically meet one another, online collaboration creates partnerships among learners. While time zones may have an effect on the hours that learners communicate, projects, assignments, and more can be completed to incorporate the skills and resources that different learners offer no matter where they are located.\n\n\n== Challenges and criticisms ==\nThe MOOC Guide suggests six possible challenges for cMOOCs:\n\nRelying on user-generated content can create a chaotic learning environment\nDigital literacy is necessary to make use of the online materials\nThe time and effort required from participants may exceed what students are willing to commit to a free online course\nOnce the course is released, content will be reshaped and reinterpreted by the massive student body, making the course trajectory difficult for instructors to control\nParticipants must self-regulate and set their own goals\nLanguage and translation barriersThese general challenges in effective MOOC development are accompanied by criticism by journalists and academics.\nRobert Zemsky (2014) argues that they have passed their peak: \"They came; they conquered very little; and now they face substantially diminished prospects.\" Others have pointed to a backlash arising from the tiny completion rates.Some dispute that the \"territorial\" dimensions of MOOCs have received insufficient discussion or data-backed analysis, namely: 1. the true geographical diversity of enrolls in/completes courses; 2. the implications of courses scaling across country borders, and potential difficulties with relevance and knowledge transfer; and 3. the need for territory-specific study of locally relevant issues and needs.\nOther features associated with early MOOCs, such as open licensing of content, open structure and learning goals, and community-centeredness, may not be present in all MOOC projects.Effects on the structure of higher education were lamented, for example, by Moshe Y. Vardi, who finds an \"absence of serious pedagogy in MOOCs\", and indeed in all of higher education. He criticized the format of \"short, unsophisticated video chunks, interleaved with online quizzes, and accompanied by social networking.\" An underlying reason is simple cost-cutting pressures, which could hamstring the higher education industry.The changes predicted from MOOCs generated objections in some quarters. The San Jose State University philosophy faculty wrote in an open letter to Harvard University professor and MOOC teacher Michael Sandel:\n\nShould one-size-fits-all vendor-designed blended courses become the norm, we fear two classes of universities will be created: one, well-funded colleges and universities in which privileged students get their own real professor; the other, financially stressed private and public universities in which students watch a bunch of video-taped lectures.\nCary Nelson, former president of the American Association of University Professors claimed that MOOCs are not a reliable means of supplying credentials, stating that \"It’s fine to put lectures online, but this plan only degrades degree programs if it plans to substitute for them.\" Sandra Schroeder, chair of the Higher Education Program and Policy Council for the American Federation of Teachers expressed concern that \"These students are not likely to succeed without the structure of a strong and sequenced academic program.\"With a 60% majority, the Amherst College faculty rejected the opportunity to work with edX based on a perceived incompatibility with their seminar-style classes and personalized feedback. Some were concerned about issues such as the \"information dispensing\" teaching model of lectures followed by exams, the use of multiple-choice exams and peer-grading. The Duke University faculty took a similar stance in the spring of 2013. The effect of MOOCs on second- and third-tier institutions and of creating a professorial \"star system\" were among other concerns.At least one alternative to MOOCs has advocates: Distributed open collaborative courses (DOCC) challenge the roles of the instructor, hierarchy, money and massiveness. DOCC recognizes that the pursuit of knowledge may be achieved better by not using a centralized singular syllabus, that expertise is distributed throughout all the participants and does not just reside with one or two individuals.Another alternative to MOOCs is the Self-Paced Online Course (SPOC) which provides a high degree of flexibility. Students can decide on their own pace and with which session they would like to begin their studies. According to a report by Class Central founder Dhawal Shah, more than 800 self-paced courses have been available in 2015.Although the purpose of MOOCs is ultimately to educate more people, recent criticisms include accessibility and a Westernized curriculum that lead to a failure to reach the same audiences marginalised by traditional methods.MOOCs have been criticized for a perceived lack of academic rigor as well as the monetization strategies adopted by providers. In MOOCs: A University Qualification in 24 Hours? Michael Shea writes \"By offering courses that are near-impossible to fail and charging up front fees for worthless certificates, Coursera is simply running a high-tech version of the kind of scams that have been run by correspondence colleges for decades.\"\n\n\n=== The experience of English Language Learners (ELLs) in MOOCs ===\nLanguage of instruction is one of the major barriers that ELLs face in MOOCs. In recent estimates, almost 75% of MOOC courses are presented in the English language, however, native English speakers are a minority among the world's population. This issue is mediated by the increasing popularity of English as a global language, and therefore has more second language speakers than any other language in the world. This barrier has encouraged content developers and other MOOC stakeholders to develop content in other popular languages to increase MOOC access. However, research studies show that some ELLs prefer to take MOOCs in English, despite the language challenges, as it promotes their goals of Economic, Social, and Geographic mobility. This emphasizes the need to not only provide MOOC content in other languages, but also to develop English language interventions for ELLs who participate in English MOOCs.\nAreas that ELLs particularly struggle with in English MOOCs include MOOC content without corresponding visual supporting materials (e.g., an instructor narrating instruction without text support in the background), or their hesitation to participate in MOOC discussion forums. Active participation in MOOC discussion forums has been found to improve students grades, their engagement, and leads to lower dropout rates, however, ELLs are more likely to be spectators than active contributors in discussion forums. \nResearching studies show a “complex mix of affective, socio-cultural, and educational factors” that are inhibitors to their active participation in discussion forums. As expected, English as the language of communication poses both linguistic and cultural challenges for ELLs, and they may not be confident in their English language communication abilities. Discussion forums may also be an uncomfortable means of communication especially for ELLs from Confucian cultures, where disagreement and arguing one’s points are often viewed as confrontational, and harmony is promoted. Therefore, while ELLs may be perceived as being uninterested in participating, research studies show that they do not show the same hesitation in face to face discourse. Finally, ELLs may come from high power distance cultures, where teachers are regarded as authority figures, and the culture of back and forth conversations between teachers and students are not a cultural norm. As a result, discussion forums with active participation from the instructors may cause discomfort and prevent participation for students from such cultures.\n\n\n== See also ==\nLanguage MOOC\nOutcome-based education\nOpenCourseWare\nSaylor Foundation\nSmall private online course\nQualifications frameworks for online learning\nOpen educational resources in Canada\n\n\n== References ==\n\n\n== Sources ==\n This article incorporates text from a free content work.  Licensed under CC-BY-SA IGO 3.0 License statement: Making Sense of MOOCs: A Guide for Policy-Makers in Developing Countries, 17–18, 21–22, 24, Patru, Mariana; Balaji, Venkataraman, UNESCO. UNESCO. To learn how to add open license text to Wikipedia articles, please see this how-to page. For information on reusing text from Wikipedia, please see the terms of use.\n\n\n== Further reading ==\nWalsh, Taylor (2011). Unlocking the Gates: How and Why Leading Universities Are Opening Up Access to Their Courses. Princeton University Press. ISBN 978-0-691-14874-8."}