{"text": "Online learning involves courses offered by postsecondary institutions that are 100% virtual, excluding massively open online courses (MOOCs). Online learning, or virtual classes offered over the internet, is contrasted with traditional courses taken in a brick-and-mortar school building. It is the newest development in distance education that began in the mid-1990s with the spread of the internet. Learner experience is typically asynchronous, but may also incorporate synchronous elements. The vast majority of institutions utilize a Learning Management System for the administration of online courses. As theories of distance education evolve, digital technologies to support learning and pedagogy continue to transform as well.\n\n\n== History ==\nThe first correspondence courses began in the 1800s using parcel post to reach students who couldn't be on a university campus. By the early 1900s, communication technologies improved and distance education took to the radio waves. In 1919 professors at the University of Wisconsin began an amateur radio station, becoming the first licensed radio station dedicated to educational broadcasting. Soon after, access to higher education was again expanded through the invention of the television; giving birth to what was known as the telecourse. The University of Iowa began to experiment with television for educational purposes in the 1930s. It was not until the 1950s, when the FCC began to reserve television frequencies for educational purposes, that telecourses caught the attention of the public. The value of television for education was furthered by the establishment of the Corporation for Public Broadcasting (CPB) in 1967. The CPB mission was \"to encourage the growth and development of public radio and television broadcasting, including the use of such media for instructional, educational, and cultural purposes\" (as cited in, p. 27).\nOnline learning emerged in 1982 when the Western Behavioral Sciences Institute in La Jolla, California opened its School of Management and Strategic Studies. The School employed computer conferencing to deliver a distance education program to business executives. In 1989 the University of Phoenix began offering education programs through the internet. In 1993 with the debut of the first Internet web browser, created by the University of Illinois, online learning began to flourish. In 1998, the first fully online programs were founded: New York University Online, Western Governor's University, the California Virtual University and Trident University International.In 2000 only 8% of students were enrolled in an online course, but by 2008 enrollment had increased to 20%. The expansion of online education has not slowed either; by the fall of 2013 nearly 30% of all postsecondary students were enrolled in some kind of distance education course. Although the data on online course and program completion are complex, researchers have noted high rates of attrition (ranging from 20%-50%) among students enrolled in online courses compared to those who take traditional face-to-face courses.\n\n\n== Types of learner experiences (methods of delivery) ==\nGiven the improvements in delivery methods, online learning environments provide a greater degree of flexibility than traditional classroom settings. Online platforms can also offer more diverse representations of student populations as learners prepare for working in the twenty-first century. The diversity comes from interacting with students outside of one's geographical location, possibly offering a variety of perspectives on course content. Courses offered completely online are primarily delivered in an asynchronous learning or synchronous learning format.\nAsynchronous learning environments are described as online spaces where work is supported through the use of digital platforms in such a way that participants are not required to be online at the same time. Threaded discussions, e-mail, and telephone calls are options of asynchronous delivery. This gives meaning to the anytime-anywhere appeal of online learning. A benefit of asynchronous learning is the learner having more time to generate content-related responses to the instructor and peer postings; they have time to find facts to back their written statements. The additional time provides an opportunity to increase the learner's ability to process information. The spelling and grammar within postings of an asynchronous environment are like that found in formal academic writing. On the other hand, one of the main limitations of this delivery method is the greater potential for a learner to feel removed from the learning environment. Asynchronous learning is viewed as less social in nature and can cause the learner to feel isolated. Providing the student a feeling of belonging to the university or institution will assist with feelings of isolation; this can be done through ensuring links to university support systems and the library are accessible and operable.Synchronous learning environments most closely resemble face-to-face learning. Synchronous learning takes place through digital platforms where the learners are utilizing the online media at the same time. When compared to asynchronous learning, synchronous online environments provide a greater sense of feeling supported, as the exchange of text or voice is immediate and feels more like a conversation. If platforms such as web conferencing or video chat are used, learners are able to hear the tone of voice used by others which may allow for greater understanding of content. As in a traditional classroom environment, online learners may feel a need to keep the conversation going, so there is a potential for focusing on the quantity of responses over the quality of content within the response. However the synchronous environment, with real-time responses, can allow for students or instructors to provide clarity to what was said, or alleviate any possible misconceptions.\n\n\n== Learning management systems ==\nMost online learning occurs through a college's or university's learning management system (LMS). A LMS is a software application for maintaining, delivering, and tracking educational resources. According to the Educause Center for Analysis and Research (ECAR) use of a LMS is nearly ubiquitous as 99% of colleges and universities report having one in place. Among faculty, 87% report using a LMS and find them useful for \"enhancing  teaching (74%) and student learning (71%)\" (p. 10). Similarly, 83% of students use an LMS in their courses, with the majority (56%) using them in most or all courses.\n\nMost institutions utilize LMSs by external vendors (77%), Blackboard currently dominates the LMS environment with an adoption rate of  31.9%, followed by Moodle at 19.1%, and Canvas at 15.3%. However, in the last year Canvas, by Instructure, has gained an increasing amount of the market share (see graphic). Reflecting these changes the ECAR reported that 15% of institutions are in the process of updating and/or replacing their LMS; the main reasons cited were the need to \"upgrade functions (71%), replace legacy systems (44%), and reduce costs (18%)\"  (p. 6).\nECAR's survey of institutions found that generally, both faculty and students are satisfied with the LMS; with three-quarters satisfied with the LMS for posting content (faculty) and accessing content (students).  In contrast, the lowest levels of satisfaction with the LMS reported by faculty were with features that allow for \"meaningful\" interaction between students and their instructor, students and other students, and for study groups or collaborating on projects (p. 12). Similarly, just under half of the students surveyed reported satisfaction of the LMS for \"engaging in meaningful interactions with students\" (p. 12).\nWhile LMSs are largely being used as a repository for course materials (e.g. syllabus, learning content, etc.) and platforms for the assessment of learning, recent developments are making them more customizable through LTI standards. According to a report by the Educause Learning Initiative the Next Generation Digital Learning Environment will be more responsive to students' needs creating a more customizable experience. The functional characteristics of the next generation of digital learning environments include: \"interoperability and integration; personalization; analytics, advising, and learning assessments; collaboration; and, accessibility and universal design\" (p. 4)\n\n\n== Theory ==\nThe well-known educational theorist John Dewey argued that learning occurs in collaboration with knowledgeable others.  Similarly, psychologist Jean Piaget noted that in order for learning to occur, the content must be meaningful to the student. Piaget's constructivist theory of learning highlighted the importance of engaged learning where meaningful discussions were held between peers.  The sociologist Lev Vygotsky also emphasized the importance of social interaction in learning. Traditionally, in formal education this interaction occurs largely between the student and the teacher, but as students and teachers become distanced from each other in the virtual classroom, creative strategies for instruction continue to be developed. While early approaches to online learning were merely an extension of independently-driven correspondence courses, today's approach to online learning focuses on engagement and active learning.\nTheories of distance education are relatively new to the scene. These theories can be placed into four main categories: 1) theories of independent study (e.g. Charles Wedemeyer, Michael Moore); 2) theories of the industrialization of teaching (e.g. Otto Peters); 3) theories of interaction and communication (e.g. Borje Holmberg); and 4) a synthesis of existing theories of communication and diffusion and philosophies of education (e.g. Hilary Perraton). However, the equivalency theory of distance education posits that all students should have learning experiences of equal value and that it is the responsibility of the instructional designer to create learning experiences for the distance learner that will be successful in meeting the course objectives. As online education has become the dominant form of distance education, new theories are emerging that combine elements of constructivism and technology. Siemens' Connectivism \"is the integration of principles explored by chaos, network, and complexity and self-organization theories\".(p. 5) Connectivism places knowledge in \"diversity of opinions\" (p. 5) and that learning is aided through creating and nurturing connections of \"fields, ideas, and concepts\". (p. 5)\n\n\n== Pedagogy ==\nTransformative learning or Transformative pedagogy \"encourages students to critically examine their assumptions, grapple with social issues, and engage in social action\" ( p. 219). Five suggestions for preparing the online environment for transformative pedagogy are: \"(a) create a safe and inviting environment; (b) encourage students to think about their experiences, beliefs, and biases; (c) use teaching strategies that promote student engagement and participation; (d) pose real-world problems that address societal inequalities; and (e) help students implement action-oriented solutions\" (p. 220). There are four fundamental characteristics that may assist with the success of online instruction: (1) the learner should be actively engaged throughout the course; (2) group participation can assist with meeting course objectives; (3) frequent student-student and student-teacher interaction can alleviate the feelings of isolation; and (4) the course content should relate to the real world to enhance meaning for participants.Participation and interaction between participants and instructors involves significant and continuous preparation. Online educators are often members of a larger team consisting of instructional and graphic designers and information technology specialists; being open to becoming a member of the team will assist in a smooth transition to online teaching. Expectations of learners to be self-motivated, able to manage their time effectively, contribute to course discussions and have a willingness to teach others is not unlike what is expected in a traditional classroom. The instructor's role is to encourage learners to evaluate and analyze information, then connect the information to course content which may assist in learner success. With the potential for learners to feel disconnected from peers within the course, the instructor will need to work to create spaces and encounters which promote socialization. A few recommendations are to create a \"student lounge\" as an informal space for socialization not related to coursework. Also, incorporating team projects can help alleviate feelings of isolation. Online instructors should be cognizant of where participants are physically located; when members of the course span two or more time zones, the timing of the course can become problematic. Initial preparation of an online course is often more time consuming than preparation for the classroom. The material must be prepared and posted, in its entirety, prior to the course start. In addition to preparation, faculty experienced in online instruction spend about 30% more time on courses conducted online. The mentoring of novice online educators from those with experience can assist with the transition from classroom to the virtual environment.\n\n\n== Online credentials ==\n\nOnline credentials for learning are digital credentials that are offered in place of traditional paper credentials for a skill or educational achievement. Directly linked to the accelerated development of internet communication technologies, the development of digital badges, electronic passports and massive open online courses (MOOCs) have a very direct bearing on our understanding of learning, recognition and levels as they pose a direct challenge to the status quo. It is useful to distinguish between three forms of online credentials: Test-based credentials, online badges, and online certificates.\n\n\n== Sources ==\n This article incorporates text from a free content work.  Licensed under CC-BY-SA IGO 3.0 License statement: Level-setting and recognition of learning outcomes: The use of level descriptors in the twenty-first century, 129-131, Keevey, James; Chakroun, Borhene, UNESCO. UNESCO. To learn how to add open license text to Wikipedia articles, please see this how-to page. For information on reusing text from Wikipedia, please see the terms of use.\n\n\n== References =="}