{"text": "Social media marketing is the use of social media platforms and websites to promote a product or service. Although the terms e-marketing and digital marketing are still dominant in academia, social media marketing is becoming more popular for both practitioners and researchers. Most social media platforms have built-in data analytics tools, which enable companies to track the progress, success, and engagement of ad campaigns. Companies address a range of stakeholders through social media marketing, including current and potential customers, current and potential employees, journalists, bloggers, and the general public. On a strategic level, social media marketing includes the management of a marketing campaign, governance, setting the scope (e.g. more active or passive use) and the establishment of a firm's desired social media \"culture\" and \"tone.\"\nWhen using social media marketing, firms can allow customers and Internet users to post user-generated content (e.g., online comments, product reviews, etc.), also known as \"earned media,\" rather than use marketer-prepared advertising copy.\n\n\n== Platforms ==\n\n\n=== Social networking websites ===\nSocial networking websites allow individuals, businesses and other organizations to interact with one another and build relationships and communities online. When companies join these social channels, consumers can interact with them directly. That interaction can be more personal to users than traditional methods of outbound marketing and advertising. Social networking sites act as word of mouth or more precisely, e-word of mouth. The Internet's ability to reach billions across the globe has given online word of mouth a powerful voice and far reach. The ability to rapidly change buying patterns and product or service acquisition and activity to a growing number of consumers is defined as an influence network. Social networking sites and blogs allow followers to \"retweet\" or \"repost\" comments made by others about a product being promoted, which occurs quite frequently on some social media sites. By repeating the message, the user's connections are able to see the message, therefore reaching more people. Because the information about the product is being put out there and is getting repeated, more traffic is brought to the product/company.Social networking websites are based on building virtual communities that allow consumers to express their needs, wants and values, online. Social media marketing then connects these consumers and audiences to businesses that share the same needs, wants, and values. Through social networking sites, companies can keep in touch with individual followers. This personal interaction can instill a feeling of loyalty into followers and potential customers. Also, by choosing whom to follow on these sites, products can reach a very narrow target audience. Social networking sites also include much information about what products and services prospective clients might be interested in. Through the use of new semantic analysis technologies, marketers can detect buying signals, such as content shared by people and questions posted online. An understanding of buying signals can help sales people target relevant prospects and marketers run micro-targeted campaigns.\nIn 2014, over 80% of business executives identified social media as an integral part of their business. Business retailers have seen 133% increases in their revenues from social media marketing.\n\n\n=== Mobile phones ===\nMore than three billion people in the world are active on the Internet. Over the years, the Internet has continually gained more and more users, jumping from 738 million in 2000 all the way to 3.2 billion in 2015. Roughly 81% of the current population in the United States has some type of social media profile that they engage with frequently. Mobile phone usage is beneficial for social media marketing because of their web browsing capabilities which allow individuals immediate access to social networking sites. Mobile phones have altered the path-to-purchase process by allowing consumers to easily obtain pricing and product information in real time. They have also allowed companies to constantly remind and update their followers. Many companies are now putting QR (Quick Response) codes along with products for individuals to access the company website or online services with their smart phones. Retailers use QR codes to facilitate consumer interaction with brands by linking the code to brand websites, promotions, product information, and any other mobile-enabled content. In addition, Real-time bidding use in the mobile advertising industry is high and rising due to its value for on-the-go web browsing. In 2012, Nexage, a provider of real time bidding in mobile advertising reported a 37% increase in revenue each month. Adfonic, another mobile advertisement publishing platform, reported an increase of 22 billion ad requests that same year.Mobile devices have become increasingly popular, where 5.7 billion people are using them worldwide . This has played a role in the way consumers interact with media and has many further implications for TV ratings, advertising, mobile commerce, and more. Mobile media consumption such as mobile audio streaming or mobile video are on the rise – In the United States, more than 100 million users are projected to access online video content via mobile device. Mobile video revenue consists of pay-per-view downloads, advertising and subscriptions. As of 2013, worldwide mobile phone Internet user penetration was 73.4%. In 2017, figures suggest that more than 90% of Internet users will access online content through their phones.\n\n\n== Strategies ==\nThere are two basic strategies for engaging the social media as marketing tools:\n\n\n=== Passive approach ===\nSocial media can be a useful source of market information and a way to hear customer perspectives. Blogs, content communities, and forums are platforms where individuals share their reviews and recommendations of brands, products, and services. Businesses are able to tap and analyze the customer voices and feedback generated in social media for marketing purposes; in this sense the social media is a relatively inexpensive source of market intelligence which can be used by marketers and managers to track and respond to consumer-identified problems and detect market opportunities. For example, the Internet erupted with videos and pictures of iPhone 6 \"bend test\" which showed that the coveted phone could be bent by hand pressure. The so-called \"bend gate\" controversy created confusion amongst customers who had waited months for the launch of the latest rendition of the iPhone. However, Apple promptly issued a statement saying that the problem was extremely rare and that the company had taken several steps to make the mobile device's case stronger and robust. Unlike traditional market research methods such as surveys, focus groups, and data mining which are time-consuming and costly, and which take weeks or even months to analyze, marketers can use social media to obtain 'live' or \"real time\" information about consumer behavior and viewpoints on a company's brand or products. This can be useful in the highly dynamic, competitive, fast-paced and global marketplace of the 2010s.\n\n\n=== Active approach ===\nSocial media can be used not only as public relations and direct marketing tools but also as communication channels targeting very specific audiences with social media influencers and social media personalities and as effective customer engagement tools.  Technologies predating social media, such as broadcast TV and newspapers can also provide advertisers with a fairly targeted audience, given that an ad placed during a sports game broadcast or in the sports section of a newspaper is likely to be read by sports fans. However, social media websites can target niche markets even more precisely. Using digital tools such as Google Adsense, advertisers can target their ads to very specific demographics, such as people who are interested in social entrepreneurship, political activism associated with a particular political party, or video gaming. Google Adsense does this by looking for keywords in social media user's online posts and comments. It would be hard for a TV station or paper-based newspaper to provide ads that are this targeted (though not impossible, as can be seen with \"special issue\" sections on niche issues, which newspapers can use to sell targeted ads).\nSocial networks are, in many cases, viewed as a great tool for avoiding costly market research. They are known for providing a short, fast, and direct way to reach an audience through a person who is widely known. For example, an athlete who gets endorsed by a sporting goods company also brings their support base of millions of people who are interested in what they do or how they play and now they want to be a part of this athlete through their endorsements with that particular company. At one point consumers would visit stores to view their products with famous athletes, but now you can view a famous athlete's, such as Cristiano Ronaldo, latest apparel online with the click of a button. He advertises them to you directly through his Twitter, Instagram, and FaceBook accounts.\nFacebook and LinkedIn are leading social media platforms where users can hyper-target their ads. Hypertargeting not only uses public profile information but also information users submit but hide from others. There are several examples of firms initiating some form of online dialog with the public to foster relations with customers. According to Constantinides, Lorenzo and Gómez Borja (2008) \"Business executives like Jonathan Swartz, President and CEO of Sun Microsystems, Steve Jobs CEO of Apple Computers, and McDonalds Vice President Bob Langert post regularly in their CEO blogs, encouraging customers to interact and freely express their feelings, ideas, suggestions, or remarks about their postings, the company or its products\". Using customer influencers (for example popular bloggers) can be a very efficient and cost-effective method to launch new products or services\nAmong the political leaders in office, Prime Minister Narendra Modi has the highest number of followers at 40 million, and President Donald Trump ranks second with 25 million followers. Modi employed social media platforms to circumvent traditional media channels to reach out to the young and urban population of India which is estimated to be 200 million.\n\n\n== Engagement ==\nEngagement with the social web means that customers and stakeholders are active participants rather than passive viewers. An example of these are consumer advocacy groups and groups that criticize companies (e.g., lobby groups or advocacy organizations). Social media use in a business or political context allows all consumers/citizens to express and share an opinion about a company's products, services, business practices, or a government's actions. Each participating customer, non-customer, or citizen who is participating online via social media becomes a part of the marketing department (or a challenge to the marketing effort). Whereas as other customers read their positive or negative comments or reviews. Getting consumers, potential consumers or citizens to be engaged online is fundamental to successful social media marketing. With the advent of social media marketing, it has become increasingly important to gain customer interest in products and services. This can eventually be translated into buying behavior, or voting and donating behavior in a political context. New online marketing concepts of engagement and loyalty have emerged which aim to build customer participation and brand reputation.Engagement in social media for the purpose of a social media strategy is divided into two parts. The first is proactive, regular posting of new online content. This can be seen through digital photos, digital videos, text, and conversations. It is also represented through sharing of content and information from others via weblinks. The second part is reactive conversations with social media users responding to those who reach out to your social media profiles through commenting or messaging. Traditional media such as TV news shows are limited to one-way interaction with customers or 'push and tell' where only specific information is given to the customer with few or limited mechanisms to obtain customer feedback. Traditional media such as physical newspapers, do give readers the option of sending a letter to the editor. Though, this is a relatively slow process, as the editorial board has to review the letter and decide if it is appropriate for publication. On the other hand, social media is participative and open; Participants are able to instantly share their views on brands, products, and services. Traditional media gave control of message to the marketer, whereas social media shifts the balance to the consumer or citizen.\n\n\n== Campaigns ==\n\n\n=== Local businesses ===\nSmall businesses also use social networking sites as a promotional technique. Businesses can follow individuals social networking site uses in the local area and advertise specials and deals. These can be exclusive and in the form of \"get a free drink with a copy of this tweet\". This type of message encourages other locals to follow the business on the sites in order to obtain the promotional deal. In the process, the business is getting seen and promoting itself (brand visibility).\nSmall businesses also use social networking sites to develop their own market research on new products and services.  By encouraging their customers to give feedback on new product ideas, businesses can gain valuable insights on whether a product may be accepted by their target market enough to merit full production, or not. In addition, customers will feel the company has engaged them in the process of co-creation—the process in which the business uses customer feedback to create or modify a product or service the filling a need of the target market.  Such feedback can present in various forms, such as surveys, contests, polls, etc.\nSocial networking sites such as LinkedIn, also provide an opportunity for small businesses to find candidates to fill staff positions.Of course, review sites, such as Yelp, also help small businesses to build their reputation beyond just brand visibility. Positive customer peer reviews help to influence new prospects to purchase goods and services more than company advertising.\n\n\n=== Nike #MakeItCount ===\nIn early 2012, Nike introduced its Make It Count social media campaign. The campaign kickoff began YouTubers Casey Neistat and Max Joseph launching a YouTube video, where they traveled 34,000 miles to visit 16 cities in 13 countries. They promoted the #makeitcount hashtag, which millions of consumers shared via Twitter and Instagram by uploading photos and sending tweets. The #MakeItCount YouTube video went viral and Nike saw an 18% increase in profit in 2012, the year this product was released.\n\n\n== Purposes and tactics ==\nOne of the main purposes of employing social media in marketing is as a communications tool that makes the companies accessible to those interested in their product and makes them visible to those who have no knowledge of their products. These companies use social media to create buzz, and learn from and target customers. It's the only form of marketing that can finger consumers at each and every stage of the consumer decision journey. Marketing through social media has other benefits as well. Of the top 10 factors that correlate with a strong Google organic search, seven are social media dependent. This means that if brands are less or non-active on social media, they tend to show up less on Google searches. While platforms such as Twitter, Facebook, and Google+ have a larger number of monthly users, the visual media sharing based mobile platforms, however, garner a higher interaction rate in comparison and have registered the fastest growth and have changed the ways in which consumers engage with brand content. Instagram has an interaction rate of 1.46% with an average of 130 million users monthly as opposed to Twitter which has a .03% interaction rate with an average of 210 million monthly users.  Unlike traditional media that are often cost-prohibitive to many companies, a social media strategy does not require astronomical budgeting.To this end, companies make use of platforms such as Facebook, Twitter, YouTube, and Instagram  to reach audiences much wider than through the use of traditional print/TV/radio advertisements alone at a fraction of the cost, as most social networking sites can be used at little or no cost (however, some websites charge companies for premium services). This has changed the ways that companies approach to interact with customers, as a substantial percentage of consumer interactions are now being carried out over online platforms with much higher visibility. Customers can now post reviews of products and services, rate customer service, and ask questions or voice concerns directly to companies through social media platforms. According to Measuring Success, over 80% of consumers use the web to research products and services. Thus social media marketing is also used by businesses in order to build relationships of trust with consumers. To this aim, companies may also hire personnel to specifically handle these social media interactions, who usually report under the title of Online community managers. Handling these interactions in a satisfactory manner can result in an increase of consumer trust. To both this aim and to fix the public's perception of a company, 3 steps are taken in order to address consumer concerns, identifying the extent of the social chatter, engaging the influencers to help, and developing a proportional response.\n\n\n=== Twitter ===\nTwitter allows companies to promote their products in short messages known as tweets limited to 140 characters which appear on followers' Home timelines. Tweets can contain text, Hashtag, photo, video, Animated GIF, Emoji, or links to the product's website and other social media profiles, etc. Twitter is also used by companies to provide customer service. Some companies make support available 24/7 and answer promptly, thus improving brand loyalty and appreciation.\n\n\n=== Facebook ===\nFacebook pages are far more detailed than Twitter accounts. They allow a product to provide videos, photos, longer descriptions, and testimonials where followers can comment on the product pages for others to see. Facebook can link back to the product's Twitter page, as well as send out event reminders. As of May 2015, 93% of businesses marketers use Facebook to promote their brand. A study from 2011 attributed 84% of \"engagement\" or clicks and likes that link back to Facebook advertising. By 2014, Facebook had restricted the content published from business and brand pages. Adjustments in Facebook algorithms have reduced the audience for non-paying business pages (that have at least 500,000 \"Likes\") from 16% in 2012 down to 2% in February 2014.\n\n\n=== LinkedIn ===\nLinkedIn, a professional business-related networking site, allows companies to create professional profiles for themselves as well as their business to network and meet others. Through the use of widgets, members can promote their various social networking activities, such as Twitter stream or blog entries of their product pages, onto their LinkedIn profile page.  LinkedIn provides its members the opportunity to generate sales leads and business partners.  Members can use \"Company Pages\" similar to Facebook pages to create an area that will allow business owners to promote their products or services and be able to interact with their customers. Due to spread of spam mail sent to job seeker, leading companies prefer to use LinkedIn for employee's recruitment instead using different a job portal. Additionally, companies have voiced a preference for the amount of information that can be gleaned from a LinkedIn profile, versus a limited email.\n\n\n=== Whatsapp ===\nWhatsApp was founded by Jan Koum and Brian Acton.WhatsApp joined Facebook in 2014, but continues to operate as a separate app with a laser focus on building a messaging service that works fast and reliably anywhere in the world.WhatsApp started as an alternative to SMS. Whatsapp now supports sending and receiving a variety of media including text, photos, videos, documents, and location, as well as voice calls. Whatsapp messages and calls are secured with end-to-end encryption, meaning that no third party including WhatsApp can read or listen to them. Whatsapp has a customer base of 1 billion people in over 180 countries. It is used to send personalised promotional messages to individual customers. It has plenty of advantages over SMS that includes ability to track how Message Broadcast Performs using blue tick option in Whatsapp. It allows sending messages to Do Not Disturb(DND) customers. Whatsapp is also used to send a series of bulk messages to their targeted customers using broadcast option. Companies started using this to a large extent because it is a cost effective promotional option and quick to spread a message. Still, Whatsapp doesn't allow businesses to place ads in their app.\n\n\n=== Yelp ===\nYelp consists of a comprehensive online index of business profiles. Businesses are searchable by location, similar to Yellow Pages.  The website is operational in seven different countries, including the United States and Canada. Business account holders are allowed to create, share, and edit business profiles. They may post information such as the business location, contact information, pictures, and service information. The website further allows individuals to write, post reviews about businesses, and rate them on a five-point scale. Messaging and talk features are further made available for general members of the website, serving to guide thoughts and opinions.\n\n\n=== Instagram ===\nIn May 2014, Instagram had over 200 million users. The user engagement rate of Instagram was 15 times higher than of Facebook and 25 times higher than that of Twitter. According to Scott Galloway, the founder of L2 and a professor of marketing at New York University's Stern School of Business, latest studies estimate that 93% of prestige brands have an active presence on Instagram and include it in their marketing mix. When it comes to brands and businesses, Instagram's goal is to help companies to reach their respective audiences through captivating imagery in a rich, visual environment. Moreover, Instagram provides a platform where user and company can communicate publicly and directly, making itself an ideal platform for companies to connect with their current and potential customers.Many brands are now heavily using this mobile app to boost their marketing strategy. Instagram can be used to gain the necessary momentum needed to capture the attention of the market segment that has an interest in the product offering or services. As Instagram is supported by Apple and android system, it can be easily accessed by smartphone users. Moreover, it can be accessed by the Internet as well. Thus, the marketers see it as a potential platform to expand their brands exposure to the public, especially the younger target group. On top of this, marketers do not only use social media for traditional Internet advertising, but they also encourage users to create attention for a certain brand. This generally creates an opportunity for greater brand exposure. Furthermore, marketers are also using the platform to drive social shopping and inspire people to collect and share pictures of their favorite products. Many big names have already jumped on board: Starbucks, MTV, Nike, Marc Jacobs, and Red Bull are a few examples of multinationals that adopted the mobile photo app early. Fashion blogger Danielle Bernstein, who goes by @weworewhat on Instagram, collaborated with Harper's Bazaar to do a piece on how brands are using Instagram to market their products, and how bloggers make money from it. Bernstein, who currently has one and a half million followers on Instagram, and whose \"outfit of the day\" photos on Snapchat get tens of thousands of screenshots, explained that for a lot of her sponsored posts, she must feature the brand in a certain number of posts, and often cannot wear a competitor's product in the same picture. According to Harper's Bazaar, industry estimates say that brands are spending more than $1 billion per year on consumer-generated advertising. Founder of Instagram Kevin Systrom even went to Paris Fashion week, going to couture shows and meeting with designers to learn more about how style bloggers, editors, and designers are currently dominating much of the content on his application.Instagram has proven itself a powerful platform for marketers to reach their customers and prospects through sharing pictures and brief messages. According to a study by Simply Measured, 71% of the world's largest brands are now using Instagram as a marketing channel. For companies, Instagram can be used as a tool to connect and communicate with current\nand potential customers. The company can present a more personal picture of their brand, and by doing so the company conveys a better and true picture of itself. The idea of Instagram pictures lies on on-the-go, a sense that the event is happening right now, and that adds another layer to the personal and accurate picture of the company. In fact, Thomas Rankin, co-founder and CEO of the program Dash Hudson, stated that when he approves a blogger's Instagram post before it is posted on the behalf of a brand his company represents, his only negative feedback is if it looks too posed. \"It's not an editorial photo,\" he explained, \"We're not trying to be a magazine. We're trying to create a moment.\" Another option Instagram provides the opportunity for companies to reflect a true picture of the brandfrom the perspective of the customers, for instance, using the user-generated contents thought the hashtags encouragement. Other than the filters and hashtags functions, the Instagram's 15-second videos and the recently added ability to send private messages between users have opened new opportunities for brands to connect with customers in a new extent, further promoting effective marketing on Instagram.\n\n\n=== Snapchat ===\nSnapchat is a popular messaging and picture exchanging application that was created in 2011 by three students at Stanford University named Evan Spiegel, Bobby Murphy, and Reggie Brown. The application was first developed to allow users to message back and forth and to also send photographs that are only available from 1–10 seconds until they are no longer available. The app was an instant hit with social media members and today there are up to 158 million people using snapchat every single day. It is also estimated that Snapchat users are opening the application approximately 18 times per day, which means users are on the app for about 25–30 minutes per day.\n\n\n=== YouTube ===\nYouTube is another popular avenue; advertisements are done in a way to suit the target audience. The type of language used in the commercials and the ideas used to promote the product reflect the audience's style and taste. Also, the ads on this platform are usually in sync with the content of the video requested, this is another advantage YouTube brings for advertisers. Certain ads are presented with certain videos since the content is relevant. Promotional opportunities such as sponsoring a video is also possible on YouTube, \"for example, a user who searches for a YouTube video on dog training may be presented with a sponsored video from a dog toy company in results along with other videos.\" YouTube also enable publishers to earn money through its YouTube Partner Program. Companies can pay YouTube for a special \"channel\" which promotes the companies products or services.\n\n\n=== Social bookmarking sites ===\nWebsites such as Delicious, Digg, Slashdot, Diigo, Stumbleupon, and Reddit are popular social bookmarking sites used in social media promotion. Each of these sites is dedicated to the collection, curation, and organization of links to other websites that users deem to be of good quality.  This process is \"crowdsourced\", allowing amateur social media network members to sort and prioritize links by relevance and general category.  Due to the large user bases of these websites, any link from one of them to another, the smaller website may in a flash crowd, a sudden surge of interest in the target website. In addition to user-generated promotion, these sites also offer advertisements within individual user communities and categories.  Because ads can be placed in designated communities with a very specific target audience and demographic, they have far greater potential for traffic generation than ads selected simply through cookie and browser history.  Additionally, some of these websites have also implemented measures to make ads more relevant to users by allowing users to vote on which ones will be shown on pages they frequent.  The ability to redirect large volumes of web traffic and target specific, relevant audiences makes social bookmarking sites a valuable asset for social media marketers.\n\n\n=== Blogs ===\nPlatforms like LinkedIn create an environment for companies and clients to connect online. Companies that recognize the need for information, originality/ and accessibility employ blogs to make their products popular and unique/ and ultimately reach out to consumers who are privy to social media. Studies from 2009 show that consumers view coverage in the media or from bloggers as being more neutral and credible than print advertisements, which are not thought of as free or independent. Blogs allow a product or company to provide longer descriptions of products or services, can include testimonials and can link to and from other social network and blog pages. Blogs can be updated frequently and are promotional techniques for keeping customers, and also for acquiring followers and subscribers who can then be directed to social network pages. Online communities can enable a business to reach the clients of other businesses using the platform. To allow firms to measure their standing in the corporate world, sites enable employees to place evaluations of their companies.\nSome businesses opt out of integrating social media platforms into their traditional marketing regimen. There are also specific corporate standards that apply when interacting online.  To maintain an advantage in a business-consumer relationship, businesses have to be aware of four key assets that consumers maintain: information, involvement, community, and control.\n\n\n=== Tumblr ===\nBlogging website Tumblr first launched ad products on May 29, 2012. Rather than relying on simple banner ads, Tumblr requires advertisers to create a Tumblr blog so the content of those blogs can be featured on the site. In one year, four native ad formats were created on web and mobile, and had more than 100 brands advertising on Tumblr with 500 cumulative sponsored posts.\n\n\n==== Ad formats ====\nSponsored mobile pPost – Advertisements (Advertisers' blog posts) will show up on user's Dashboard when the user is on a mobile device such as smartphones and tablets, allowing them to like, reblog, and share the sponsored post.\nSponsored web post – \"Largest in-stream ad unit on the web\" that catches the users' attention when looking at their Dashboard through their computer or laptop. It also allows the viewers to like, reblog, and share it.\nSponsored radar – Radar picks up exceptional posts from the whole Tumblr community based on their originality and creativity. It is placed on the right side next to the Dashboard, and it typically earns 120 million daily impressions. Sponsored radar allows advertisers to place their posts there to have an opportunity to earn new followers, reblogs, and likes.\nSponsored spotlight – Spotlight is a directory of some of the popular blogs throughout the community and a place where users can find new blogs to follow. Advertisers can choose one category out of fifty categories that they can have their blog listed on there.These posts can be one or more of the following: images, photo sets, animated GIFs, video, audio, and text posts. For the users to differentiate the promoted posts to the regular users' posts, the promoted posts have a dollar symbol on the corner. On May 6, 2014, Tumblr announced customization and theming on mobile apps for brands to advertise.\n\n\n==== Advertising campaigns ====\nDisney/Pixar's Monsters University: Created a Tumblr account, MUGrumblr, saying that the account is maintained by a 'Monstropolis transplant' and 'self-diagnosed coffee addict' who is currently a sophomore at Monsters University. A \"student\" from Monsters University uploaded memes, animated GIFs, and Instagram-like photos that are related to the sequel movie.\nApple's iPhone 5c: Created a Tumblr page, labeling it \"Every color has a story\" with the website name: \"ISee5c\". As soon as you visit the website, the page is covered with different colors representing the iPhone 5c phone colors and case colors. When you click on one of the colored section, a 15-second video plays a song and \"showcases the dots featured on the rear of the iPhone 5c official cases and on the iOS 7 dynamic wallpapers...\", concluding with words that are related to the video's theme.\n\n\n== Marketing techniques ==\nSocial media marketing involves the use of social networks, consumer's online brand-related activities (COBRA) and electronic word of mouth (eWOM) to successfully advertise online. Social networks such as Facebook and Twitter provide advertisers with information about the likes and dislikes of their consumers. This technique is crucial, as it provides the businesses with a \"target audience\". With social networks, information relevant to the user's likes is available to businesses; who then advertise accordingly. Activities such as uploading a picture of your \"new Converse sneakers to Facebook\" is an example of a COBRA. Electronic recommendations and appraisals are a convenient manner to have a product promoted via \"consumer-to-consumer interactions. An example of eWOM would be an online hotel review; the hotel company can have two possible outcomes based on their service. A good service would result in a positive review which gets the hotel free advertising via social media. However, a poor service will result in a negative consumer review which can potentially harm the company's reputation.\nSocial networking sites such as Facebook, Instagram, Twitter, MySpace etc. have all influenced the buzz of word of mouth marketing. In 1999, Misner said that word-of mouth marketing is, \"the world's most effective, yet least understood marketing strategy\" (Trusov, Bucklin, & Pauwels, 2009, p. 3). Through the influence of opinion leaders, the increased online \"buzz\" of \"word-of-mouth\" marketing that a product, service or companies are experiencing is due to the rise in use of social media and smartphones. Businesses and marketers have noticed that, \"a persons behaviour is influenced by many small groups\" (Kotler, Burton, Deans, Brown, & Armstrong, 2013, p. 189). These small groups rotate around social networking accounts that are run by influential people (opinion leaders or \"thought leaders\") who have followers of groups. The types of groups (followers) are called: reference groups (people who know each other either face-to-face or have an indirect influence on a persons attitude or behaviour); membership groups (a person has a direct influence on a person's attitude or behaviour); and aspirational groups (groups which an individual wishes to belong to).\nMarketers target influential people on social media who are recognised as being opinion leaders and opinion-formers to send messages to their target audiences and amplify the impact of their message. A social media post by an opinion leader can have a much greater impact (via the forwarding of the post or \"liking\" of the post) than a social media post by a regular user. Marketers have come to the understanding that \"consumers are more prone to believe in other individuals\" who they trust (Sepp, Liljander, & Gummerus, 2011). OL's and OF's can also send their own messages about products and services they choose (Fill, Hughes, & De Francesco, 2013, p. 216). The reason the opinion leader or formers have such a strong following base is because their opinion is valued or trusted (Clement, Proppe, & Rott, 2007). They can review products and services for their followings, which can be positive or negative towards the brand. OL's and OF's are people who have a social status and because of their personality, beliefs, values etc. have the potential to influence other people (Kotler, Burton, Deans, Brown, & Armstrong, 2013, p. 189). They usually have a large number of followers otherwise known as their reference, membership or aspirational group (Kotler, Burton, Deans, Brown, & Armstrong, 2013, p. 189. By having an OL or OF support a brands product by posting a photo, video or written recommendation on a blog, the following may be influenced and because they trust the OL/OF a high chance of the brand selling more products or creating a following base. Having an OL/OF helps spread word of mouth talk amongst reference groups and/or memberships groups e.g. family, friends, work-friends etc. (Kotler, Burton, Deans, Brown, & Armstrong, 2013, p. 189). The adjusted communication model shows the use of using opinion leaders and opinion formers. The sender/source gives the message to many, many OL's/OF's who pass the message on along with their personal opinion, the receiver (followers/groups) form their own opinion and send their personal message to their group (friends, family etc.)  (Dahlen, Lange, & Smith, 2010, p. 39).The platform of social media is another channel or site that business' and brands must seek to influence the content of. In contrast with pre-Internet marketing, such as TV ads and newspaper ads, in which the marketer controlled all aspects of the ad, with social media, users are free to post comments right below an online ad or an online post by a company about its product. Companies are increasing using their social media strategy as part of their traditional marketing effort using magazines, newspapers, radio advertisements, television advertisements. Since in the 2010s, media consumers are often using multiple platforms at the same time (e.g., surfing the Internet on a tablet while watching a streaming TV show), marketing content needs to be consistent across all platforms, whether traditional or new media. Heath (2006) wrote about the extent of attention businesses should give to their social media sites. It is about finding a balance between frequently posting but not over posting. There is a lot more attention to be paid towards social media sites because people need updates to gain brand recognition. Therefore, a lot more content is need and this can often be unplanned content.Planned content begins with the creative/marketing team generating their ideas, once they have completed their ideas they send them off for approval. There is two general ways of doing so. The first is where each sector approves the plan one after another, editor, brand, followed by the legal team (Brito, 2013). Sectors may differ depending on the size and philosophy of the business. The second is where each sector is given 24 hours (or such designated time) to sign off or disapprove. If no action is given within the 24-hour period the original plan is implemented. Planned content is often noticeable to customers and is un-original or lacks excitement but is also a safer option to avoid unnecessary backlash from the public. Both routes for planned content are time consuming as in the above; the first way to approval takes 72 hours to be approved. Although the second route can be significantly shorter it also holds more risk particularly in the legal department.\nUnplanned content is an 'in the moment' idea, \"a spontaneous, tactical reaction.\" (Cramer, 2014, p. 6). The content could be trending and not have the time to take the planned content route. The unplanned content is posted sporadically and is not calendar/date/time arranged (Deshpande, 2014). Issues with unplanned content revolve around legal issues and whether the message being sent out represents the business/brand accordingly. If a company sends out a Tweet or Facebook message too hurriedly, the company may unintentionally use insensitive language or messaging that could alienate some consumers. For example, celebrity chef Paula Deen was criticized after she made a social media post commenting about HIV-AIDS and South Africa; her message was deemed to be offensive by many observers. The main difference between planned and unplanned is the time to approve the content. Unplanned content must still be approved by marketing managers, but in a much more rapid manner e.g. 1–2 hours or less. Sectors may miss errors because of being hurried. When using unplanned content Brito (2013) says, \"be prepared to be reactive and respond to issues when they arise.\" Brito (2013) writes about having a, \"crisis escalation plan\", because, \"It will happen\". The plan involves breaking down the issue into topics and classifying the issue into groups. Colour coding the potential risk \"identify and flag potential risks\" also helps to organise an issue. The problem can then be handled by the correct team and dissolved more effectively rather than any person at hand trying to solve the situation.\n\n\n== Implications on traditional advertising ==\n\n\n=== Minimizing use ===\nTraditional advertising techniques include print and television advertising. The Internet has already overtaken television as the largest advertising market.Web sites often include the banner or pop-up ads. Social networking sites don't always have ads. In exchange, products have entire pages and are able to interact with users. Television commercials often end with a spokesperson asking viewers to check out the product website for more information. While briefly popular, print ads included QR codes on them. These QR codes can be scanned by cell phones and computers, sending viewers to the product website. Advertising is beginning to move viewers from the traditional outlets to the electronic ones.While traditional media, like newspapers and television advertising, are largely overshadowed by the rise of social media marketing, there is still a place for traditional marketing. For example, with newspapers, readership over the years has shown a decline. However, readership with newspapers is still fiercely loyal to print-only media. 51% of newspaper readers only read the newspaper in its print form, making well-placed ads valuable.\n\n\n=== Leaks ===\nThe Internet and social networking leaks are one of the issues facing traditional advertising. Video and print ads are often leaked to the world via the Internet earlier than they are scheduled to premiere. Social networking sites allow those leaks to go viral, and be seen by many users more quickly.\nThe time difference is also a problem facing traditional advertisers. When social events occur and are broadcast on television, there is often a time delay between airings on the east coast and west coast of the United States. Social networking sites have become a hub of comment and interaction concerning the event. This allows individuals watching the event on the west coast (time-delayed) to know the outcome before it airs. The 2011 Grammy Awards highlighted this problem. Viewers on the west coast learned who won different awards based on comments made on social networking sites by individuals watching live on the east coast. Since viewers knew who won already, many tuned out and ratings were lower. All the advertisement and promotion put into the event was lost because viewers didn't have a reason to watch.\n\n\n=== Mishaps ===\nSocial media marketing provides organizations with a way to connect with their customers.  However, organizations must protect their information as well as closely watch comments and concerns on the social media they use. A flash poll done on 1225 IT executives from 33 countries revealed that social media mishaps caused organizations a combined $4.3 million in damages in 2010. The top three social media incidents an organization faced during the previous year included employees sharing too much information in public forums, loss or exposure of confidential information, and increased exposure to litigation. Due to the viral nature of the Internet, a mistake by a single employee has in some cases shown to result in devastating consequences for organizations. An example of a social media mishap includes designer Kenneth Cole's Twitter mishap in 2011. When Kenneth Cole tweeted, \"Millions are in uproar in #Cairo. Rumor has they heard our new spring collection is now available online at [Kenneth Cole's website]\".  This reference to the 2011 Egyptian revolution drew an objection from the public; it was widely objected to on the Internet. Kenneth Cole realized his mistake shortly after and responded with a statement apologizing for the tweet.In 2012 during Hurricane Sandy, Gap sent out a tweet to its followers telling them to stay safe but encouraged them to shop online and offered free shipping. The tweet was deemed insensitive, and Gap eventually took it down and apologized. Numerous additional online marketing mishap examples exist. Examples include a YouTube video of a Domino's Pizza employee violating health code standards, which went viral on the Internet and later resulted in felony charges against two employees. A Twitter hashtag posted by McDonald's in 2012 attracting attention due to numerous complaints and negative events customers experienced at the chain store; and a 2011 tweet posted by a Chrysler Group employee that no one in Detroit knows how to drive. When the Link REIT opened a Facebook page to recommend old-style restaurants, the page was flooded by furious comments criticizing the REIT for having forced a lot of restaurants and stores to shut down; it had to terminate its campaign early amid further deterioration of its corporate image.In 2018, Max Factor, MAC and other beauty brands were forced to rush to disassociate themselves from Kuwaiti beauty blogger and Instagram 'influencer' Sondos Alqattan after she criticised government moves to improve conditions for domestic workers.\n\n\n=== Ethics ===\nThe code of ethics that is affiliated with traditional marketing can also be applied to social media. However, with social media being so personal and international, there is another list of complications and challenges that come along with being ethical online. With the invention of social media, the marketer no longer has to focus solely on the basic demographics and psychographics given from television and magazines, but now they can see what consumers like to hear from advertisers, how they engage online, and what their needs and wants are. The general concept of being ethical while marking on social network sites is to be honest with the intentions of the campaign, avoid false advertising, be aware of user privacy conditions (which means not using consumers' private information for gain), respect the dignity of persons in the shared online community, and claim responsibility for any mistakes or mishaps that are results of your marketing campaign. Most social network marketers use websites like Facebook and MySpace to try to drive traffic to another website. While it is ethical to use social networking websites to spread a message to people who are genuinely interested, many people game the system with auto-friend adding programs and spam messages and bulletins. Social networking websites are becoming wise to these practices, however, and are effectively weeding out and banning offenders.\nIn addition, social media platforms have become extremely aware of their users and collect information about their viewers to connect with them in various ways.  Social-networking website Facebook Inc. is quietly working on a new advertising system that would let marketers target users with ads based on the massive amounts of information people reveal on the site about themselves.  This may be an unethical or ethical feature to some individuals.  Some people may react negatively because they believe it is an invasion of privacy.  On the other hand, some individuals may enjoy this feature because their social network recognizes their interests and sends them particular advertisements pertaining to those interests.  Consumers like to network with people who have interests and desires that are similar to their own.  Individuals who agree to have their social media profile public, should be aware that advertisers have the ability to take information that interests them to be able to send them information and advertisements to boost their sales.  Managers invest in social media to foster relationships and interact with customers.  This is an ethical way for managers to send messages about their advertisements and products to their consumers.\nSince social media marketing first came to be, strategists and markets have been getting smarter and more careful with the way they go about collecting information and distributing advertisements. With the presence of data collecting companies, there is no longer a need to target specific audiences. This can be seen as a large ethical gray area. For many users, this is a breach of privacy, but there are no laws that prevent these companies from using the information provided on their websites. Companies like Equifax, Inc., TransUnion Corp, and LexisNexis Group thrive on collecting and sharing personal information of social media users. In 2012, Facebook purchased information from 70 million households from a third party company called Datalogix. Facebook later revealed that they purchased the information in order to create a more efficient advertising service.Facebook had an estimated 144.27 million views in 2016, approximately 12.9 million per month. Despite this high volume of traffic, very little has been done to protect the millions of users who log on to Facebook and other social media platforms each month. President Barack Obama tried to work with the Federal Trade Commission (FTC) to attempt to regulate data mining. He proposed the Privacy Bill of Rights, which would protect the average user from having their private information downloaded and shared with third party companies. The proposed laws would give the consumer more control over what information companies can collect. President Obama was unable to pass most of these laws through congress, and it is unsure what President Trump will do with regards to social media marketing ethics.\n\n\n== Metrics ==\n\n\n=== Web site reports ===\nThis involves tracking the volume of visits, leads, and customers to a website from the individual social channel. Google Analytics is a free tool that shows the behavior and other information, such as demographics and device type used, of website visitors from social networks. This and other commercial offers can aid marketers in choosing the most effective social networks and social media marketing activities.\n\n\n=== Return on investment data ===\n\nThe end goal of any marketing effort is to generate sales. Although social media is a useful marketing tool, it is often difficult to quantify to what extent it is contributing to profit. ROI can be measured by comparing marketing analytic value to contact database or CRM and connect marketing efforts directly to sales activity.\n\n\n=== Customer response rates ===\nSeveral customers are turning towards social media to express their appreciation or frustration with brands, product or services.  Therefore, marketers can measure the frequency of which customers are discussing their brand and judge how effective their SMM strategies are. In recent studies, 72% of people surveyed expressed that they expected a response to their complaints on Twitter within an hour.\n\n\n=== Reach and virality ===\nPopular social media such as Facebook, Twitter, LinkedIn, and other social networks can provide marketers with a hard number of how large their audience is nevertheless a large audience may not always translate into a large sales volumes. Therefore, an effective SMM cannot be measured by a large audience but rather by vigorous audience activity such as social shares, re-tweets etc.\n\n\n== Social media marketing in sport ==\nThere has been an increase in social media marketing in sport, as sports teams and clubs recognise the importance of keeping a rapport with their fans and other audiences through social media. Sports personalities such as Cristiano Ronaldo have 40.7 million followers on Twitter and 49.6 million on Instagram, creating opportunities for endorsements.\n\n\n== See also ==\nIntegrated marketing communications\nInternet marketing\nSocial media optimization\nSocial media spam\nSocial video marketing\nVisual marketing\nWeb 2.0\ninternet celebrity\n\n\n== References ==\n\n\n== External links ==\nBria, Francesca (2014) Social media and their impact on organisations: building Firm Celebrity and organisational legitimacy through social media (dissertation). Retrieved 13 September 2018\nKang, Juhee (2015). Social media marketing (dissertation). Journal of Marketing. Retrieved 8 February 2015."}