{"text": "Business is the activity of making one's living or making money by producing or buying and selling products (such as goods and services). Simply put, it is \"any activity or enterprise entered into for profit. It does not mean it is a company, a corporation, partnership, or have any such formal organization, but it can range from a street peddler to General Motors.\"Having a business name does not separate the business entity from the owner, which means that the owner of the business is responsible and liable for debts incurred by the business.  If the business acquires debts, the creditors can go after the owner's personal possessions.  A business structure does not allow for corporate tax rates. The proprietor is personally taxed on all income from the business.\nThe term is also often used colloquially (but not by lawyers or by public officials) to refer to a company. A company, on the other hand, is a separate legal entity and provides for limited liability, as well as corporate tax rates.  A company structure is more complicated and expensive to set up, but offers more protection and benefits for the owner.\n\n\n== Forms ==\n\nForms of business ownership vary by jurisdiction, but several common entities exist:\n\nSole proprietorship: A sole proprietorship, also known as a sole trader, is owned by one person and operates for their benefit. The owner operates the business alone and may hire employees. A sole proprietor has unlimited liability for all obligations incurred by the business, whether from operating costs or judgments against the business. All assets of the business belong to a sole proprietor, including, for example, a computer infrastructure, any inventory, manufacturing equipment, or retail fixtures, as well as any real property owned by the sole proprietor.\nPartnership:  A partnership is a business owned by two or more people. In most forms of partnerships, each partner has unlimited liability for the debts incurred by the business. The three most prevalent types of for-profit partnerships are general partnerships, limited partnerships, and limited liability partnerships.\nCorporation:  The owners of a corporation have limited liability and the business has a separate legal personality from its owners.  Corporations can be either government-owned or privately owned, and they can organize either for profit or as nonprofit organizations. A privately owned, for-profit corporation is owned by its shareholders, who elect a board of directors to direct the corporation and hire its managerial staff.  A privately owned, for-profit corporation can be either privately held by a small group of individuals, or publicly held, with publicly traded shares listed on a stock exchange.\nCooperative: Often referred to as a \"co-op\", a cooperative is a limited-liability business that can organize as for-profit or not-for-profit. A cooperative differs from a corporation in that it has members, not shareholders, and they share decision-making authority. Cooperatives are typically classified as either consumer cooperatives or worker cooperatives. Cooperatives are fundamental to the ideology of economic democracy.\nLimited liability companies (LLC), limited liability partnerships, and other specific types of business organization protect their owners or shareholders from business failure by doing business under a separate legal entity with certain legal protections. In contrast, unincorporated businesses or persons working on their own are usually not as protected.\nFranchises: A franchise is a system in which entrepreneurs purchase the rights to open and run a business from a larger corporation.  Franchising in the United States is widespread and is a major economic powerhouse.  One out of twelve retail businesses in the United States are franchised and 8 million people are employed in a franchised business.\nA company limited by guarantee:  Commonly used where companies are formed for non-commercial purposes, such as clubs or charities.  The members guarantee the payment of certain (usually nominal) amounts if the company goes into insolvent liquidation, but otherwise, they have no economic rights in relation to the company. This type of company is common in England. A company limited by guarantee may be with or without having share capital.\nA company limited by shares:  The most common form of the company used for business ventures. Specifically, a limited company is a \"company in which the liability of each shareholder is limited to the amount individually invested\" with corporations being \"the most common example of a limited company.\" This type of company is common in England and many English-speaking countries. A company limited by shares may be a\npublicly traded company or a\nprivately held company\nA company limited by guarantee with a share capital:  A hybrid entity, usually used where the company is formed for non-commercial purposes, but the activities of the company are partly funded by investors who expect a return.  This type of company may no longer be formed in the UK, although provisions still exist in law for them to exist.\nA limited liability company: \"A company—statutorily authorized in certain states—that is characterized by limited liability, management by members or managers, and limitations on ownership transfer\", i.e., L.L.C. LLC structure has been called \"hybrid\" in that it \"combines the characteristics of a corporation and of a partnership or sole proprietorship\". Like a corporation, it has limited liability for members of the company, and like a partnership, it has \"flow-through taxation to the members\" and must be \"dissolved upon the death or bankruptcy of a member\".\nAn unlimited company with or without a share capital: A hybrid entity, a company where the liability of members or shareholders for the debts (if any) of the company are not limited. In this case, the doctrine of a veil of incorporation does not apply.Less common types of companies are:\n\nCompanies formed by letters patent:  Most corporations by letters patent are corporations sole and not companies as the term is commonly understood today.\nCharter corporations:  Before the passing of modern companies legislation, these were the only types of companies.  Now they are relatively rare, except for very old companies that still survive (of which there are still many, particularly many British banks), or modern societies that fulfill a quasi-regulatory function (for example, the Bank of England is a corporation formed by a modern charter).\nStatutory companies:  Relatively rare today, certain companies have been formed by a private statute passed in the relevant jurisdiction.Note that \"Ltd after the company's name signifies limited company, and PLC (public limited company) indicates that its shares are widely held.\"In legal parlance, the owners of a company are normally referred to as the \"members\". In a company limited or unlimited by shares (formed or incorporated with a share capital), this will be the shareholders. In a company limited by guarantee, this will be the guarantors. Some offshore jurisdictions have created special forms of offshore company in a bid to attract business for their jurisdictions. Examples include \"segregated portfolio companies\" and restricted purpose companies.\nThere are, however, many, many sub-categories of types of company that can be formed in various jurisdictions in the world.\nCompanies are also sometimes distinguished into public companies and private companies for legal and regulatory purposes. Public companies are companies whose shares can be publicly traded, often (although not always) on a stock exchange which imposes listing requirements/Listing Rules as to the issued shares, the trading of shares and a future issue of shares to help bolster the reputation of the exchange or particular market of exchange. Private companies do not have publicly traded shares, and often contain restrictions on transfers of shares. In some jurisdictions, private companies have maximum numbers of shareholders.\nA parent company is a company that owns enough voting stock in another firm to control management and operations by influencing or electing its board of directors; the second company being deemed as a subsidiary of the parent company. The definition of a parent company differs by jurisdiction, with the definition normally being defined by way of laws dealing with companies in that jurisdiction.\n\n\n== Classifications ==\n\nAgriculture, such as the domestication of fish, animals, and livestock, as well as lumber, oil and mining businesses that extract natural resources and raw materials, such as wood, petroleum, natural gas, ores, plants or minerals.\nFinancial services businesses include banks, brokerage firms, credit unions, credit cards, insurance companies, asset and investment companies such as private equity firms, private equity funds, real estate investment trusts, sovereign wealth funds, pension funds, mutual funds, index funds, and hedge funds, stock exchanges, and other companies that generate profits through investment and management of capital.\nEntertainment companies and mass media agencies generate profits primarily from the sale of intellectual property. They include film studios and production houses, mass media companies such as cable television networks, online digital media agencies, talent agencies, mobile media outlets, newspapers, book and magazine publishing houses.\nIndustrial manufacturers produce products, either from raw materials or from component parts, then export the finished products at a profit. They include tangible goods such as cars, buses, medical devices, glass, or aircraft.\nReal estate businesses sell, invest, construct and develop properties, including land, residential homes, and other buildings.\nRetailers, wholesalers, and distributors act as middlemen and get goods produced by manufacturers to the intended consumers; they make their profits by marking up their prices. Most stores and catalog companies are distributors or retailers.\nTransportation businesses such as railways, airlines, shipping companies that deliver goods and individuals to their destinations for a fee.\nUtilities produce public services such as water, electricity, waste management or sewage treatment. These industries are usually operated under the charge of a public government.\nService businesses offer intangible goods or services and typically charge for labor or other services provided to government, to consumers, or to other businesses. Interior decorators, beauticians, hair stylists, make-up artists, tanning salons, laundromats, dry cleaners, and pest controllers are service businesses.\n\n\n== Activities ==\n\n\n=== Accounting ===\n\nAccounting is the measurement, processing, and communication of financial information about economic entities such as businesses and corporations. The modern field was established by the Italian mathematician Luca Pacioli in 1494.  Accounting, which has been called the \"language of business\", measures the results of an organization's economic activities and conveys this information to a variety of users, including investors, creditors, management, and regulators.  Practitioners of accounting are known as accountants. The terms \"accounting\" and \"financial reporting\" are often used as synonyms.\n\n\n=== Finance ===\n\nFinance is a field that deals with the study of investments. It includes the dynamics of assets and liabilities over time under conditions of different degrees of uncertainty and risk. Finance can also be defined as the science of money management. Finance aims to price assets based on their risk level and their expected rate of return. Finance can be broken into three different sub categories: public finance, corporate finance, and personal finance.\n\n\n=== Manufacturing ===\n\nManufacturing is the production of merchandise for use or sale using labour and machines, tools, chemical and biological processing, or formulation. The term may refer to a range of human activity, from handicraft to high tech, but is most commonly applied to industrial production, in which raw materials are transformed into finished goods on a large scale.\n\n\n=== Marketing ===\n\nMarketing is defined by the American Marketing Association as \"the activity, set of institutions, and processes for creating, communicating, delivering, and exchanging offerings that have value for customers, clients, partners, and society at large.\" The term developed from the original meaning which referred literally to going to a market to buy or sell goods or services.  Marketing tactics include advertising as well as determining product pricing.\nWith the rise in technology, marketing is further divided into a class called digital marketing. It is marketing products and services using digital technologies.\n\n\n=== Research and development ===\n\nResearch and development refer to activities in connection with corporate or government innovation. Research and development constitute the first stage of development of a potential new service or product. Research and development are very difficult to manage since the defining feature of the research is that the researchers do not know in advance exactly how to accomplish the desired result.\n\n\n=== Safety ===\n\nInjuries cost businesses billions of dollars annually.  Studies have shown how company acceptance and implementation of comprehensive safety and health management systems reduce incidents, insurance costs, and workers’ compensation claims.  New technologies, like wearable safety devices and available online safety training, continue to be developed to encourage employers to invest in protection beyond the \"canary in the coal mine\" and reduce the cost to businesses of protecting their employees.\n\n\n=== Sales ===\n\nSales are activity related to selling or the number of goods or services sold in a given time period. Sales are often integrated with all lines of business and are key to a companies' success.\n\n\n== Management ==\n\nThe efficient and effective operation of a business, and study of this subject, is called management. The major branches of management are financial management, marketing management, human resource management, strategic management, production management, operations management, service management, and information technology management.Owners may manage their businesses themselves, or employ managers to do so for them. Whether they are owners or employees, managers administer three primary components of the business' value: financial resources, capital (tangible resources), and human resources.  These resources are administered in at least six functional areas: legal contracting, manufacturing or service production, marketing, accounting, financing, and human resources.\n\n\n=== Restructuring state enterprises ===\nIn recent decades, states modeled some of their assets and enterprises after business enterprises. In 2003, for example, the People's Republic of China modeled 80% of its state-owned enterprises on a company-type management system. Many state institutions and enterprises in China and Russia have transformed into joint-stock companies, with part of their shares being listed on public stock markets.\nBusiness process management (BPM) is a holistic management approach focused on aligning all aspects of an organization with the wants and needs of clients. BPM attempts to improve processes continuously. It can, therefore, be described as a \"process optimization process\". It is argued that BPM enables organizations to be more efficient, effective and capable of change than a functionally focused, traditional hierarchical management approach.\n\n\n== Organization and regulation ==\n\nMost legal jurisdictions specify the forms of ownership that a business can take, creating a body of commercial law for each type.\nThe major factors affecting how a business is organized are usually:\n\nThe size and scope of the business firm and its structure, management, and ownership, broadly analyzed in the theory of the firm. Generally, a smaller business is more flexible, while larger businesses, or those with wider ownership or more formal structures, will usually tend to be organized as corporations or (less often) partnerships. In addition, a business that wishes to raise money on a stock market or to be owned by a wide range of people will often be required to adopt a specific legal form to do so.\nThe sector and country. Private profit-making businesses are different from government-owned bodies. In some countries, certain businesses are legally obliged to be organized in certain ways.\nTax advantages. Different structures are treated differently in tax law and may have advantages for this reason.\nDisclosure and compliance requirements. Different business structures may be required to make less or more information public (or report it to relevant authorities) and may be bound to comply with different rules and regulations.Many businesses are operated through a separate entity such as a corporation or a partnership (either formed with or without limited liability). Most legal jurisdictions allow people to organize such an entity by filing certain charter documents with the relevant Secretary of State or equivalent and complying with certain other ongoing obligations. The relationships and legal rights of shareholders, limited partners, or members are governed partly by the charter documents and partly by the law of the jurisdiction where the entity is organized. Generally speaking, shareholders in a corporation, limited partners in a limited partnership, and members in a limited liability company are shielded from personal liability for the debts and obligations of the entity, which is legally treated as a separate \"person\". This means that unless there is misconduct, the owner's own possessions are strongly protected in law if the business does not succeed.\nWhere two or more individuals own a business together but have failed to organize a more specialized form of vehicle, they will be treated as a general partnership. The terms of a partnership are partly governed by a partnership agreement if one is created, and partly by the law of the jurisdiction where the partnership is located. No paperwork or filing is necessary to create a partnership, and without an agreement, the relationships and legal rights of the partners will be entirely governed by the law of the jurisdiction where the partnership is located. A single person who owns and runs a business is commonly known as a sole proprietor, whether that person owns it directly or through a formally organized entity. Depending on the business needs, an adviser can decide what kind is proprietorship will be most suitable.\nA few relevant factors to consider in deciding how to operate a business include:\n\nGeneral partners in a partnership (other than a limited liability partnership), plus anyone who personally owns and operates a business without creating a separate legal entity, are personally liable for the debts and obligations of the business.\nGenerally, corporations are required to pay tax just like \"real\" people. In some tax systems, this can give rise to so-called double taxation, because first the corporation pays tax on the profit, and then when the corporation distributes its profits to its owners, individuals have to include dividends in their income when they complete their personal tax returns, at which point a second layer of income tax is imposed.\nIn most countries, there are laws which treat small corporations differently from large ones. They may be exempt from certain legal filing requirements or labor laws, have simplified procedures in specialized areas, and have simplified, advantageous, or slightly different tax treatment.\n\"Going public\" through a process known as an initial public offering (IPO) means that part of the business will be owned by members of the public. This requires the organization as a distinct entity, to disclose information to the public, and adhering to a tighter set of laws and procedures. Most public entities are corporations that have sold shares, but increasingly there are also public LLC's that sell units (sometimes also called shares), and other more exotic entities as well, such as, for example, real estate investment trusts in the US, and unit trusts in the UK. A general partnership cannot \"go public\".\n\n\n=== Commercial law ===\n\nA very detailed and well-established body of rules that evolved over a very long period of time applies to commercial transactions. The need to regulate trade and commerce and resolve business disputes helped shape the creation of law and courts. The Code of Hammurabi dates back to about 1772 BC for example and contains provisions that relate, among other matters, to shipping costs and dealings between merchants and brokers. The word \"corporation\" derives from the Latin corpus, meaning body, and the Maurya Empire in Iron-Age India accorded legal rights to business entities.In many countries, it is difficult to compile all the laws that can affect a business into a single reference source. Laws can govern the treatment of labour and employee relations, worker protection and safety, discrimination on the basis of age, gender, disability, race, and in some jurisdictions, sexual orientation, and the minimum wage,  as well as unions, worker compensation, and working hours and leave.\nSome specialized businesses may also require licenses, either due to laws governing entry into certain trades, occupations or professions, that require special education or to raise revenue for local governments. Professions that require special licenses include law, medicine, piloting aircraft, selling liquor, radio broadcasting, selling investment securities, selling used cars, and roofing. Local jurisdictions may also require special licenses and taxes just to operate a business.\nSome businesses are subject to ongoing special regulation, for example, public utilities, investment securities, banking, insurance, broadcasting, aviation, and health care providers. Environmental regulations are also very complex and can affect many businesses.\n\n\n=== Capital ===\n When businesses need to raise money (called capital), they sometimes offer securities for sale.\nCapital may be raised through private means, by an initial public offering or IPO on a stock exchange, or in other ways.\nMajor stock exchanges include the Shanghai Stock Exchange, Singapore Exchange, Hong Kong Stock Exchange, New York Stock Exchange and NASDAQ (the USA), the London Stock Exchange (UK), the Tokyo Stock Exchange (Japan), and Bombay Stock Exchange (India). Most countries with capital markets have at least one.\nBusinesses that have gone public are subject to regulations concerning their internal governance, such as how executive officers' compensation is determined, and when and how information is disclosed to shareholders and to the public. In the United States, these regulations are primarily implemented and enforced by the United States Securities and Exchange Commission (SEC). Other western nations have comparable regulatory bodies. The regulations are implemented and enforced by the China Securities Regulation Commission (CSRC) in China. In Singapore, the regulatory authority is the Monetary Authority of Singapore (MAS), and in Hong Kong, it is the Securities and Futures Commission (SFC).\nThe proliferation and increasing complexity of the laws governing business have forced increasing specialization in corporate law. It is not unheard of for certain kinds of corporate transactions to require a team of five to ten attorneys due to sprawling regulation. Commercial law spans general corporate law, employment and labor law, health-care law, securities law, mergers and acquisitions, tax law, employee benefit plans, food and drug regulation, intellectual property law on copyrights, patents, trademarks, telecommunications law, and financing.\nOther types of capital sourcing include crowdsourcing on the Internet, venture capital, bank loans, and debentures.\n\n\n=== Intellectual property ===\n\nBusinesses often have important \"intellectual property\" that needs protection from competitors for the company to stay profitable. This could require patents, copyrights, trademarks, or preservation of trade secrets. Most businesses have names, logos, and similar branding techniques that could benefit from trademarking. Patents and copyrights in the United States are largely governed by federal law, while trade secrets and trademarking are mostly a matter of state law. Because of the nature of intellectual property, a business needs protection in every jurisdiction in which they are concerned about competitors. Many countries are signatories to international treaties concerning intellectual property, and thus companies registered in these countries are subject to national laws bound by these treaties. In order to protect trade secrets, companies may require employees to sign noncompete clauses which will impose limitations on an employee's interactions with stakeholders, and competitors.\n\n\n=== Trade union ===\n\nA trade union (or labor union) is an organization of workers who have come together to achieve common goals such as protecting the integrity of its trade, improving safety standards, achieving higher pay and benefits such as health care and retirement, increasing the number of employees an employer assigns to complete the work, and better working conditions. The trade union, through its leadership, bargains with the employer on behalf of union members (rank and file members) and negotiates labor contracts (collective bargaining) with employers. The most common purpose of these associations or unions is \"maintaining or improving the conditions of their employment\". This may include the negotiation of wages, work rules, complaint procedures, rules governing hiring, firing, and promotion of workers, benefits, workplace safety and policies.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links =="}