{"text": "Online Business or e-business is any kind of business or commercial transaction that includes sharing information across the internet. Commerce constitutes the exchange of products and services between businesses, groups and individuals and can be seen as one of the essential activities of any business. Electronic commerce focuses on the use of ICT to enable the external activities and relationships of the business with individuals, groups and other businesses, while e-business refers to business with help of the internet. The term \"e-business\" was coined by IBM's marketing and Internet team in 1996.\n\n\n== History ==\nIn 1994, IBM, with its agency Ogilvy & Mather, began to use its foundation in IT solutions and expertise to market itself as a leader of conducting business on the Internet through the term \"e-business.\" Then CEO Louis V. Gerstner, Jr. was prepared to invest $1 billion to market this new brand.After conducting worldwide market research in October 1997, IBM began with an eight-page piece in the Wall Street Journal that would introduce the concept of \"e-business\" and advertise IBM's expertise in the new field. IBM decided not to trademark the term \"e-business\" in the hopes that other companies would use the term and create an entire new industry. However, this proved to be too successful and by 2000, to differentiate itself, IBM launched a $300 million campaign about its \"e-business infrastructure\" capabilities. Since that time, the terms, \"e-business\" and \"e-commerce\" have been loosely interchangeable and have become a part of the common vernacular.\n\n\n== Business model ==\n\nWhen organizations go online, they have to decide which e-business models best suit their goals. A business model is defined as the organization of product, service and information flows, and the source of revenues and benefits for suppliers and customers. The concept of e-business model is the same but used in the online presence.\n\n\n=== Revenue model ===\n\nA key component of the business model is the revenue model or profit model, which is a framework for generating revenues. It identifies which revenue source to pursue, what value to offer, how to price the value, and who pays for the value. It is a key component of a company's business model. It primarily identifies what product or service will be created in order to generate revenues and the ways in which the product or service will be sold.\nWithout a well defined revenue model, that is, a clear plan of how to generate revenues, new businesses will more likely struggle due to costs which they will not be able to sustain. By having a dirty revenue model, a business can focus on a target audience, fund development plans for a product or service, establish marketing plans, begin a line of credit and raise capital.\n\n\n==== E-commerce ====\n\nE-commerce (short for \"electronic commerce\") is trading in products or services using computer networks, such as the Internet. Electronic commerce draws on technologies such as mobile commerce, electronic funds transfer, supply chain management, Internet marketing, online transaction processing, electronic data interchange (EDI), inventory management systems, and automated data collection. Modern electronic commerce typically uses the World Wide Web for at least one part of the transaction's life cycle, although it may also use other technologies such as e-mail.\n\n\n== Concerns ==\nWhile much has been written of the economic advantages of Internet-enabled commerce, there is also evidence that some aspects of the internet such as maps and location-aware services may serve to reinforce economic inequality and the digital divide. Electronic commerce may be responsible for consolidation and the decline of mom-and-pop, brick and mortar businesses resulting in increases in income inequality. Author Andrew Keen, a long-time critic of the social transformations caused by the Internet, has recently focused on the economic effects of consolidation from Internet businesses, since these businesses employ much fewer people per dollar of sales than traditional retailers.\n\n\n=== Security ===\nE-business systems naturally have greater security risks than traditional business systems, therefore it is important for e-business systems to be fully protected against these risks. A far greater number of people have access to e-businesses through the internet than would have access to a traditional business. Customers, suppliers, employees, and numerous other people use any particular e-business system daily and expect their confidential information to stay secure. Hackers are one of the great threats to the security of e-businesses. Some common security concerns for e-Businesses include keeping business and customer information private and confidential, authenticity of data, and data integrity. Some of the methods of protecting e-business security and keeping information secure include physical security measures as well as data storage, data transmission, anti-virus software, firewalls, and encryption to list a few.\n\n\n==== Privacy and confidentiality ====\nConfidentiality is the extent to which businesses makes personal information available to other businesses and individuals. With any business, confidential information must remain secure and only be accessible to the intended recipient. However, this becomes even more difficult when dealing with e-businesses specifically. To keep such information secure means protecting any electronic records and files from unauthorized access, as well as ensuring safe transmission and data storage of such information. Tools such as encryption and firewalls manage this specific concern within e-business.\n\n\n==== Authenticity ====\nE-business transactions pose greater challenges for establishing authenticity due to the ease with which electronic information may be altered and copied. Both parties in an e-business transaction want to have the assurance that the other party is who they claim to be, especially when a customer places an order and then submits a payment electronically. One common way to ensure this is to limit access to a network or trusted parties by using a virtual private network (VPN) technology. The establishment of authenticity is even greater when a combination of techniques are used, and such techniques involve checking \"something you know\" (i.e. password or PIN), \"something you need\" (i.e. credit card), or \"something you are\" (i.e. digital signatures or voice recognition methods). Many times in e-business, however, \"something you are\" is pretty strongly verified by checking the purchaser's \"something you have\" (i.e. credit card) and \"something you know\" (i.e. card number).\n\n\n==== Data integrity ====\nData integrity answers the question \"Can the information be changed or corrupted in any way?\" This leads to the assurance that the message received is identical to the message sent. A business needs to be confident that data is not changed in transit, whether deliberately or by accident. To help with data integrity, firewalls protect stored data against unauthorized access, while simply backing up data allows recovery should the data or equipment be damaged.\n\n\n==== Non-repudiation ====\nThis concern deals with the existence of proof in a transaction. A business must have assurance that the receiving party or purchaser cannot deny that a transaction has occurred, and this means having sufficient evidence to prove the transaction. One way to address non-repudiation is using digital signatures. A digital signature not only ensures that a message or document has been electronically signed by the person, but since a digital signature can only be created by one person, it also ensures that this person cannot later deny that they provided their  signature.\n\n\n==== Access control ====\nWhen certain electronic resources and information is limited to only a few authorized individuals, a business and its customers must have the assurance that no one else can access the systems or information. There are a variety of techniques to address this concern including firewalls, access privileges, user identification and authentication techniques (such as passwords and digital certificates), Virtual Private Networks (VPN), and much more.\n\n\n==== Availability ====\nThis concern is specifically pertinent to a business' customers as certain information must be available when customers need it. Messages must be delivered in a reliable and timely fashion, and information must be stored and retrieved as required. Because availability of service is important for all e-business websites, steps must be taken to prevent disruption of service by events such as power outages and damage to physical infrastructure. Examples to address this include data backup, fire-suppression systems, Uninterrupted Power Supply (UPS) systems, virus protection, as well as making sure that there is sufficient capacity to handle the demands posed by heavy network traffic.\n\n\n==== Cost ====\nThe business internet which supports e-business has a cost to maintain of about $2 trillion in outsourced IT dollars just in the United States alone.  With each website custom crafted and maintained in code, the maintenance burden is enormous.  In the twenty-first century, look for new businesses that will help standardize the look and feel of the internet presence of a business to be more uniform in nature to help reduce the cost of maintenance.\n\n\n=== Security solutions ===\nWhen it comes to security solutions, sustainable electronic business requires support for data integrity, strong authentication, and privacy.\n\n\n==== Access and data integrity ====\nThere are several different ways to prevent access to the data that is kept online. One way is to use anti-virus software. This is something that most people use to protect their networks regardless of the data they have. E-businesses should use this because they can then be sure that the information sent and received to their system is clean.\nA second way to protect the data is to use firewalls and network protection. A firewall is used to restrict access to private networks, as well as public networks that a company may use. The firewall also has the ability to log attempts into the network and provide warnings as it is happening. They are very beneficial to keep third-parties out of the network. Businesses that use Wi-Fi need to consider different forms of protection because these networks are easier for someone to access. They should look into protected access, virtual private networks, or internet protocol security.\nAnother option they have is an intrusion detection system. This system alerts when there are possible intrusions. Some companies set up traps or \"hot spots\" to attract people and are then able to know when someone is trying to hack into that area.\n\n\n==== Encryption ====\nEncryption, which is actually a part of cryptography, involves transforming texts or messages into a code which is unreadable. These messages have to be decrypted in order to be understandable or usable for someone. There is a key that identifies the data to a certain person or company. With public key encryption, there are actually two keys used. One is public and one is private. The public one is used for encryption, and the private for decryption. The level of the actual encryption can be adjusted and should be based on the information. The key can be just a simple slide of letters or a completely random mix-up of letters. This is relatively easy to implement because there is software that a company can purchase. A company needs to be sure that their keys are registered with a certificate authority.\n\n\n==== Digital certificates ====\nThe point of a digital certificate is to identify the owner of a document. This way the receiver knows that it is an authentic document. Companies can use these certificates in several different ways. They can be used as a replacement for user names and passwords. Each employee can be given these to access the documents that they need from wherever they are.\nThese certificates also use encryption. They are a little more complicated than normal encryption however. They actually used important information within the code. They do this in order to assure authenticity of the documents as well as confidentiality and data integrity which always accompany encryption.\nDigital certificates are not commonly used because they are confusing for people to implement. There can be complications when using different browsers, which means they need to use multiple certificates. The process is being adjusted so that it is easier to use.\n\n\n==== Digital signatures ====\nA final way to secure information online would be to use a digital signature. If a document has a digital signature on it, no one else is able to edit the information without being detected. That way if it is edited, it may be adjusted for reliability after the fact. In order to use a digital signature, one must use a combination of cryptography and a message digest. A message digest is used to give the document a unique value. That value is then encrypted with the sender's private key.\n\n\n== See also ==\nElectronic commerce\nVery Large Business Applications\nDigital economy\nTypes of E-commerce\nShopping cart software\n\n\n== References =="}