{"text": "Entrepreneurship is the process of designing, launching and running a new business, which is often initially a small business. The people who create these businesses are called entrepreneurs.Entrepreneurship has been described as the \"capacity and willingness to develop, organize and manage a business venture along with any of its risks in order to make a profit.\" While definitions of entrepreneurship typically focus on the launching and running of businesses, due to the high risks involved in launching a start-up, a significant proportion of start-up businesses have to close due to \"lack of funding, bad business decisions, an economic crisis, lack of market demand, or a combination of all of these.\"A broader definition of the term is sometimes used, especially in the field of economics. In this usage, an Entrepreneur is an entity which has the ability to find and act upon opportunities to translate inventions or technologies into products and services: \"The entrepreneur is able to recognize the commercial potential of the invention and organize the capital, talent, and other resources that turn an invention into a commercially viable innovation.\"  In this sense, the term \"Entrepreneurship\" also captures innovative activities on the part of established firms, in addition to similar activities on the part of new businesses.\n\n\n== Elements ==\nEntrepreneurship is the act of being an entrepreneur, or \"the owner or manager of a business enterprise who, by risk and initiative, attempts to make profits\". Entrepreneurs act as managers and oversee the launch and growth of an enterprise. Entrepreneurship is the process by which either an individual or a team identifies a business opportunity and acquires and deploys the necessary resources required for its exploitation. Early-19th-century French economist Jean-Baptiste Say provided a broad definition of entrepreneurship, saying that it \"shifts economic resources out of an area of lower and into an area of higher productivity and greater yield\". Entrepreneurs create something new, something different—they change or transmute values. Regardless of the firm size, big or small, they can partake in entrepreneurship opportunities. The opportunity to become an entrepreneur requires four criteria. First, there must be opportunities or situations to recombine resources to generate profit. Second, entrepreneurship requires differences between people, such as preferential access to certain individuals or the ability to recognize information about opportunities. Third, taking on risk is a necessity. Fourth, the entrepreneurial process requires the organization of people and resources.The entrepreneur is a factor in and the study of entrepreneurship reaches back to the work of Richard Cantillon and Adam Smith in the late 17th and early 18th centuries. However, entrepreneurship was largely ignored theoretically until the late 19th and early 20th centuries and empirically until a profound resurgence in business and economics since the late 1970s. In the 20th century, the understanding of entrepreneurship owes much to the work of economist Joseph Schumpeter in the 1930s and other Austrian economists such as Carl Menger, Ludwig von Mises and Friedrich von Hayek. According to Schumpeter, an entrepreneur is a person who is willing and able to convert a new idea or invention into a successful innovation. Entrepreneurship employs what Schumpeter called \"the gale of creative destruction\" to replace in whole or in part inferior innovations across markets and industries, simultaneously creating new products including new business models. In this way, creative destruction is largely responsible for the dynamism of industries and long-run economic growth. The supposition that entrepreneurship leads to economic growth is an interpretation of the residual in endogenous growth theory and as such is hotly debated in academic economics. An alternative description posited by Israel Kirzner suggests that the majority of innovations may be much more incremental improvements such as the replacement of paper with plastic in the making of drinking straws.\nThe exploitation of entrepreneurial opportunities may include:\nDeveloping a business plan\nHiring the human resources\nAcquiring financial and material resources\nProviding leadership\nBeing responsible for both the venture's success or failure\nRisk aversionEconomist Joseph Schumpeter (1883–1950) saw the role of the entrepreneur in the economy as \"creative destruction\" – launching innovations that simultaneously destroy old industries while ushering in new industries and approaches. For Schumpeter, the changes and \"dynamic disequilibrium brought on by the innovating entrepreneur [were] the norm of a healthy economy\". While entrepreneurship is often associated with new, small, for-profit start-ups, entrepreneurial behavior can be seen in small-, medium- and large-sized firms, new and established firms and in for-profit and not-for-profit organizations, including voluntary-sector groups, charitable organizations and government.Entrepreneurship may operate within an entrepreneurship ecosystem which often includes:\n\nGovernment programs and services that promote entrepreneurship and support entrepreneurs and start-ups\nNon-governmental organizations such as small-business associations and organizations that offer advice and mentoring to entrepreneurs (e.g. through entrepreneurship centers or websites)\nSmall-business advocacy organizations that lobby governments for increased support for entrepreneurship programs and more small business-friendly laws and regulations\nEntrepreneurship resources and facilities (e.g. business incubators and seed accelerators)\nEntrepreneurship education and training programs offered by schools, colleges and universities\nFinancing (e.g. bank loans, venture capital financing, angel investing and government and private foundation grants)In the 2000s, usage of the term \"entrepreneurship\" expanded to include how and why some individuals (or teams) identify opportunities, evaluate them as viable, and then decide to exploit them. The term has also been used to discuss how people might use these opportunities to develop new products or services, launch new firms or industries, and create wealth. The entrepreneurial process is uncertain because opportunities can only be identified after they have been exploited.Entrepreneurs exhibit positive biases towards finding new possibilities and seeing unmet market needs, and a tendency towards risk-taking that makes them more likely to exploit business opportunities.\n\n\n== History ==\n\n\n=== Historical usage ===\n\n\"Entrepreneur\" ( (listen), UK also ) is a loanword from French. The word first appeared in the French dictionary entitled Dictionnaire Universel de Commerce compiled by Jacques des Bruslons and published in 1723. Especially in Britain, the term \"adventurer\" was often used to denote the same meaning. The study of entrepreneurship reaches back to the work in the late 17th and early 18th centuries of Irish-French economist Richard Cantillon, which was foundational to classical economics. Cantillon defined the term first in his Essai sur la Nature du Commerce en Général, or Essay on the Nature of Trade in General, a book William Stanley Jevons considered the \"cradle of political economy\". Cantillon defined the term as a person who pays a certain price for a product and resells it at an uncertain price, \"making decisions about obtaining and using the resources while consequently admitting the risk of enterprise\". Cantillon considered the entrepreneur to be a risk taker who deliberately allocates resources to exploit opportunities in order to maximize the financial return. Cantillon emphasized the willingness of the entrepreneur to assume the risk and to deal with uncertainty, thus he drew attention to the function of the entrepreneur and distinguished between the function of the entrepreneur and the owner who provided the money.Jean-Baptiste Say also identified entrepreneurs as a driver for economic development, emphasizing their role as one of the collecting factors of production allocating resources from less to fields that are more productive. Both Say and Cantillon belonged to French school of thought and known as the physiocrats.Dating back to the time of the medieval guilds in Germany, a craftsperson required special permission to operate as an entrepreneur, the small proof of competence (Kleiner Befähigungsnachweis), which restricted training of apprentices to craftspeople who held a Meister certificate. This institution was introduced in 1908 after a period of so-called freedom of trade (Gewerbefreiheit, introduced in 1871) in the German Reich. However, proof of competence was not required to start a business. In 1935 and in 1953, greater proof of competence was reintroduced (Großer Befähigungsnachweis Kuhlenbeck), which required craftspeople to obtain a Meister apprentice-training certificate before being permitted to set up a new business.\n\n\n=== 20th century ===\nIn the 20th century, entrepreneurship was studied by Joseph Schumpeter in the 1930s and other Austrian economists such as Carl Menger, Ludwig von Mises and Friedrich von Hayek. While the loan from French of the word \"entrepreneur\" dates to the 1850, the term \"entrepreneurship\" was coined around the 1920s. According to Schumpeter, an entrepreneur is willing and able to convert a new idea or invention into a successful innovation. Entrepreneurship employs what Schumpeter called \"the gale of creative destruction\" to replace in whole or in part inferior offerings across markets and industries, simultaneously creating new products and new business models, thus creative destruction is largely responsible for long-term economic growth. The idea that entrepreneurship leads to economic growth is an interpretation of the residual in endogenous growth theory and as such continues to be debated in academic economics. An alternative description by Israel Kirzner suggests that the majority of innovations may be incremental improvements such as the replacement of paper with plastic in the construction of a drinking straw that require no special qualities.\nFor Schumpeter, entrepreneurship resulted in new industries and in new combinations of currently existing inputs. Schumpeter's initial example of this was the combination of a steam engine and then current wagon making technologies to produce the horseless carriage. In this case, the innovation (i.e. the car) was transformational, but did not require the development of dramatic new technology. It did not immediately replace the horse-drawn carriage, but in time incremental improvements reduced the cost and improved the technology, leading to the modern auto industry. Despite Schumpeter's early 20th-century contributions, the traditional microeconomic theory did not formally consider the entrepreneur in its theoretical frameworks (instead of assuming that resources would find each other through a price system). In this treatment, the entrepreneur was an implied but unspecified actor, consistent with the concept of the entrepreneur being the agent of x-efficiency.\nFor Schumpeter, the entrepreneur did not bear risk: the capitalist did. Schumpeter believed that the equilibrium was imperfect. Schumpeter (1934) demonstrated that the changing environment continuously provides new information about the optimum allocation of resources to enhance profitability. Some individuals acquire the new information before others and recombine the resources to gain an entrepreneurial profit. Schumpeter was of the opinion that entrepreneurs shift the production possibility curve to a higher level using innovations.Initially, economists made the first attempt to study the entrepreneurship concept in depth. Alfred Marshall viewed the entrepreneur as a multi-tasking capitalist and observed that in the equilibrium of a completely competitive market there was no spot for \"entrepreneurs\" as an economic activity creator.\n\n\n=== 21st century ===\n\nIn the 2000s, entrepreneurship has been extended from its origins in for-profit businesses to include social entrepreneurship, in which business goals are sought alongside social, environmental or humanitarian goals and even the concept of the political entrepreneur. Entrepreneurship within an existing firm or large organization has been referred to as intrapreneurship and may include corporate ventures where large entities \"spin-off\" subsidiary organizations.Entrepreneurs are leaders willing to take risk and exercise initiative, taking advantage of market opportunities by planning, organizing and deploying resources, often by innovating to create new or improving existing products or services. In the 2000s, the term \"entrepreneurship\" has been extended to include a specific mindset resulting in entrepreneurial initiatives, e.g. in the form of social entrepreneurship, political entrepreneurship or knowledge entrepreneurship.\nAccording to Paul Reynolds, founder of the Global Entrepreneurship Monitor, \"by the time they reach their retirement years, half of all working men in the United States probably have a period of self-employment of one or more years; one in four may have engaged in self-employment for six or more years. Participating in a new business creation is a common activity among U.S. workers over the course of their careers\". In recent years, entrepreneurship has been claimed as a major driver of economic growth in both the United States and Western Europe.\nEntrepreneurial activities differ substantially depending on the type of organization and creativity involved. Entrepreneurship ranges in scale from solo, part-time projects to large-scale undertakings that involve a team and which may create many jobs. Many \"high value\" entrepreneurial ventures seek venture capital or angel funding (seed money) in order to raise capital for building and expanding the business. Many organizations exist to support would-be entrepreneurs, including specialized government agencies, business incubators (which may be for-profit, non-profit, or operated by a college or university), science parks and non-governmental organizations, which include a range of organizations including not-for-profits, charities, foundations and business advocacy groups (e.g. Chambers of commerce). Beginning in 2008, an annual \"Global Entrepreneurship Week\" event aimed at \"exposing people to the benefits of entrepreneurship\" and getting them to \"participate in entrepreneurial-related activities\" was launched.\n\n\n=== Relationship between small business and entrepreneurship ===\nThe term \"entrepreneur\" is often conflated with the term \"small business\" or used interchangeably with this term. While most entrepreneurial ventures start out as a small business, not all small businesses are entrepreneurial in the strict sense of the term. Many small businesses are sole proprietor operations consisting solely of the owner—or they have a small number of employees—and many of these small businesses offer an existing product, process or service and they do not aim at growth. In contrast, entrepreneurial ventures offer an innovative product, process or service and the entrepreneur typically aims to scale up the company by adding employees, seeking international sales and so on, a process which is financed by venture capital and angel investments. In this way, the term \"entrepreneur\" may be more closely associated with the term \"startup\". Successful entrepreneurs have the ability to lead a business in a positive direction by proper planning, to adapt to changing environments and understand their own strengths and weakness.\n\n\n== Types of entrepreneurs ==\n\n\n=== Ethnic ===\nThe term \"ethnic entrepreneurship\" refers to self-employed business owners who belong to racial or ethnic minority groups in the United States and Europe. A long tradition of academic research explores the experiences and strategies of ethnic entrepreneurs as they strive to integrate economically into mainstream U.S. or European society. Classic cases include Jewish merchants and tradespeople in large U.S. cities in the 19th and early 20th centuries as well as Chinese and Japanese small business owners (restaurants, farmers, shop owners) on the West Coast. In the 2010s, ethnic entrepreneurship has been studied in the case of Cuban business owners in Miami, Indian motel owners of the U.S. and Chinese business owners in Chinatowns across the United States. While entrepreneurship offers these groups many opportunities for economic advancement, self-employment and business ownership in the United States remain unevenly distributed along racial/ethnic lines. Despite numerous success stories of Asian entrepreneurs, a recent statistical analysis of U.S. census data shows that whites are more likely than Asians, African-Americans and Latinos to be self-employed in high prestige, lucrative industries.\n\n\n=== Institutional ===\nThe American-born British economist Edith Penrose has highlighted the collective nature of entrepreneurship. She mentions that in modern organizations, human resources need to be combined in order to better capture and create business opportunities. The sociologist Paul DiMaggio (1988:14) has expanded this view to say that \"new institutions arise when organized actors with sufficient resources [institutional entrepreneurs] see in them an opportunity to realize interests that they value highly\". The notion has been widely applied.\n\n\n=== Cultural ===\nAccording to Christopher Rea and Nicolai Volland, cultural entrepreneurship is \"practices of individual and collective agency characterized by mobility between cultural professions and modes of cultural production\", which refers to creative industry activities and sectors. In their book The Business of Culture (2015), Rea and Volland identify three types of cultural entrepreneur: \"cultural personalities\", defined as \"individuals who buil[d] their own personal brand of creativity as a cultural authority and leverage it to create and sustain various cultural enterprises\"; \"tycoons\", defined as \"entrepreneurs who buil[d] substantial clout in the cultural sphere by forging synergies between their industrial, cultural, political, and philanthropic interests\"; and \"collective enterprises\", organizations which may engage in cultural production for profit or not-for-profit purposes.\n\n\n=== Feminist ===\nA feminist entrepreneur is an individual who applies feminist values and approaches through entrepreneurship, with the goal of improving the quality of life and well-being of girls and women. Many are doing so by creating \"for women, by women\" enterprises. Feminist entrepreneurs are motivated to enter commercial markets by desire to create wealth and social change, based on the ethics of cooperation, equality and mutual respect.\n\n\n=== Social ===\n\nSocial entrepreneurship is the use of the by start up companies and other entrepreneurs to develop, fund and implement solutions to social, cultural, or environmental issues. This concept may be applied to a variety of organizations with different sizes, aims, and beliefs. For-profit entrepreneurs typically measure performance using business metrics like profit, revenues and increases in stock prices, but social entrepreneurs are either non-profits or blend for-profit goals with generating a positive \"return to society\" and therefore must use different metrics. Social entrepreneurship typically attempts to further broad social, cultural, and environmental goals often associated with the voluntary sector in areas such as poverty alleviation, health care and community development. At times, profit-making social enterprises may be established to support the social or cultural goals of the organization but not as an end in itself. For example, an organization that aims to provide housing and employment to the homeless may operate a restaurant, both to raise money and to provide employment for the homeless people.\n\n\n=== Nascent ===\nA nascent entrepreneur is someone in the process of establishing a business venture. In this observation, the nascent entrepreneur can be seen as pursuing an opportunity, i.e. a possibility to introduce new services or products, serve new markets, or develop more efficient production methods in a profitable manner. But before such a venture is actually established, the opportunity is just a venture idea. In other words, the pursued opportunity is perceptual in nature, propped by the nascent entrepreneur's personal beliefs about the feasibility of the venturing outcomes the nascent entrepreneur seeks to achieve. Its prescience and value cannot be confirmed ex ante but only gradually, in the context of the actions that the nascent entrepreneur undertakes towards establishing the venture, Ultimately, these actions can lead to a path that the nascent entrepreneur deems no longer attractive or feasible, or result in the emergence of a (viable) business. In this sense, over time, the nascent venture can move towards being discontinued or towards emerging successfully as an operating entity.\nThe distinction between the novice, serial and portfolio entrepreneurs is an example of behavior-based categorization. Other examples are the (related) studies by, on start-up event sequences.  Nascent entrepreneurship that emphasizes the series of activities involved in new venture emergence, rather than the solitary act of exploiting an opportunity. Such research will help separate entrepreneurial action into its basic sub-activities and elucidate the inter- relationships between activities, between an activity (or sequence of activities) and an individual's motivation to form an opportunity belief, and between an activity (or sequence of activities) and the knowledge needed to form an opportunity belief. With this research, scholars will be able to begin constructing a theory of the micro-foundations of entrepreneurial action.\nScholars interested in nascent entrepreneurship tend to focus less on the single act of opportunity exploitation and more on the series of actions in new venture emergence,,. Indeed, nascent entrepreneurs undertake numerous entrepreneurial activities, including actions that make their businesses more concrete to themselves and others. For instance, nascent entrepreneurs often look for and purchase facilities and equipment; seek and obtain financial backing, form legal entities, organize teams; and dedicate all their time and energy to their business\n\n\n=== Project-based ===\nProject entrepreneurs are individuals who are engaged in the repeated assembly or creation of temporary organizations. These are organizations that have limited lifespans which are devoted to producing a singular objective or goal and get disbanded rapidly when the project ends. Industries where project-based enterprises are widespread include: sound recording, film production, software development, television production, new media and construction. What makes project-entrepreneurs distinctive from a theoretical standpoint is that they have to \"rewire\" these temporary ventures and modify them to suit the needs of new project opportunities that emerge. A project entrepreneur who used a certain approach and team for one project may have to modify the business model or team for a subsequent project.\nProject entrepreneurs are exposed repeatedly to problems and tasks typical of the entrepreneurial process. Indeed, project-entrepreneurs face two critical challenges that invariably characterize the creation of a new venture: locating the right opportunity to launch the project venture and assembling the most appropriate team to exploit that opportunity. Resolving the first challenge requires project-entrepreneurs to access an extensive range of information needed to seize new investment opportunities. Resolving the second challenge requires assembling a collaborative team that has to fit well with the particular challenges of the project and has to function almost immediately to reduce the risk that performance might be adversely affected. Another type of project entrepreneurship involves entrepreneurs working with business students to get analytical work done on their ideas.\n\n\n=== Millennial ===\nThe term \"millennial entrepreneur\" refers to a business owner who is affiliated with the generation that was brought up using digital technology and mass media—the products of Baby Boomers, those people born during the 1980s and early 1990s. Also known as Generation Y, these business owners are well equipped with knowledge of new technology and new business models and have a strong grasp of its business applications. There have been many breakthrough businesses that have come from millennial entrepreneurs such as Mark Zuckerberg, who created Facebook. Despite the expectation of millennial success, there have been recent studies that have proven this to not be the case.  The comparison between millennials who are self-employed and those who are not self-employed shows that the latter is higher. The reason for this is because they have grown up in a different generation and attitude than their elders. Some of the barriers to entry for entrepreneurs are the economy, debt from schooling and the challenges of regulatory compliance.\n\n\n== Entrepreneurial behaviors ==\nThe entrepreneur is commonly seen as an innovator—a designer of new ideas and business processes. Management skills and strong team building abilities are often perceived as essential leadership attributes for successful entrepreneurs. Political economist Robert Reich considers leadership, management ability and team-building to be essential qualities of an entrepreneur.\n\n\n=== Uncertainty perception and risk-taking ===\nTheorists Frank Knight and Peter Drucker defined entrepreneurship in terms of risk-taking. The entrepreneur is willing to put his or her career and financial security on the line and take risks in the name of an idea, spending time as well as capital on an uncertain venture. However, entrepreneurs often do not believe that they have taken an enormous amount of risks because they do not perceive the level of uncertainty to be as high as other people do. Knight classified three types of uncertainty:\n\nRisk, which is measurable statistically (such as the probability of drawing a red color ball from a jar containing five red balls and five white balls)\nAmbiguity, which is hard to measure statistically (such as the probability of drawing a red ball from a jar containing five red balls but an unknown number of white balls)\nTrue uncertainty or Knightian uncertainty, which is impossible to estimate or predict statistically (such as the probability of drawing a red ball from a jar whose contents, in terms of numbers of coloured balls, are entirely unknown)\nEntrepreneurship is often associated with true uncertainty, particularly when it involves the creation of a novel good or service, for a market that did not previously exist, rather than when a venture creates an incremental improvement to an existing product or service. A 2014 study at ETH Zürich found that compared with typical managers, entrepreneurs showed higher decision-making efficiency and a stronger activation in regions of frontopolar cortex (FPC) previously associated with explorative choice.\n\n\n=== \"Coachability\" and advice taking ===\nThe ability of entrepreneurs to work closely with and take advice from early investors and other partners (i.e. their coachability) has long been considered a critical factor in entrepreneurial success. At the same time, economists have argued that entrepreneurs should not simply act on all advice given to them, even when that advice comes from well-informed sources, because entrepreneurs possess far deeper and richer local knowledge about their own firm than any outsider. Indeed, measures of coachability are not actually predictive of entrepreneurial success (e.g. measured as success in subsequent funding rounds, acquisitions, pivots and firm survival). This research also shows that older and larger founding teams, presumably those with more subject expertise, are less coachable than younger and smaller founding teams.\n\n\n=== Strategies ===\nStrategies that entrepreneurs may use include:\n\nInnovation of new products, services or processes\nContinuous process improvement (CPI)\nExploration of new business models\nUse of technology\nUse of business intelligence\nUse of economical strategics\nDevelopment of future products and services\nOptimized talent management\n\n\n=== Designing individual/opportunity nexus ===\nAccording to Shane and Venkataraman, entrepreneurship comprises both \"enterprising individuals\" and \"entrepreneurial opportunities\", so researchers should study the nature of the individuals who identify opportunities when others do not, the opportunities themselves and the nexus between individuals and opportunities. On the other hand, Reynolds et al. argue that individuals are motivated to engage in entrepreneurial endeavors driven mainly by necessity or opportunity, that is individuals pursue entrepreneurship primarily owing to survival needs, or because they identify business opportunities that satisfy their need for achievement. For example, higher economic inequality tends to increase necessity-based entrepreneurship rates at the individual level.\n\n\n=== Opportunity perception and biases ===\nThe ability of entrepreneurs to innovate relates to innate traits, including extroversion and a proclivity for risk-taking. According to Joseph Schumpeter, the capabilities of innovating, introducing new technologies, increasing efficiency and productivity, or generating new products or services, are characteristic qualities of entrepreneurs. One study has found that certain genes affecting personality may influence the income of self-employed people. Some people may be able to use \"an innate ability\" or quasi-statistical sense to gauge public opinion and market demand for new products or services. Entrepreneurs tend to have the ability to see unmet market needs and underserved markets. While some entrepreneurs assume they can sense and figure out what others are thinking, the mass media plays a crucial role in shaping views and demand. Ramoglou argues that entrepreneurs are not that distinctive and that it is essentially poor conceptualizations of \"non-entrepreneurs\" that maintain laudatory portraits of \"entrepreneurs\" as exceptional innovators or leaders  Entrepreneurs are often overconfident, exhibit illusion of control, when they are opening/expanding business or new products/services.\n\n\n=== Styles ===\nDifferences in entrepreneurial organizations often partially reflect their founders' heterogenous identities. Fauchart and Gruber have classified entrepreneurs into three main types: Darwinians, communitarians and missionaries. These types of entrepreneurs diverge in fundamental ways in their self-views, social motivations and patterns of new firm creation.\n\n\n=== Communication ===\nEntrepreneurs need to practice effective communication both within their firm and with external partners and investors in order to launch and grow a venture and enable it to survive. An entrepreneur needs a communication system that links the staff of her firm and connects the firm to outside firms and clients. Entrepreneurs should be charismatic leaders, so they can communicate a vision effectively to their team and help to create a strong team. Communicating a vision to followers may be well the most important act of the transformational leader. Compelling visions provide employees with a sense of purpose and encourage commitment. According to Baum et al. and Kouzes and Posner, the vision must be communicated through written statements and through in-person communication. Entrepreneurial leaders must speak and listen to articulate their vision to others.Communication is pivotal in the role of entrepreneurship because it enables leaders to convince potential investors, partners and employees about the feasibility of a venture. Entrepreneurs need to communicate effectively to shareholders. Nonverbal elements in speech such as the tone of voice, the look in the sender's eyes, body language, hand gestures and state of emotions are also important communication tools. The Communication Accommodation Theory posits that throughout communication people will attempt to accommodate or adjust their method of speaking to others. Face Negotiation Theory describes how people from different cultures manage conflict negotiation in order to maintain \"face\". Hugh Rank's \"intensify and downplay\" communications model can be used by entrepreneurs who are developing a new product or service. Rank argues that entrepreneurs need to be able to intensify the advantages of their new product or service and downplay the disadvantages in order to persuade others to support their venture.\n\n\n==== Links to sea piracy ====\nResearch from 2014 found links between entrepreneurship and historical sea piracy. In this context, the claim is made for a non-moral approach to looking at the history of piracy as a source of inspiration for entrepreneurship education as well as for research in entrepreneurship and business model generation.\n\n\n== Psychological makeup ==\n\nStanford University economist Edward Lazear found in a 2005 study that variety in education and work experience was the most important trait that distinguished entrepreneurs from non-entrepreneurs A 2013 study by Uschi Backes-Gellner of the University of Zurich and Petra Moog of the University of Siegen in Germany found that a diverse social network was also important in distinguishing students that would go on to become entrepreneurs.Studies show that the psychological propensities for male and female entrepreneurs are more similar than different. Empirical studies suggest that female entrepreneurs possess strong negotiating skills and consensus-forming abilities. Asa Hansson, who looked at empirical evidence from Sweden, found that the probability of becoming self-employed decreases with age for women, but increases with age for men. She also found that marriage increased the probability of a person becoming an entrepreneur.Jesper Sørensen wrote that significant influences on the decision to become an entrepreneur are workplace peers and social composition. Sørensen discovered a correlation between working with former entrepreneurs and how often these individuals become entrepreneurs themselves, compared to those who did not work with entrepreneurs. Social composition can influence entrepreneurialism in peers by demonstrating the possibility for success, stimulating a \"He can do it, why can't I?\" attitude. As Sørensen stated: \"When you meet others who have gone out on their own, it doesn't seem that crazy\".Entrepreneurs may also be driven to entrepreneurship by past experiences. If they have faced multiple work stoppages or have been unemployed in the past, the probability of them becoming an entrepreneur increases Per Cattell's personality framework, both personality traits and attitudes are thoroughly investigated by psychologists. However, in case of entrepreneurship research these notions are employed by academics too, but vaguely. According to Cattell, personality is a system that is related to the environment and further adds that the system seeks explanation to the complex transactions conducted by both—traits and attitudes. This is because both of them bring about change and growth in a person. Personality is that which informs what an individual will do when faced with a given situation. A person's response is triggered by his/her personality and the situation that is faced.Innovative entrepreneurs may be more likely to experience what psychologist Mihaly Csikszentmihalyi calls \"flow\". \"Flow\" occurs when an individual forgets about the outside world due to being thoroughly engaged in a process or activity. Csikszentmihalyi suggested that breakthrough innovations tend to occur at the hands of individuals in that state. Other research has concluded that a strong internal motivation is a vital ingredient for breakthrough innovation. Flow can be compared to Maria Montessori's concept of normalization, a state that includes a child's capacity for joyful and lengthy periods of intense concentration. Csikszentmihalyi acknowledged that Montessori's prepared environment offers children opportunities to achieve flow. Thus quality and type of early education may influence entrepreneurial capability.\nResearch on high-risk settings such as oil platforms, investment banking, medical surgery, aircraft piloting and nuclear power plants has related distrust to failure avoidance. When non-routine strategies are needed, distrusting persons perform better while when routine strategies are needed trusting persons perform better. This research was extended to entrepreneurial firms by Gudmundsson and Lechner. They argued that in entrepreneurial firms the threat of failure is ever present resembling non-routine situations in high-risk settings. They found that the firms of distrusting entrepreneurs were more likely to survive than the firms of optimistic or overconfident entrepreneurs. The reasons were that distrusting entrepreneurs would emphasize failure avoidance through sensible task selection and more analysis. Kets de Vries has pointed out that distrusting entrepreneurs are more alert about their external environment. He concluded that distrusting entrepreneurs are less likely to discount negative events and are more likely to engage control mechanisms. Similarly, Gudmundsson and Lechner found that distrust leads to higher precaution and therefore increases chances of entrepreneurial firm survival.\nResearchers Schoon and Duckworth completed a study in 2012 that could potentially help identify who may become an entrepreneur at an early age. They determined that the best measures to identify a young entrepreneur are family and social status, parental role modeling, entrepreneurial competencies at age 10, academic attainment at age 10, generalized self-efficacy, social skills, entrepreneurial intention and experience of unemployment.\n\n\n=== Strategic ===\nSome scholars have constructed an operational definition of a more specific subcategory called \"Strategic Entrepreneurship\". Closely tied with principles of strategic management, this form of entrepreneurship is \"concerned about growth, creating value for customers and subsequently creating wealth for owners\". A 2011 article for the Academy of Management provided a three-step, \"Input-Process-Output\" model of strategic entrepreneurship. The model's three steps entail the collection of different resources, the process of orchestrating them in the necessary manner and the subsequent creation of competitive advantage, value for customers, wealth and other benefits. Through the proper use of strategic management/leadership techniques and the implementation of risk-bearing entrepreneurial thinking, the strategic entrepreneur is therefore able to align resources to create value and wealth.\n\n\n=== Leadership ===\nLeadership in entrepreneurship can be defined as \"process of social influence in which one person can enlist the aid and support of others in the accomplishment of a common task\" in \"one who undertakes innovations, finance and business acumen in an effort to transform innovations into economic goods\". This refers to not only the act of entrepreneurship as managing or starting a business, but how one manages to do so by these social processes, or leadership skills. Entrepreneurship in itself can be defined as \"the process by which individuals, teams, or organizations identify and pursue entrepreneurial opportunities without being immediately constrained by the resources they currently control\". An entrepreneur typically has a mindset that seeks out potential opportunities during uncertain times. An entrepreneur must have leadership skills or qualities  to see potential opportunities and act upon them. At the core, an entrepreneur is a decision maker. Such decisions often affect an organization as a whole, which is representative of their leadership amongst the organization.\nWith the growing global market and increasing technology use throughout all industries, the core of entrepreneurship and the decision-making has become an ongoing process rather than isolated incidents. This becomes knowledge management which is \"identifying and harnessing intellectual assets\" for organizations to \"build on past experiences and create new mechanisms for exchanging and creating knowledge\". This belief draws upon a leader's past experiences that may prove useful. It is a common mantra for one to learn from their past mistakes, so leaders should take advantage of their failures for their benefit. This is how one may take their experiences as a leader for the use in the core of entrepreneurship-decision making.\n\n\n=== Global leadership ===\nThe majority of scholarly research done on these topics have been from North America. Words like \"leadership\" and \"entrepreneurship\" do not always translate well into other cultures and languages. For example, in North America a leader is often thought to be charismatic, but German culture frowns on such charisma due to the charisma of Nazi leader Adolf Hitler. Other cultures, like some European countries, view the term \"leader\" negatively, like the French. The participative leadership style that is encouraged in the United States is considered disrespectful in many other parts of the world due to the differences in power distance. Many Asian and Middle Eastern countries do not have \"open door\" policies for subordinates and would never informally approach their managers/bosses. For countries like that, an authoritarian approach to management and leadership is more customary.\nDespite cultural differences, the successes and failures of entrepreneurs can be traced to how leaders adapt to local conditions. With the increasingly global business environment a successful leader must be able to adapt and have insight into other cultures. To respond to the environment, corporate visions are becoming transnational in nature, to enable the organization to operate in or provide services/goods for other cultures.\n\n\n== Entrepreneurship training and education ==\nMichelacci and Schivardi are a pair of researchers who believe that identifying and comparing the relationships between an entrepreneur's earnings and education level would determine the rate and level of success. Their study focused on two education levels, college degree and post-graduate degree. While Michelacci and Schivardi do not specifically determine characteristics or traits for successful entrepreneurs, they do believe that there is a direct relationship between education and success, noting that having a college knowledge does contribute to advancement in the workforce.\nMichelacci and Schivardi state there has been a rise in the number of self-employed people with a baccalaureate degree. However, their findings also show that those who are self-employed and possess a graduate degree has remained consistent throughout time at about 33 percent. They briefly mention those famous entrepreneurs like Steve Jobs and Mark Zuckerberg who were college dropouts, but they call these cases all but exceptional as it is a pattern that many entrepreneurs view formal education as costly, mainly because of the time that needs to be spent on it. Michelacci and Schivardi believe that in order for an individual to reach the full success they need to have education beyond high school. Their research shows that the higher the education level the greater the success. The reason is that college gives people additional skills that can be used within their business and to operate on a higher level than someone who only \"runs\" it.\n\n\n== Resources and financing ==\n\n\n=== Entrepreneurial resources ===\nAn entrepreneurial resource is any company-owned asset that has economic value creating capabilities. Economic value creating both tangible and intangible sources are considered as entrepreneurial resources. Their economic value is generating activities or services through mobilization by entrepreneurs. Entrepreneurial resources can be divided into two fundamental categories: tangible and intangible resources.Tangible resources are material sources such as equipment, building, furniture, land, vehicle, machinery, stock, cash, bond and inventory that has a physical form and can be quantified. On the contrary, intangible resources are nonphysical or more challenging to identify and evaluate, and they possess more value creating capacity such as human resources including skills and experience in a particular field, organizational structure of the company, brand name, reputation, entrepreneurial networks that contribute to promotion and financial support, know-how, intellectual property including both copyrights, trademarks and patents.\n\n\n=== Bootstrapping ===\nAt least early on, entrepreneurs often \"bootstrap-finance\" their start-up rather than seeking external investors from the start. One of the reasons that some entrepreneurs prefer to \"bootstrap\" is that obtaining equity financing requires the entrepreneur to provide ownership shares to the investors. If the start-up becomes successful later on, these early equity financing deals could provide a windfall for the investors and a huge loss for the entrepreneur. If investors have a significant stake in the company, they may as well be able to exert influence on company strategy, chief executive officer (CEO) choice and other important decisions. This is often problematic since the investor and the founder might have different incentives regarding the long-term goal of the company. An investor will generally aim for a profitable exit and therefore promotes a high-valuation sale of the company or IPO in order to sell their shares. Whereas the entrepreneur might have philanthropic intentions as their main driving force. Soft values like this might not go well with the short-term pressure on yearly and quarterly profits that publicly traded companies often experience from their owners.\nOne consensus definition of bootstrapping sees it as \"a collection of methods used to minimize the amount of outside debt and equity financing needed from banks and investors\". The majority of businesses require less than $10,000 to launch, which means that personal savings are most often used to start. In addition, bootstrapping entrepreneurs often incur personal credit-card debt, but they also can utilize a wide variety of methods. While bootstrapping involves increased personal financial risk for entrepreneurs, the absence of any other stakeholder gives the entrepreneur more freedom to develop the company.\nBootstrapping methods include:\nOwner financing, including savings, personal loans and credit card debt\nWorking capital management that minimizes accounts receivable\nJoint utilization, such as reducing overhead by coworking or using independent contractors\nIncreasing accounts payable by delaying payment, or leasing rather than buying equipment\nLean manufacturing strategies such as minimizing inventory and lean startup to reduce product development costs\nSubsidy finance\n\n\n=== Additional financing ===\nMany businesses need more capital than can be provided by the owners themselves. In this case, a range of options is available including a wide variety of private and public equity, debt and grants. Private equity options include:\n\nStartup accelerators\nAngel investors\nVenture capital investors\nEquity crowdfunding\nHedge fundsDebt options open to entrepreneurs include:\n\nLoans from banks, financial technology companies and economic development organizations\nLine of credit also from banks and financial technology companies\nMicrocredit also known as microloans\nMerchant cash advance\nRevenue-based financingGrant options open to entrepreneurs include:\n\nEquity-free accelerators\nBusiness plan/business pitch competitions for college entrepreneurs and others\nSmall Business Innovation Research grants from the U.S. government\n\n\n=== Effect of taxes ===\nEntrepreneurs are faced with liquidity constraints and often lack the necessary credit needed to borrow large amounts of money to finance their venture. Because of this, many studies have been done on the effects of taxes on entrepreneurs. The studies fall into two camps: the first camp finds that taxes help and the second argues that taxes hurt entrepreneurship.\nCesaire Assah Meh found that corporate taxes create an incentive to become an entrepreneur to avoid double taxation. Donald Bruce and John Deskins found literature suggesting that a higher corporate tax rate may reduce a state's share of entrepreneurs. They also found that states with an inheritance or estate tax tend to have lower entrepreneurship rates when using a tax-based measure. However, another study found that states with a more progressive personal income tax have a higher percentage of sole proprietors in their workforce. Ultimately, many studies find that the effect of taxes on the probability of becoming an entrepreneur is small. Donald Bruce and Mohammed Mohsin found that it would take a 50 percentage point drop in the top tax rate to produce a one percent change in entrepreneurial activity.\n\n\n== Predictors of success ==\n\nFactors that may predict entrepreneurial success include the following:\nMethodsEstablishing strategies for the firm, including growth and survival strategies\nMaintaining the human resources (recruiting and retaining talented employees and executives)\nEnsuring the availability of required materials (e.g. raw resources used in manufacturing, computer chips, etc.)\nEnsuring that the firm has one or more unique competitive advantages\nEnsuring good organizational design, sound governance and organizational coordination\nCongruency with the culture of the societyMarketBusiness-to-business (B2B) or business-to-consumer (B2C) models can be used\nHigh growth market\nTarget customers or markets that are untapped or missed by othersIndustryGrowing industry\nHigh technology impact on the industry\nHigh capital intensity\nSmall average incumbent firm sizeTeamLarge, gender-diverse and racially diverse team with a range of talents, rather than an individual entrepreneur\nGraduate degrees\nManagement experience prior to start-up\nWork experience in the start-up industry\nEmployed full-time prior to new venture as opposed to unemployed\nPrior entrepreneurial experience\nFull-time involvement in the new venture\nMotivated by a range of goals, not just profit\nNumber and diversity of team members' social ties and breadth of their business networksCompanyWritten business plan\nFocus on a unified, connected product line or service line\nCompetition based on a dimension other than price (e.g. quality or service)\nEarly, frequent intense and well-targeted marketing\nTight financial controls\nSufficient start-up and growth capital\nCorporation model, not sole proprietorshipStatusWealth can enable an entrepreneur to cover start-up costs and deal with cash flow challenges\nDominant race, ethnicity or gender in a socially stratified culture\n\n\n== See also ==\n\n Entrepreneurship – Wikipedia book\n\n\n== References ==\n\n\n== Bibliography ==\nDeakins, D.; Freel, M. S. (2009). \"Entrepreneurial activity, the economy and the importance of small firms\". Entrepreneurship and small firms. McGraw-Hill Education. ISBN 978-0-07-712162-4.\nMiller, K. (2005). Communication theories: perspectives, processes, and contexts (2nd ed.). New York, NY: McGraw-Hill.\nScheufele, D.; Moy, P. (2000). \"Twenty-five years of the spiral of silence: A conceptual review and empirical outlook\". International Journal of Public Opinion Research. 12 (1): 3–28. doi:10.1093/ijpor/12.1.3. ISSN 0954-2892.\n\n\n== Further reading ==\nBlackburn, Robert (2008). Small Business and Entrepreneurship. doi:10.4135/9781446263433. ISBN 9781412934374.\nBowman, Erik (July 2011). Entrepreneur Training Manual, Third Edition: Certified Entrepreneur Workbook. Guanzi Institute Press. ISBN 978-0-9837862-9-0.\nBruder, Jessica (September 2013). \"The Psychological Price of Entrepreneurship.\" Inc. (Winner 2014 Annual Awards Contest of the Deadline Club)\nDana, Leo Paul 2010, \"Nunavik, Arctic Quebec: Where Co-operatives Supplement Entrepreneurship,\" Global Business and Economics Review 12 (1/2), January 2010, pp. 42–71.\nDuening, Thomas N.; Hisrich, Robert A.; Lechter, Michael A. (21 October 2009). Technology Entrepreneurship: Creating, Capturing, and Protecting Value. Academic Press. ISBN 978-0-08-092288-1.\nFoo, M.D. (2011). \"Emotions and entrepreneurial opportunity evaluation\". Entrepreneurship Theory and Practice. 35 (2): 375–393. doi:10.1111/j.1540-6520.2009.00357.x.\nJames W. Halloran. (2014). Your Small Business Adventure: Finding Your Niche and Growing a Successful Business. ALA/Huron Street Press. ISBN 978-1-937589-44-8.\nLeitão, João; Baptista, Rui (10 June 2009). Public Policies for Fostering Entrepreneurship: A European Perspective. Springer Science Business Media. ISBN 978-1-4419-0249-8.\nLundstrom, Anders; Stevenson, Lois A. (30 March 2005). Entrepreneurship Policy: Theory and Practice. Springer. ISBN 978-0-387-24140-1.\nMinniti, M.; Moren, L. (2010). \"Entrepreneurial types and economic growth\". Journal of Business Venturing. 25 (3): 305–314. doi:10.1016/j.jbusvent.2008.10.002.\nRea, Christopher; Volland, Nicolai (2015). The Business of Culture: Cultural Entrepreneurs in China and Southeast Asia, 1900-65. UBC Press. ISBN 9780774827829.\nShane, S.; Venkataraman, S. (2000). \"The Promise of Entrepreneurship as A Field of Research\". Academy of Management Review. 25 (1): 217–226. doi:10.5465/amr.2000.2791611. JSTOR 259271.\nShane, S. (2013). \"The genetics of entrepreneurial performance\". International Small Business Journal. 31 (5): 473–495. doi:10.1177/0266242613485767.\nZahra, Shaker A. (2009). \"A typology of social entrepreneurs: Motives, search processes and ethical challenges\". Journal of Business Venturing. 24 (5): 519–532. doi:10.1016/j.jbusvent.2008.04.007.\nZhang, S.X.; Cueto, J. (2015). \"The Study of Bias in Entrepreneurship\". Entrepreneurship Theory and Practice. 41 (3): 419–454. doi:10.1111/etap.12212.\nRobin Lowe; Sue Marriott (June 2006). Enterprise: Entrepreneurship and Innovation: Concepts, Contexts and Commercialization. Butterworth-Heinemann. ISBN 978-0750669207."}