{"text": "An online game is a video game that is either partially or primarily played through the Internet or any other computer network available. Online games are ubiquitous on modern gaming platforms, including PCs, consoles and mobile devices, and span many genres, including first-person shooters, strategy games and massively multiplayer online role-playing games (MMORPG).The design of online games can range from simple text-based environments to the incorporation of complex graphics and virtual worlds. The existence of online components within a game can range from being minor features, such as an online leaderboard, to being part of core gameplay, such as directly playing against other players. Many online games create their own online communities, while other games, especially social games, integrate the players' existing real-life communities.The culture of online gaming sometimes faces criticisms for an environment that can promote cyberbullying, violence, and xenophobia. Some are also concerned about gaming addiction or social stigma. Online games have attracted players from a variety of ages, nationalities, and occupations. The online game content can also be studied in the scientific field, especially gamers' interactions within virtual societies in relation to the behavior and social phenomena of everyday life. It has been argued that, since the players of an online game are strangers to each other and have limited communication, the individual player's experience in an online game is not essentially different from playing with artificial intelligence players. Online games also have the problem of not being permanently playable, unlike purchased retail games, as they require special servers in order to function.\n\n\n== History ==\n\nThe history of online games dates back to the early days of packet-based computer networking in the 1970s, An early example of online games are MUDs, including the first, MUD1, which was created in 1978 and originally confined to an internal network before becoming connected to ARPANet in 1980. Commercial games followed in the next decade, with Islands of Kesmai, the first commercial online role-playing game, debuting in 1984, as well as more graphical games, such as the MSX LINKS action games in 1986, the flight simulator Air Warrior in 1987, and the Famicom Modem's online Go game in 1987. The rapid availability of the Internet in the 1990s led to an expansion of online games, with notable titles including Nexus: The Kingdom of the Winds (1996), Quakeworld (1996), Ultima Online (1997), Lineage (1998), Starcraft (1998), Counter-Strike (1999) and EverQuest (1999). Video game consoles also began to receive online networking features, such as the Famicom Modem (1987), Sega Meganet (1990), Satellaview (1995), SegaNet (1996), PlayStation 2 (2000) and Xbox (2001). Following improvements in connection speeds, more recent developments include the popularization of new genres, such as social games, and new platforms, such as mobile games.\n\n\n== Demographics ==\nThe assumption that online games in general are populated mostly by males has remained somewhat accurate for years. Recent statistics begin to diminish the male domination myth in gaming culture. Although a worldwide number of male gamers still dominates over female (52% by 48%), women accounted for more than half of the players of certain games.\nThe report Online Game Market Forecasts estimates worldwide revenue from online games to reach $35 billion by 2017, up from $19 billion in 2011.\n\n\n== Online games ==\n\n\n=== First-person shooter game (FPS) ===\n\nDuring the 1990s, online games started to move from a wide variety of LAN protocols (such as IPX) and onto the Internet using the TCP/IP protocol. Doom popularized the concept of a deathmatch, where multiple players battle each other head-to-head, as a new form of online game. Since Doom, many first-person shooter games contain online components to allow deathmatch or arena style play. And by popularity, first person shooter games are becoming more and more widespread around the world. The kind of games that are played at the more popular competitions are Counter-Strike, Halo, Call of Duty: Advanced Warfare, Quake Live and Unreal Tournament. Competitions have a range of winnings from money to hardware.\nExpansion of hero shooters, a sub-genre of shooter games, happened in 2016 when several developers released or announced their hero shooter multiplayer online game (Battleborn, Overwatch, and Paladins).\n\n\n=== Real-time strategy game (RTS) ===\n\nEarly real-time strategy games often allowed multiplayer play over a modem or local network. As the Internet started to grow during the 1990s, software was developed that would allow players to tunnel the LAN protocols used by the games over the Internet. By the late 1990s, most RTS games had native Internet support, allowing players from all over the globe to play with each other. Popular RTS games with online communities have included Age of Empires, Sins of a Solar Empire, StarCraft and Warhammer 40,000: Dawn of War.\n\n\n=== Multiplayer online battle arena game (MOBA) ===\n\nA specific subgenre of strategy video games referred to as multiplayer online battle arena (MOBA) gained popularity in the 2010s as a form of electronic sports, encompassing games such as the Defense of the Ancients mod for Warcraft III, its Valve-developed sequel Dota 2, League of Legends, Heroes of the Storm, and Smite.\n\n\n=== Massively multiplayer online game (MMO) ===\n\nMassively multiplayer online games were made possible with the growth of broadband Internet access in many developed countries, using the Internet to allow hundreds of thousands of players to play the same game together. Many different styles of massively multiplayer games are available, such as:\n\nMMORPG (Massively multiplayer online role-playing game)\nMMORTS (Massively multiplayer online real-time strategy)\nMMOFPS (Massively multiplayer online first-person shooter)\nMMOSG (Massively multiplayer online social game)\n\n\n=== Console gaming ===\n\nXbox Live was launched in November 2002. Initially the console only used a feature called system link, where players could connect two consoles using an Ethernet cable, or multiple consoles through a router. With the original Xbox Microsoft launched Xbox Live, allowing shared play over the internet. A similar feature exists on the PlayStation 3 in the form of the PlayStation Network, and the Wii also supports a limited amount of online gaming. Nintendo also has a network, dubbed \"Nintendo Network\", that fully supports online gaming with the Wii U and 3DS consoles.\n\n\n=== Browser games ===\n\nAs the World Wide Web developed and browsers became more sophisticated, people started creating browser games that used a web browser as a client. Simple single player games were made that could be played using a web browser via HTML and HTML scripting technologies (most commonly JavaScript, ASP, PHP and MySQL).\nThe development of web-based graphics technologies such as Flash and Java allowed browser games to become more complex. These games, also known by their related technology as \"Flash games\" or \"Java games\", became increasingly popular. Browser-based pet games are popular among the younger generation of online gamers. These games range from gigantic games with millions of users, such as Neopets, to smaller and more community-based pet games.\nMore recent browser-based games use web technologies like Ajax to make more complicated multiplayer interactions possible and WebGL to generate hardware-accelerated 3D graphics without the need for plugins.\n\n\n=== MUD ===\n\nMUD are a class of multi-user real-time virtual worlds, usually but not exclusively text-based, with a history extending back to the creation of MUD1 by Richard Bartle in 1978. MUD were the direct predecessors of MMORPG.\n\n\n=== Player versus environment (PvE) ===\n\nPvE is a term used in online games, particularly MMORPGs and other role-playing video games, to refer to fighting computer-controlled opponents.\n\n\n=== Player versus player (PvP) ===\n\nPvP is a term broadly used to describe any game, or aspect of a game, where players compete against each other rather than against computer-controlled opponents.\n\n\n=== Battle Royale games ===\n\nA battle royale game is a genre that blends the survival, exploration and scavenging elements of a survival game with last-man-standing gameplay.\n\n\n== Online game governance ==\nOnline gamers must agree to an End-user license agreement (EULA) when they first install the game application or an update. EULA is a legal contract between the producer or distributor and the end-user of an application or software, which is to prevent the program from being copied, redistributed or hacked. The consequences of breaking the agreement vary according to the contract. Players could receive warnings to termination, or direct termination without warning. In the 3D immersive world Second Life where a breach of contract will append the player warnings, suspension and termination depending on the offense.Where online games supports an in-game chat feature, it is not uncommon to encounter hate speech, sexual harassment and cyberbullying. Players, developers, gaming companies, and professional observers are discussing and developing tools which discourage antisocial behavior.\nThere are also sometimes Moderators present, who attempt to prevent anti-Social behavior.\nRecent development of gaming governance requires all video games (including online games) to hold a rating label. The voluntary rating system was established by the Entertainment Software Rating Board (ESRB). A scale can range from \"E\" (stands for Everyone) inferring games that are suitable for both children and adults, to \"M\" (stands for Mature) recommending games that are restricted to age above 17. Some explicit online game can be rated \"AO\" (stands for Adult Only), identifying games that have content suitable for only adults over the age of 18.  Furthermore, online games must also carry an ESRB notice that warns that any \"online interactions are not rated by the ESRB\".\n\n\n== See also ==\n\n\n== References =="}