{"text": "A video game is an electronic game that involves interaction with a user interface to generate visual feedback on a two- or three-dimensional video display device such as a TV screen, virtual reality headset or computer monitor. Since the 1980s, video games have become an increasingly important part of the entertainment industry, and whether they are also a form of art is a matter of dispute.\nThe electronic systems used to play video games are called platforms. Video games are developed and released for one or several platforms and may not be available on others. Specialized platforms such as arcade games, which present the game in a large, typically coin-operated chassis, were common in the 1980s in video arcades, but declined in popularity as other, more affordable platforms became available. These include dedicated devices such as video game consoles, as well as general-purpose computers like a laptop, desktop or handheld computing devices.\nThe input device used for games, the game controller, varies across platforms. Common controllers include gamepads, joysticks, mouse devices, keyboards, the touchscreens of mobile devices, or even a person's body, using a Kinect sensor. Players view the game on a display device such as a television or computer monitor or sometimes on virtual reality head-mounted display goggles. There are often game sound effects, music and voice actor lines which come from loudspeakers or headphones. Some games in the 2000s include haptic, vibration-creating effects, force feedback peripherals and virtual reality headsets.\nIn the 2010s, the commercial importance of the video game industry is increasing. The emerging Asian markets and mobile games on smartphones in particular are driving the growth of the industry. As of 2018, video games generated sales of US$134.9 billion annually worldwide, and were the third-largest segment in the U.S. entertainment market, behind broadcast and cable TV.\n\n\n== History ==\n\nEarly games used interactive electronic devices with various display formats. The earliest example is from 1947—a \"Cathode ray tube Amusement Device\" was filed for a patent on 25 January 1947, by Thomas T. Goldsmith Jr. and Estle Ray Mann, and issued on 14 December 1948, as U.S. Patent 2455992. Inspired by radar display technology, it consisted of an analog device that allowed a user to control a vector-drawn dot on the screen to simulate a missile being fired at targets, which were drawings fixed to the screen. Other early examples include: The Nimrod computer at the 1951 Festival of Britain; OXO a tic-tac-toe Computer game by Alexander S. Douglas for the EDSAC in 1952; Tennis for Two, an electronic interactive game engineered by William Higinbotham in 1958; Spacewar!, written by MIT students Martin Graetz, Steve Russell, and Wayne Wiitanen's on a DEC PDP-1 computer in 1961; and the hit ping pong-style Pong, a 1972 game by Atari. Each game used different means of display: NIMROD used a panel of lights to play the game of Nim, OXO used a graphical display to play tic-tac-toe Tennis for Two used an oscilloscope to display a side view of a tennis court, and Spacewar! used the DEC PDP-1's vector display to have two spaceships battle each other.\n\nIn 1971, Computer Space, created by Nolan Bushnell and Ted Dabney, was the first commercially sold, coin-operated video game. It used a black-and-white television for its display, and the computer system was made of 74 series TTL chips. The game was featured in the 1973 science fiction film Soylent Green. Computer Space was followed in 1972 by the Magnavox Odyssey, the first home console. Modeled after a late 1960s prototype console developed by Ralph H. Baer called the \"Brown Box\", it also used a standard television. These were followed by two versions of Atari's Pong; an arcade version in 1972 and a home version in 1975 that dramatically increased video game popularity. The commercial success of Pong led numerous other companies to develop Pong clones and their own systems, spawning the video game industry.A flood of Pong clones eventually led to the video game crash of 1977, which came to an end with the mainstream success of Taito's 1978 shooter game Space Invaders, marking the beginning of the golden age of arcade video games and inspiring dozens of manufacturers to enter the market. The game inspired arcade machines to become prevalent in mainstream locations such as shopping malls, traditional storefronts, restaurants, and convenience stores. The game also became the subject of numerous articles and stories on television and in newspapers and magazines, establishing video gaming as a rapidly growing mainstream hobby. Space Invaders was soon licensed for the Atari VCS (later known as Atari 2600), becoming the first \"killer app\" and quadrupling the console's sales. This helped Atari recover from their earlier losses, and in turn the Atari VCS revived the home video game market during the second generation of consoles, up until the North American video game crash of 1983. The home video game industry was revitalized shortly afterwards by the widespread success of the Nintendo Entertainment System, which marked a shift in the dominance of the video game industry from the United States to Japan during the third generation of consoles.A number of video game developers emerged in Britain in the late 1970s and early 1980s.\n\n\n== Overview ==\n\n\n=== Platforms ===\n\nThe term \"platform\" refers to the specific combination of electronic components or computer hardware which, in conjunction with software, allows a video game to operate. The term \"system\" is also commonly used. The distinctions below are not always clear and there may be games that bridge one or more platforms. In addition to laptop/desktop computers and mobile devices, there are other devices which have the ability to play games but are not primarily video game machines, such as PDAs and graphing calculators.\n\n\n==== PC ====\nIn common use a \"PC game\" refers to a form of media that involves a player interacting with a personal computer connected to a video monitor. Personal computers are not dedicated game platforms, so there may be differences running the same game in different hardware, also the openness allows some features to developers like reduced software cost, increased flexibility, increased innovation, emulation, creation of modifications (\"mods\"), open hosting for online gaming (in which a person plays a video game with people who are in a different household) and others.\n\n\n==== Home console ====\n\nA \"console game\" is played on a specialized electronic device (\"home video game console\") that connects to a common television set or composite video monitor, unlike PCs, which can run all sorts of computer programs, a console is a dedicated video game platform manufactured by a specific company. Usually consoles only run games developed for it, or games from other platform made by the same company, but never games developed by its direct competitor, even if the same game is available on different platforms. It often comes with a specific game controller. Major console platforms include Xbox, PlayStation, and Nintendo.\n\n\n==== Handheld ====\n\nA \"handheld\" gaming device is a small, self-contained electronic device that is portable and can be held in a user's hands. It features the console, a small screen, speakers and buttons, joystick or other game controllers in a single unit. Like consoles, handhelds are dedicated platforms, and share almost the same characteristics. Handheld hardware usually is less powerful than PC or console hardware. Some handheld games from the late 1970s and early 1980s could only play one game. In the 1990s and 2000s, a number of handheld games used cartridges, which enabled them to be used to play many different games.\n\n\n==== Arcade ====\n\n\"Arcade game\" generally refers to a game played on an even more specialized type of electronic device that is typically designed to play only one game and is encased in a special, large coin-operated cabinet which has one built-in console, controllers (joystick, buttons, etc.), a CRT screen, and audio amplifier and speakers. Arcade games often have brightly painted logos and images relating to the theme of the game. While most arcade games are housed in a vertical cabinet, which the user typically stands in front of to play, some arcade games use a tabletop approach, in which the display screen is housed in a table-style cabinet with a see-through table top. With table-top games, the users typically sit to play. In the 1990s and 2000s, some arcade games offered players a choice of multiple games. In the 1980s, video arcades were businesses in which game players could use a number of arcade video games. In the 2010s, there are far fewer video arcades, but some movie theaters and family entertainment centers still have them.\n\n\n==== Web browser ====\nThe web browser has also established itself as platform in its own right in the 2000s, while providing a cross-platform environment for video games designed to be played on a wide spectrum of platforms. In turn, this has generated new terms to qualify classes of web browser-based games. These games may be identified based on the website that they appear, such as with \"Miniclip\" games. Others are named based on the programming platform used to develop them, such as Java and Flash games.\n\n\n==== Mobile ====\nWith the advent of standard operating systems for mobile devices such as iOS and Android and devices with greater hardware performance, mobile gaming has become a significant platform. These games may utilize unique features of mobile devices that are not necessary present on other platforms, such as global positing information and camera devices to support augmented reality gameplay. Mobile games also led into the development of microtransactions as a valid revenue model for casual games.\n\n\n==== Virtual reality ====\nVirtual reality (VR) games generally require players to use a special head-mounted unit that provides stereoscopic screens and motion tracking to immerse a player within virtual environment that responds to their head movements. Some VR systems include control units for the player's hands as to provide a direct way to interact with the virtual world. VR systems generally require a separate computer, console, or other processing device that couples with the head-mounted unit.\n\n\n==== Blockchain ====\nA new platform of video games emerged in late 2017 in which users could take ownership of game assets (digital assets) using Blockchain technologies. An example of this is Cryptokitties.\n\n\n=== Genres ===\n\nA video game, like most other forms of media, may be categorized into genres. Video game genres are used to categorize video games based on their gameplay interaction rather than visual or narrative differences. A video game genre is defined by a set of gameplay challenges and are classified independent of their setting or game-world content, unlike other works of fiction such as films or books. For example, a shooter game is still a shooter game, regardless of whether it takes place in a fantasy world or in outer space.Because genres are dependent on content for definition, genres have changed and evolved as newer styles of video games have come into existence. Ever advancing technology and production values related to video game development have fostered more lifelike and complex games which have in turn introduced or enhanced genre possibilities (e.g., virtual pets), pushed the boundaries of existing video gaming or in some cases add new possibilities in play (such as that seen with games specifically designed for devices like Sony's EyeToy). Some genres represent combinations of others, such as massively multiplayer online role-playing games, or, more commonly, MMORPGs. It is also common to see higher level genre terms that are collective in nature across all other genres such as with action, music/rhythm or horror-themed video games.\n\n\n=== Classifications ===\n\n\n==== Casual games ====\n\nCasual games derive their name from their ease of accessibility, simple to understand gameplay and quick to grasp rule sets. Additionally, casual games frequently support the ability to jump in and out of play on demand. Casual games as a format existed long before the term was coined and include video games such as Solitaire or Minesweeper which can commonly be found pre-installed with many versions of the Microsoft Windows operating system. Examples of genres within this category are match three, hidden object, time management, puzzle or many of the tower defense style games. Casual games are generally available through app stores and online retailers such as PopCap, Zylom and GameHouse or provided for free play through web portals such as Newgrounds. While casual games are most commonly played on personal computers, phones or tablets, they can also be found on many of the on-line console system download services (e.g., the PlayStation Network, WiiWare or Xbox Live).\n\n\n==== Serious games ====\n\nSerious games are games that are designed primarily to convey information or a learning experience to the player. Some serious games may even fail to qualify as a video game in the traditional sense of the term. Educational software does not typically fall under this category (e.g., touch typing tutors, language learning programs, etc.) and the primary distinction would appear to be based on the game's primary goal as well as target age demographics. As with the other categories, this description is more of a guideline than a rule. Serious games are games generally made for reasons beyond simple entertainment and as with the core and casual games may include works from any given genre, although some such as exercise games, educational games, or propaganda games may have a higher representation in this group due to their subject matter. These games are typically designed to be played by professionals as part of a specific job or for skill set improvement. They can also be created to convey social-political awareness on a specific subject.\n\nOne of the longest-running serious games franchises is Microsoft Flight Simulator, first published in 1982 under that name. The United States military uses virtual reality-based simulations, such as VBS1 for training exercises, as do a growing number of first responder roles (e.g., police, firefighters, EMTs). One example of a non-game environment utilized as a platform for serious game development would be the virtual world of Second Life, which is currently used by several United States governmental departments (e.g., NOAA, NASA, JPL), Universities (e.g., Ohio University, MIT) for educational and remote learning programs and businesses (e.g., IBM, Cisco Systems) for meetings and training.Tactical media in video games plays a crucial role in making a statement or conveying a message on important relevant issues. This form of media allows for a broader audience to be able to receive and gain access to certain information that otherwise may not have reached such people. An example of tactical media in video games would be newsgames. These are short games related to contemporary events designed to illustrate a point. For example, Take Action Games is a game studio collective that was co-founded by Susana Ruiz and has made successful serious games. Some of these games include Darfur is Dying, Finding Zoe, and In The Balance. All of these games bring awareness to important issues and events.\n\n\n==== Educational games ====\n\nOn 23 September 2009, U.S. President Barack Obama launched a campaign called \"Educate to Innovate\" aimed at improving the technological, mathematical, scientific and engineering abilities of American students. This campaign states that it plans to harness the power of interactive games to help achieve the goal of students excelling in these departments. This campaign has stemmed into many new opportunities for the video game realm and has contributed to many new competitions. Some of these competitions include the Stem National Video Game Competition and the Imagine Cup. Both of these bring a focus to relevant and important current issues through gaming. www.NobelPrize.org entices the user to learn about information pertaining to the Nobel prize achievements while engaging in a fun video game. There are many different types and styles of educational games, including counting to spelling to games for kids, to games for adults. Some other games do not have any particular targeted audience in mind and intended to simply educate or inform whoever views or plays the game.\n\n\n=== Controllers ===\n\nVideo game can use several types of input devices to translate human actions to a game, the most common game controllers are keyboard and mouse for \"PC games, consoles usually come with specific gamepads, handheld consoles have built in buttons. Other game controllers are commonly used for specific games like racing wheels, light guns or dance pads. Digital cameras can also be used as game controllers capturing movements of the body of the player.\nAs technology continues to advance, more can be added onto the controller to give the player a more immersive experience when playing different games. There are some controllers that have presets so that the buttons are mapped a certain way to make playing certain games easier. Along with the presets, a player can sometimes custom map the buttons to better accommodate their play style. On keyboard and mouse, different actions in the game are already preset to keys on the keyboard. Most games allow the player to change that so that the actions are mapped to different keys that are more to their liking. The companies that design the controllers are trying to make the controller visually appealing and also feel comfortable in the hands of the consumer.\nAn example of a technology that was incorporated into the controller was the touchscreen. It allows the player to be able to interact with the game differently than before. The person could move around in menus easier and they are also able to interact with different objects in the game. They can pick up some objects, equip others, or even just move the objects out of the players path. Another example is motion sensor where a persons movement is able to be captured and put into a game. Some motion sensor games are based on where the controller is. The reason for that is because there is a signal that is sent from the controller to the console or computer so that the actions being done can create certain movements in the game. Other type of motion sensor games are webcam style where the player moves around in front of it, and the actions are repeated by a game character.\n\n\n== Development ==\n\nVideo game development and authorship, much like any other form of entertainment, is frequently a cross-disciplinary field. Video game developers, as employees within this industry are commonly referred, primarily include programmers and graphic designers. Over the years this has expanded to include almost every type of skill that one might see prevalent in the creation of any movie or television program, including sound designers, musicians, and other technicians; as well as skills that are specific to video games, such as the game designer. All of these are managed by producers.\nIn the early days of the industry, it was more common for a single person to manage all of the roles needed to create a video game. As platforms have become more complex and powerful in the type of material they can present, larger teams have been needed to generate all of the art, programming, cinematography, and more. This is not to say that the age of the \"one-man shop\" is gone, as this is still sometimes found in the casual gaming and handheld markets, where smaller games are prevalent due to technical limitations such as limited RAM or lack of dedicated 3D graphics rendering capabilities on the target platform (e.g., some PDAs).With the growth of the size of development teams in the industry, the problem of cost has increased. Development studios need to be able to pay their staff a competitive wage in order to attract and retain the best talent, while publishers are constantly looking to keep costs down in order to maintain profitability on their investment. Typically, a video game console development team can range in sizes of anywhere from 5 to 50 people, with some teams exceeding 100. In May 2009, one game project was reported to have a development staff of 450. The growth of team size combined with greater pressure to get completed projects into the market to begin recouping production costs has led to a greater occurrence of missed deadlines, rushed games and the release of unfinished products.\n\n\n=== Downloadable content ===\n\nA phenomenon of additional game content at a later date, often for additional funds, began with digital video game distribution known as downloadable content (DLC). Developers can use digital distribution to issue new storylines after the main game is released, such as Rockstar Games with Grand Theft Auto IV (The Lost and Damned and The Ballad of Gay Tony), or Bethesda with Fallout 3 and its expansions. New gameplay modes can also become available, for instance, Call of Duty and its zombie modes, a multiplayer mode for Mushroom Wars or a higher difficulty level for Metro: Last Light. Smaller packages of DLC are also common, ranging from better in-game weapons (Dead Space, Just Cause 2), character outfits (LittleBigPlanet, Minecraft), or new songs to perform (SingStar, Rock Band, Guitar Hero).\n\n\n==== Expansion packs ====\n\nA variation of downloadable content is expansion packs. Unlike DLC, expansion packs add a whole section to the game that either already exists in the game's code or is developed after the game is released. Expansions add new maps, missions, weapons, and other things that weren't previously accessible in the original game. An example of an expansion is Bungie's Destiny, which had the Rise of Iron expansion. The expansion added new weapons, new maps, and higher levels, and remade old missions.\nExpansions are added to the base game to help prolong the life of the game itself until the company is able to produce a sequel or a new game altogether. Developers may plan out their game's life and already have the code for the expansion in the game, but inaccessible by players, who later unlock these expansions, sometimes for free and sometimes at an extra cost. Some developers make games and add expansions later, so that they could see what additions the players would like to have. There are also expansions that are set apart from the original game and are considered a stand-alone game, such as Ubisoft's expansion Assassin's Creed IV: Black Flag Freedom's Cry, which features a different character than the original game.\n\n\n=== Modifications ===\n\nMany games produced for the PC are designed such that technically oriented consumers can modify the game. These mods can add an extra dimension of replayability and interest. Developers such as id Software, Valve Corporation, Crytek, Bethesda, Epic Games and Blizzard Entertainment ship their games with some of the development tools used to make the game, along with documentation to assist mod developers. The Internet provides an inexpensive medium to promote and distribute mods, and they may be a factor in the commercial success of some games. This allows for the kind of success seen by popular mods such as the Half-Life mod Counter-Strike.\n\n\n=== Cheating ===\n\nCheating in computer games may involve cheat codes and hidden spots implemented by the game developers, modification of game code by third parties, or players exploiting a software glitch. Modifications are facilitated by either cheat cartridge hardware or a software trainer. Cheats usually make the game easier by providing an unlimited amount of some resource; for example weapons, health, or ammunition; or perhaps the ability to walk through walls. Other cheats might give access to otherwise unplayable levels or provide unusual or amusing features, like altered game colors or other graphical appearances.\n\n\n=== Glitches ===\n\nSoftware errors not detected by software testers during development can find their way into released versions of computer and video games. This may happen because the glitch only occurs under unusual circumstances in the game, was deemed too minor to correct, or because the game development was hurried to meet a publication deadline. Glitches can range from minor graphical errors to serious bugs that can delete saved data or cause the game to malfunction. In some cases publishers will release updates (referred to as patches) to repair glitches. Sometimes a glitch may be beneficial to the player; these are often referred to as exploits.\n\n\n=== Easter eggs ===\nEaster eggs are hidden messages or jokes left in games by developers that are not part of the main game. Easter eggs are secret responses that occur as a result of an undocumented set of commands. The results can vary from a simple printed message or image, to a page of programmer credits or a small videogame hidden inside an otherwise serious piece of software. Videogame cheat codes are a specific type of Easter egg, in which entering a secret command will unlock special powers or new levels for the player.\n\n\n== Theory ==\n\nAlthough departments of computer science have been studying the technical aspects of video games for years, theories that examine games as an artistic medium are a relatively recent development in the humanities. The two most visible schools in this emerging field are ludology and narratology. Narrativists approach video games in the context of what Janet Murray calls \"Cyberdrama\". That is to say, their major concern is with video games as a storytelling medium, one that arises out of interactive fiction. Murray puts video games in the context of the Holodeck, a fictional piece of technology from Star Trek, arguing for the video game as a medium in which the player is allowed to become another person, and to act out in another world. This image of video games received early widespread popular support, and forms the basis of films such as Tron, eXistenZ and The Last Starfighter.\nLudologists break sharply and radically from this idea. They argue that a video game is first and foremost a game, which must be understood in terms of its rules, interface, and the concept of play that it deploys. Espen J. Aarseth argues that, although games certainly have plots, characters, and aspects of traditional narratives, these aspects are incidental to gameplay. For example, Aarseth is critical of the widespread attention that narrativists have given to the heroine of the game Tomb Raider, saying that \"the dimensions of Lara Croft's body, already analyzed to death by film theorists, are irrelevant to me as a player, because a different-looking body would not make me play differently... When I play, I don't even see her body, but see through it and past it.\" Simply put, ludologists reject traditional theories of art because they claim that the artistic and socially relevant qualities of a video game are primarily determined by the underlying set of rules, demands, and expectations imposed on the player.\nWhile many games rely on emergent principles, video games commonly present simulated story worlds where emergent behavior occurs within the context of the game. The term \"emergent narrative\" has been used to describe how, in a simulated environment, storyline can be created simply by \"what happens to the player.\" However, emergent behavior is not limited to sophisticated games. In general, any place where event-driven instructions occur for AI in a game, emergent behavior will exist. For instance, take a racing game in which cars are programmed to avoid crashing, and they encounter an obstacle in the track: the cars might then maneuver to avoid the obstacle causing the cars behind them to slow and/or maneuver to accommodate the cars in front of them and the obstacle. The programmer never wrote code to specifically create a traffic jam, yet one now exists in the game.\n\n\n== Emulation ==\n\nAn emulator is a program that replicates the behavior of a video game console, allowing games to run on a different platform from the original hardware. Emulators exist for PCs, smartphones and consoles other than the original. Emulators are generally used to play old games, hack existing games, translate unreleased games in a specific region, or add enhanced features to games like improved graphics, speed up or down, bypass regional lockouts, or online multiplayer support.\nSome manufacturers have released official emulators for their own consoles. For example, Nintendo's Virtual Console allows users to play games for old Nintendo consoles on the Wii, Wii U, and 3DS. Virtual Console is part of Nintendo's strategy for deterring video game piracy. In November 2015, Microsoft launched backwards compatibility of Xbox 360 games on Xbox One console via emulation. Also, Sony announced relaunching PS2 games on PS4 via emulation. According to Sony Computer Entertainment America v. Bleem, creating an emulator for a proprietary video game console is legal. However, Nintendo claims that emulators promote the distribution of illegally copied games.\n\n\n== Social aspects ==\n\n\n=== Demographics ===\n\nThe November 2005 Nielsen Active Gamer Study, taking a survey of 2,000 regular gamers, found that the U.S. games market is diversifying. The age group among male players has expanded significantly in the 25–40 age group. For casual online puzzle-style and simple mobile cell phone games, the gender divide is more or less equal between men and women. More recently there has been a growing segment of female players engaged with the aggressive style of games historically considered to fall within traditionally male genres (e.g., first-person shooters). According to the ESRB, almost 41% of PC gamers are women. Participation among African-Americans is lower. One survey of over 2000 game developers returned responses from only 2.5% who identified as black.\n\nWhen comparing today's industry climate with that of 20 years ago, women and many adults are more inclined to be using products in the industry. While the market for teen and young adult men is still a strong market, it is the other demographics which are posting significant growth. The Entertainment Software Association (ESA) provides the following summary for 2011 based on a study of almost 1,200 American households carried out by Ipsos MediaCT:\nThe average gamer is 30 years old and has been playing for 12 years. Eighty-two percent of gamers are 18 years of age or older.\nForty-two percent of all players are women and women over 18 years of age are one of the industry's fastest growing demographics.\nTwenty-nine percent of game players are over the age of 50, an increase from nine percent in 1999.\nSixty-five percent of gamers play games with other gamers in person.\nFifty-five percent of gamers play games on their phones or handheld device.A 2006 academic study, based on a survey answered by 10,000 gamers, identified the gaymers (gamers that identify as gay) as a demographic group. A follow-up survey in 2009 studied the purchase habits and content preferences of people in the group. Based on the study by NPD group in 2011, approximately 91 percent of children aged 2–17 play games.\n\n\n=== Culture ===\n\nVideo game culture is a worldwide new media subculture formed around video games and game playing. As computer and video games have increased in popularity over time, they have had a significant influence on popular culture. Video game culture has also evolved over time hand in hand with internet culture as well as the increasing popularity of mobile games. Many people who play video games identify as gamers, which can mean anything from someone who enjoys games to someone who is passionate about it. As video games become more social with multiplayer and online capability, gamers find themselves in growing social networks. Gaming can both be entertainment as well as competition, as a new trend known as electronic sports is becoming more widely accepted. In the 2010s, video games and discussions of video game trends and topics can be seen in social media, politics, television, film and music.\n\n\n=== Multiplayer ===\n\nMultiplayer video games are those that can be played either competitively, sometimes in Electronic Sports, or cooperatively by using either multiple input devices, or by hotseating. Tennis for Two, arguably the first video game, was a two player game, as was its successor Pong. The first commercially available game console, the Magnavox Odyssey, had two controller inputs. Since then, most consoles have been shipped with two or four controller inputs. Some have had the ability to expand to four, eight or as many as 12 inputs with additional adapters, such as the Multitap. Multiplayer arcade games typically feature play for two to four players, sometimes tilting the monitor on its back for a top-down viewing experience allowing players to sit opposite one another.\nMany early computer games for non-PC descendant based platforms featured multiplayer support. Personal computer systems from Atari and Commodore both regularly featured at least two game ports. PC-based computer games started with a lower availability of multiplayer options because of technical limitations. PCs typically had either one or no game ports at all. Network games for these early personal computers were generally limited to only text based adventures or MUDs that were played remotely on a dedicated server. This was due both to the slow speed of modems (300-1200-bit/s), and the prohibitive cost involved with putting a computer online in such a way where multiple visitors could make use of it. However, with the advent of widespread local area networking technologies and Internet based online capabilities, the number of players in modern games can be 32 or higher, sometimes featuring integrated text and/or voice chat. Massively multiplayer online game (MMOs) can offer extremely high numbers of simultaneous players; Eve Online set a record with 65,303 players on a single server in 2013.\n\n\n== Behavioral effects ==\n\nIt has been shown that action video game players have better hand–eye coordination and visuo-motor skills, such as their resistance to distraction, their sensitivity to information in the peripheral vision and their ability to count briefly presented objects, than nonplayers. Researchers found that such enhanced abilities could be acquired by training with action games, involving challenges that switch attention between different locations, but not with games requiring concentration on single objects.\nIt has been suggested by a few studies that online/offline video gaming can be used as a therapeutic tool in the treatment of different mental health concerns.In Steven Johnson's book, Everything Bad Is Good for You, he argues that video games in fact demand far more from a player than traditional games like Monopoly. To experience the game, the player must first determine the objectives, as well as how to complete them. They must then learn the game controls and how the human-machine interface works, including menus and HUDs. Beyond such skills, which after some time become quite fundamental and are taken for granted by many gamers, video games are based upon the player navigating (and eventually mastering) a highly complex system with many variables. This requires a strong analytical ability, as well as flexibility and adaptability. He argues that the process of learning the boundaries, goals, and controls of a given game is often a highly demanding one that calls on many different areas of cognitive function. Indeed, most games require a great deal of patience and focus from the player, and, contrary to the popular perception that games provide instant gratification, games actually delay gratification far longer than other forms of entertainment such as film or even many books. Some research suggests video games may even increase players' attention capacities.Learning principles found in video games have been identified as possible techniques with which to reform the U.S. education system. It has been noticed that gamers adopt an attitude while playing that is of such high concentration, they do not realize they are learning, and that if the same attitude could be adopted at school, education would enjoy significant benefits. Students are found to be \"learning by doing\" while playing video games while fostering creative thinking.The U.S. Army has deployed machines such as the PackBot and UAV vehicles, which make use of a game-style hand controller to make it more familiar for young people. According to research discussed at the 2008 Convention of the American Psychological Association, certain types of video games can improve the gamers' dexterity as well as their ability to do problem solving. A study of 33 laparoscopic surgeons found that those who played video games were 27 percent faster at advanced surgical procedures and made 37 percent fewer errors compared to those who did not play video games. A second study of 303 laparoscopic surgeons (82 percent men; 18 percent women) also showed that surgeons who played video games requiring spatial skills and hand dexterity and then performed a drill testing these skills were significantly faster at their first attempt and across all 10 trials than the surgeons who did not play the video games first.An experiment carried out by Richard De Lisi and Jennifer Woldorf demonstrates the positive effect that video games may have on spatial skills. De Lisi and Woldorf took two groups of third graders, one control group and one experiment group. Both groups took a paper-and-pencil test of mental rotation skills. After this test, the experiment group only played 11 sessions of the game Tetris. This game was chosen as it requires mental rotation. After this game, both groups took the test again. The result showed that the scores of the experiment group raised higher than that of the control group, thereby confirming this theory.The research showing benefits from action games has been questioned due to methodological shortcomings, such as recruitment strategies and selection bias, potential placebo effects, and lack of baseline improvements in control groups. In addition, many of the studies are cross-sectional, and of the longitudinal interventional trials, not all have found effects. A response to this pointed out that the skill improvements from action games are more broad than predicted, such as mental rotation, which is not a common task in action games. Action gamers are not only better at ignoring distractions, but also at focusing on the main task.\n\n\n=== Objections to video games ===\n\nLike other media, such as rock music (notably heavy metal music and gangsta rap), video games have been the subject of objections, controversies and censorship, for instance because of depictions of violence, criminal activities, sexual themes, alcohol, tobacco and other drugs, propaganda, profanity or advertisements. Critics of video games include parents' groups, politicians, religious groups, scientists and other advocacy groups. Claims that some video games cause addiction or violent behavior continue to be made and to be disputed.There have been a number of societal and scientific arguments about whether the content of video games  change the behavior and attitudes of a player, and whether this is reflected in video game culture overall. Since the early 1980s, advocates of video games have emphasized their use as an expressive medium, arguing for their protection under the laws governing freedom of speech and also as an educational tool. Detractors argue that video games are harmful and therefore should be subject to legislative oversight and restrictions. The positive and negative characteristics and effects of video games are the subject of scientific study. Results of investigations into links between video games and addiction, aggression, violence, social development, and a variety of stereotyping and sexual morality issues are debated. A study was done that showed that young people who have had a greater exposure to violence in video games ended up behaving more aggressively towards people in a social environment.In 2018, the World Health Organization declared \"gaming disorder\" a mental disorder for people who are addicted to video games. Studies have shown video games can negatively effect health and mental state for some players.\n\n\n=== Possible benefits ===\nIn spite of the negative effects of video games, certain studies indicate that they may have value in terms of academic performance, perhaps because of the skills that are developed in the process. “When you play ... games you’re solving puzzles to move to the next level and that involves using some of the general knowledge and skills in maths, reading and science that you’ve been taught during the day,” said Alberto Posso an Associate Professor at the Royal Melbourne Institute of Technology, after analysing data from the results of standardized testing completed by over 12,000 high school students across Australia. As summarized by The Guardian, the study (published in the International Journal of Communication) \"found that students who played online games almost every day scored 15 points above average in maths and reading tests and 17 points above average in science.\" However, the reporter added an important comment that was not provided by some of the numerous Web sites that published a brief summary of the Australian study: \"[the] methodology cannot prove that playing video games were the cause of the improvement.\" The Guardian also reported that a Columbia University study indicated that extensive video gaming by students in the 6 to 11 age group provided a greatly increased chance of high intellectual functioning and overall school competence.\nIn an interview with CNN, Edward Castronova, a professor of Telecommunications at Indiana University Bloomington said he was not surprised by the outcome of the Australian study but also discussed the issue of causal connection. \"Though there is a link between gaming and higher math and science scores, it doesn't mean playing games caused the higher scores. It could just be that kids who are sharp are looking for a challenge, and they don't find it on social media, and maybe they do find it on board games and video games,\" he explained.Video games have also been proven to raise self-esteem and build confidence. It gives people an opportunity to do things that they cannot do offline, and to discover new things about themselves. There is a social aspect to gaming as well – research has shown that a third of video game players make good friends online. As well as that, video games are also considered to be therapeutic as it helps to relieve stress. Although short term, studies have shown that children with developmental delays gain a temporary physical improvement in health when they interact and play video games on a regular, and consistent basis due to the cognitive benefits and the use of hand eye coordination.\n\n\n==== Self-determination theory ====\nSelf-determination theory (SDT) is a macro theory of human motivation based around competence, autonomy, and relatedness to facilitate positive outcomes. SDT provides a framework for understanding the effects of playing video games; well-being, problem solving, group relations, physical activities.  These factors can be measured to determine the effect video games can have on people.\n\n\n==== Well-being ====\nThe ability to create an ideal image of one's self and being given multiple options to change that image gives a sense of satisfaction. This topic has much controversy; it is unknown whether this freedom can be beneficial to one's character or detrimental. With increased game usage, a player can become too invested in a fictionally generated character, where the desire to look that way overpowers the enjoyment of the game. Players see this character creation as entertainment and a release, creating a self-image they could not obtain in reality, bringing comfort outside of the game from lack of investment to the fictional character. Problems that arise based on character design may be link to personality disorders.\n\n\n==== Problem-solving skills ====\nCognitive skills can be enhanced through repetition of puzzles, memory games, spatial abilities and attention control. Most video games present opportunities to use these skills with the ability to try multiple times even after failure. Many of these skills can be translated to reality and problem solving. This allows the player to learn from mistakes and fully understand how and why a solution to a problem may work. Some researchers believe that continual exposure to challenges may lead players to develop greater persistence over time after a study was shown that frequent players spent more time on puzzles in task that did not involve video games. Although players were shown to spend more time on puzzles, much of that could have been due to the positive effects of problem solving in games, which involve forming strategy and weighing option before testing a solution.In a study that followed students through school, students that played video games showed higher levels of problem solving than students who did not. This contradicts the previous study in that higher success rate was seen in video game players. Time being a factor for problem solving led to different conclusions in the different studies. See video game controversies for more.\n\n\n==== Group relations ====\nOnline gaming being on the rise allows for video game players to communicate and work together in order to accomplish a certain task. Being able to work as a group in a game translates well to reality and jobs, where people must work together to accomplish a task. Research on players in violent and non-violent games show similar results, where the players relations improved to improve synergy.\n\n\n==== Physical activities ====\nWith the introduction of Wii Fit and VR (virtual reality), exergame popularity has been increasing, allowing video game players to experience more active rather than sedentary game play. Mobile apps have tried to expand this concept with the introduction of Pokémon Go, which involves walking to progress in the game. Due to exergaming being relatively new, there is still much to be researched. No major differences were seen in tests with children that played on the Wii vs. a non-active game after 12 weeks. Testing a larger range of ages may show better results.\n\n\n== Ratings and censorship ==\n\nVideo game laws vary from country to country. Console manufacturers usually exercise tight control over the games that are published on their systems, so unusual or special-interest games are more likely to appear as PC games. Free, casual, and browser-based games are usually played on available computers, mobile phones, tablet computers or PDAs.\nVarious organisations in different regions are responsible for giving content ratings to video games.\n\n\n=== United States ===\n\nThe Entertainment Software Rating Board (ESRB) gives video games maturity ratings based on their content. For example, a game might be rated \"T\" for \"Teen\" if the game contained obscene words or violence. If a game contains explicit violence or sexual themes, it is likely to receive an M for \"Mature\" rating, which means that no one under 17 should play it. The rating \"A/O\", for \"Adults Only\", indicates games with massive violence or nudity. There are no laws that prohibit children from purchasing \"M\" rated games in the United States.  Laws attempting to prohibit minors from purchasing \"M\" rated games were established in California, Illinois, Michigan, Minnesota, and Louisiana, but all were overturned on the grounds that these laws violated the First Amendment. However, many stores have opted to not sell such games to children anyway.  One of the most controversial games of all time, Manhunt 2 by Rockstar Studios, was given an AO rating by the ESRB until Rockstar could make the content more suitable for a mature audience.\n\n\n=== Europe ===\n\nPan European Game Information (PEGI) is a system that was developed to standardize the game ratings in all of Europe (not just European Union, although the majority are EU members), the current members are: all EU members, except Germany and the 10 accession states; Norway; Switzerland. Iceland is expected to join soon, as are the 10 EU accession states. For all PEGI members, they use it as their sole system, with the exception of the UK, where if a game contains certain material, it must be rated by BBFC. The PEGI ratings are legally binding in Vienna and it is a criminal offence to sell a game to someone if it is rated above their age.\n\n\n==== Germany: BPjM and USK ====\nStricter game rating laws mean that Germany does not operate within the PEGI. Instead, they adopt their own system of certification which is required by law. The Unterhaltungssoftware Selbstkontrolle (USK) checks every game before release and assigns an age rating to it – either none (white), 6 years of age (yellow), 12 years of age (green), 16 years of age (blue) or 18 years of age (red). It is forbidden for anyone, retailers, friends or parents alike, to allow a child access to a game for which he or she is underage. If a game is considered to be harmful to young people (for example because of extremely violent, pornographic or racist content), it may be referred to the  Bundesprüfstelle für jugendgefährdende Medien (BPjM) who may opt to place it on the Index upon which the game may not be sold openly or advertised in the open media. It is considered a felony to supply these games to a child.\n\n\n=== Japan ===\n\nThe Computer Entertainment Rating Organization (CERO) that rates video games and PC games (except dating sims, visual novels, and eroge) in Japan with levels of rating that informs the customer of the nature of the product and for what age group it is suitable. It was established in July 2002 as a branch of Computer Entertainment Supplier's Association, and became an officially recognized non-profit organization in 2003. These ratings are:\n\nA – All ages\nB – Ages 12 and over\nC – Ages 15 and over\nD – Ages 17 and over\nZ – Ages 18 and over\n\n\n== Commercial aspects ==\n\n\n=== Game sales ===\n\nAccording to the market research firm SuperData, as of May 2015, the global games market was worth US$74.2 billion. By region, North America accounted for $23.6 billion, Asia for $23.1 billion, Europe for $22.1 billion and South America for $4.5 billion. By market segment, mobile games were worth $22.3 billion, retail games 19.7 billion, free-to-play MMOs 8.7 billion, social games $7.9 billion, PC DLC 7.5 billion, and other categories $3 billion or less each.In the United States, also according to SuperData, the share of video games in the entertainment market grew from 5% in 1985 to 13% in 2015, becoming the third-largest market segment behind broadcast and cable television. The research firm anticipated that Asia would soon overtake North America as the largest video game market due to the strong growth of free-to-play and mobile games.Sales of different types of games vary widely between countries due to local preferences. Japanese consumers tend to purchase much more handheld games than console games and especially PC games, with a strong preference for games catering to local tastes. Another key difference is that, despite the decline of arcades in the West, arcade games remain an important sector of the Japanese gaming industry. In South Korea, computer games are generally preferred over console games, especially MMORPG games and real-time strategy games. Computer games are also popular in China.\n\n\n=== Conventions ===\n\nGaming conventions are an important showcase of the industry. The annual gamescom in Cologne in August is the world's leading expo for video games in attendance. The E3 in June in Los Angeles is also of global importance, but is an event for industry insiders only. The Tokyo Game Show in September is the main fair in Asia. Other notable conventions and trade fairs include Brasil Game Show in October, Paris Games Week in October–November, EB Games Expo (Australia) in October, KRI, ChinaJoy in July and the annual Game Developers Conference. Some publishers, developers and technology producers also host their own regular conventions, with BlizzCon, QuakeCon, Nvision and the X shows being prominent examples.\n\n\n=== Esports ===\n\nShort for electronic sports, are video game competitions played most by professional players individually or in teams that gained popularity from the late 2000s, the most common genres are fighting, first-person shooter (FPS), multiplayer online battle arena (MOBA) and real-time strategy. There are certain games that are made for just competitive multiplayer purposes. With those type of games, players focus entirely on choosing the right character or obtaining the right equipment in the game to help them when facing other players. Tournaments are held so that people in the area or from different regions can play against other players of the same game and see who is the best. Major League Gaming (MLG) is a company that reports tournaments that are held across the country. The players that compete in these tournaments are given a rank depending on their skill level in the game that they choose to play in and face other players that play that game. The players that also compete are mostly called professional players for the fact that they have played the game they are competing in for many, long hours. Those players have been able to come up with different strategies for facing different characters. The professional players are able to pick a character to their liking and be able to master how to use that character very effectively. With strategy games, players tend to know how to get resources quick and are able to make quick decisions about where their troops are to be deployed and what kind of troops to create.\n\n\n=== Copyright of video games ===\n\nCreators will nearly always copyright their games. Laws that define copyright, and the rights that are conveyed over a video game vary from country to country. Usually a fair use copyright clause allows consumers some ancillary rights, such as for a player of the game to stream a game online. This is a vague area in copyright law, as these laws predate the advent of video games. This means that rightsholders often must define what they will allow a consumer to do with the video game.\n\n\n== Museums ==\n\nThere are many video game museums around the world, including the National Videogame Museum in Frisco, Texas, which serves as the largest museum wholly dedicated to the display and preservation of the industry's most important artifacts. Europe hosts video game museums such as the Computer Games Museum in Berlin and the Museum of Soviet Arcade Machines in Moscow and Saint-Petersburg. The Museum of Art and Digital Entertainment in Oakland, California is a dedicated video game museum focusing on playable exhibits of console and computer games. The Video Game Museum of Rome is also dedicated to preserving video games and their history. The International Center for the History of Electronic Games at The Strong in Rochester, New York contains one of the largest collections of electronic games and game-related historical materials in the world, including a 5,000-square-foot (460 m2) exhibit which allows guests to play their way through the history of video games.  The Smithsonian Institution in Washington, DC has three video games on permanent display: Pac-Man, Dragon's Lair, and Pong.The Museum of Modern Art has added a total of 20 video games and one video game console to its permanent Architecture and Design Collection since 2012. In 2012, the Smithsonian American Art Museum ran an exhibition on \"The Art of Video Games\". However, the reviews of the exhibit were mixed, including questioning whether video games belong in an art museum.\n\n\n== See also ==\n\nLists of video games\nList of accessories to video games by system\nOutline of video games\nVideo game addiction\nVideo game collecting\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n\nVideo games bibliography by the French video game research association Ludoscience\nThe Virtual Museum of Computing (VMoC)"}