{"text": "Digital media are any media that are encoded in machine-readable formats. Digital media can be created, viewed, distributed, modified and preserved on digital electronics devices.\n\n\n== Digital media ==\nExamples of digital media include software, digital images, digital video, video game, web pages and websites and also \nincluding social media, data and databases, digital audio, such as MP3 and electronic books. Digital media often contrasts with print media, such as printed books, newspapers and magazines, and other traditional or analog media, such as images, movies or audio tapes.\nDigital media has a significant broad and complex impact on society and culture. Combined with the Internet and personal computing, digital media has caused disruptive innovation in publishing, journalism, public relations, entertainment, education, commerce and politics. Digital media has also posed new challenges to copyright and intellectual property laws, fostering an open content movement in which content creators voluntarily give up some or all of their legal rights to their work. The ubiquity of digital media and its effects on society suggest that we are at the start of a new era in industrial history, called the Information Age, perhaps leading to a paperless society in which all media are produced and consumed on computers. However, challenges to a digital transition remain, including outdated copyright laws, censorship, the digital divide, and the spectre of a digital dark age, in which older media becomes inaccessible to new or upgraded information systems. Digital media has a significant, wide-ranging and complex impact on society and culture.\n\n\n== History ==\n\nCodes and information by machines were first conceptualized by Charles Babbage in the early 1800s. Babbage imagined that these codes would give him instructions for his Motor of Difference and Analytical Engine, machines that Babbage had designed to solve the problem of error in calculations.\nBetween 1822 and 1823, Ada Lovelace, mathematics, wrote the first instructions for calculating numbers on Babbage engines. Lovelace's instructions are now believed to be the first computer program.\nAlthough the machines were designed to perform analysis tasks, Lovelace anticipated the possible social impact of computers and programming, writing. \"For in the distribution and combination of truths and formulas of analysis, which may become easier and more quickly subjected to the mechanical combinations of the engine, the relationships and the nature of many subjects in which science necessarily relates in new subjects, and more deeply researched ... there are in all extensions of human power or additions to human knowledge, various collateral influences, in addition to the primary and primary object reached. \"Other old machine readable media include instructions for pianolas and weaving machines.\nIt is estimated that in the year 1986 less than 1% of the world's media storage capacity was digital and in 2007 it was already 94%. The year 2002 is assumed to be the year when human kind was able to store more information in digital than in analog media (the \"beginning of the digital age\").\n\n\n=== Digital computers ===\n\nThough they used machine-readable media, Babbage's engines, player pianos, jacquard looms and many other early calculating machines were themselves analog computers, with physical, mechanical parts. The first truly digital media came into existence with the rise of digital computers.  Digital computers use binary code and Boolean logic to store and process information, allowing one machine in one configuration to perform many different tasks. The first modern, programmable, digital computers, the Manchester Mark 1 and the EDSAC, were independently invented between 1948 and 1949. Though different in many ways from modern computers, these machines had digital software controlling their logical operations. They were encoded in binary, a system of ones and zeroes that are combined to make hundreds of characters. The 1s and 0s of binary are the \"digits\" of digital media.\n\n\n=== \"As We May Think\" ===\nWhile digital media came into common use in the early 1950s, the conceptual foundation of digital media is traced to the work of scientist and engineer Vannevar Bush and his celebrated essay \"As We May Think,\" published in The Atlantic Monthly in 1945. Bush envisioned a system of devices that could be used to help scientists, doctors, historians and others, store, analyze and communicate information. Calling this then-imaginary device a \"memex\", Bush wrote:\n\nThe owner of the memex, let us say, is interested in the origin and properties of the bow and arrow. Specifically he is studying why the short Turkish bow was apparently superior to the English long bow in the skirmishes of the Crusades. He has dozens of possibly pertinent books and articles in his memex. First he runs through an encyclopedia, finds an interesting but sketchy article, leaves it projected. Next, in a history, he finds another pertinent item, and ties the two together. Thus he goes, building a trail of many items. Occasionally he inserts a comment of his own, either linking it into the main trail or joining it by a side trail to a particular item. When it becomes evident that the elastic properties of available materials had a great deal to do with the bow, he branches off on a side trail which takes him through textbooks on elasticity and tables of physical constants. He inserts a page of longhand analysis of his own. Thus he builds a trail of his interest through the maze of materials available to him.\nBush hoped that the creation of this memex would be the work of scientists after World War II. Though the essay predated digital computers by several years, \"As We May Think,\" anticipated the potential social and intellectual benefits of digital media and provided the conceptual framework for digital scholarship, the World Wide Web, wikis and even social media. It was recognized as a significant work even at the time of its publication.\n\n\n== Impact ==\n\n\n=== The digital revolution ===\n\nIn the years since the invention of the first digital computers, computing power and storage capacity have increased exponentially. Personal computers and smartphones put the ability to access, modify, store and share digital media in the hands of billions of people. Many electronic devices, from digital cameras to drones have the ability to create, transmit and view digital media. Combined with the World Wide Web and the Internet, digital media has transformed 21st century society in a way that is frequently compared to the cultural, economic and social impact of the printing press. The change has been so rapid and so widespread that it has launched an economic transition from an industrial economy to an information-based economy, creating a new period in human history known as the Information Age  or the digital revolution.The transition has created some uncertainty about definitions. Digital media, new media, multimedia, and similar terms all have a relationship to both the engineering innovations and cultural impact of digital media.  The blending of digital media with other media, and with cultural and social factors, is sometimes known as new media or \"the new media.\" Similarly, digital media seems to demand a new set of communications skills, called transliteracy, media literacy, or digital literacy. These skills include not only the ability to read and write—traditional literacy—but the ability to navigate the Internet, evaluate sources\n, and create digital content. The idea that we are moving toward a fully digital, paperless society is accompanied by the fear that we may soon—or currently—be facing a digital dark age, in which older media are no longer accessible on modern devices or using modern methods of scholarship. Digital media has a significant, wide-ranging and complex effect on society and culture.The impact of the digital revolution can also be assessed by exploring the amount of worldwide mobile smart device users there are. This can be split into 2 categories smart phone users and smart tablet users. Worldwide there are currently 2.32 billion smartphone users across the world. This figure is to exceed 2.87 billion by 2020. Smart tablet users reached a total of 1 billion in 2015, 15% of the world’s population. The first mobile phone was released in 1973 by a senior engineer in Motorola  and was only affordable by the incredibly wealthy. The fact that such a large proportion of the world’s population own smart devices demonstrates the rapid level of growth achieved throughout the digital revolution.\nThe statistics evidence the impact of digital media communications today. What is also of relevance is the fact that the numbers of smart device users is rising rapidly yet the amount of functional uses increase daily. A smartphone or tablet can be used for hundreds of daily needs. There are currently over 1 million apps on the Apple Appstore. These are all opportunities for digital marketing efforts. A smartphone user is impacted with digital advertising every second they open their Apple or Android device. This further evidences the digital revolution and the impact of revolution.\n\n\n=== Disruption in industry ===\nCompared with print media, the mass media, and other analog technologies, digital media are easy to copy, store, share and modify. This quality of digital media has led to significant changes in many industries, especially journalism, publishing, education, entertainment, and the music business. The overall effect of these changes is so far-reaching that it is difficult to quantify. For example, in movie-making, the transition from analog film cameras to digital cameras is nearly complete. The transition has economic benefits to Hollywood, making distribution easier and making it possible to add high-quality digital effects to films. At the same time, it has affected the analog special effects, stunt, and animation industries in Hollywood.  It has imposed painful costs on small movie theaters, some of which did not or will not survive the transition to digital. The effect of digital media on other media industries is similarly sweeping and complex.In journalism, digital media and citizen journalism have led to the loss of thousands of jobs in print media and the bankruptcy of many major newspapers. But the rise of digital journalism has also created thousands of new jobs and specializations. E-books and self-publishing are changing the book industry, and digital textbooks and other media-inclusive curricula are changing primary and secondary education.  In academia, digital media has led to a new form of scholarship, called digital scholarship, and new fields of study, such as digital humanities and digital history. It has changed the way libraries are used and their role in society. Every major media, communications and academic endeavor is facing a period of transition and uncertainty related to digital media.\n\n\n=== Individual as content creator ===\nDigital media has also allowed individuals to be much more active in content creation. Anyone with access to computers and the Internet can participate in social media and contribute their own writing, art, videos, photography and commentary to the Internet, as well as conduct business online. The dramatic reduction in the costs required to create and share content have led to a democratization of content creation as well as the creation of new types of content, like blogs, memes and video essays. Some of these activities have also been labelled citizen journalism. This spike in user created content is due to the development of the internet as well as the way in which users interact with media today. The release of technologies such mobile devices allow for easier and quicker access to all things media. Many media production tools that were once only available to a few are now free and easy to use. The cost of devices that can access the internet is dropping steadily, and now personal ownership of multiple digital devices is becoming standard. These elements have significantly affected political participation. Digital media is seen by many scholars as having a role in Arab Spring, and crackdowns on the use of digital and social media by embattled governments are increasingly common. Many governments restrict access to digital media in some way, either to prevent obscenity or in a broader form of political censorship.User-generated content raises issues of privacy, credibility, civility and compensation for cultural, intellectual and artistic contributions. The spread of digital media, and the wide range of literacy and communications skills necessary to use it effectively, have deepened the digital divide between those who have access to digital media and those who don't.The rising of digital media has made the consumer's audio collection more precise and personalized. It is no longer necessary to purchase an entire album if the consumer is ultimately interested in only a few audio files.\n\n\n=== Web-only news ===\nAs the internet becomes more and more prevalent, more companies are beginning to distribute content through internet only means. With the loss of viewers, there is a loss of revenue but not as bad as what would be expected. Cisco Inc released its latest forecast and the numbers are all trending to internet news to continue to grow at a rate where it will be quadruple by 2018.\n\n\n=== Copyright challenges ===\n\nDigital media pose several challenges to the current copyright and intellectual property laws. The ease of creating, modifying and sharing digital media makes copyright enforcement a challenge, and copyright laws are widely seen as outdated. For example, under current copyright law, common Internet memes are probably illegal to share in many countries. Legal rights are at least unclear for many common Internet activities, such as posting a picture that belongs to someone else to a social media account, covering a popular song on a YouTube video, or writing fanfiction. Over the last decade the concept of fair use has been applied to many online medias.\nTo resolve some of these issues, content creators can voluntarily adopt open or copyleft licenses, giving up some of their legal rights, or they can release their work to the public domain. Among the most common open licenses are Creative Commons licenses and the GNU Free Documentation License, both of which are in use on Wikipedia. Open licenses are part of a broader open content movement that pushes for the reduction or removal of copyright restrictions from software, data and other digital media.Additional software has been developed in order to protect digital media. digital rights management (DRM) is used to digitally copyright material and allows users to use that media for specific cases. For example, DRM allows a movie producer to rent a movie at a lower price than selling the movie, restricting the movie rental license length, rather than only selling the movie at full price. Additionally, DRM can prevent unauthorized sharing or modification of media.\nDigital Media is numerical, networked and interactive system of links and databases that allows us to navigate from one bit of content or webpage to another.\nOne form of digital media that is becoming a phenomenon is in the form of a online magazine or digital magazine. What exactly is a digital magazine? Due to the economic importance of digital magazines, the Audit Bureau of Circulations integrated the definition of this medium in its latest report (March 2011): a digital magazine involves the distribution of a magazine content by electronic means; it may be a replica. This is an outdated definition of what a digital magazine is. A digital magazine should not be, in fact, a replica of the print magazine in PDF, as was common practice in recent years. It should, rather, be a magazine that is, in essence, interactive and created from scratch to a digital platform (Internet, mobile phones, private networks, iPad or other device). The barriers for digital magazine distribution are thus decreasing. At the same time digitizing platforms are broadening the scope of where digital magazines can be published, such as within websites and on smartphones.\nWith the improvements of tablets and digital magazines are becoming visually enticing and readable magazines with it graphic arts.\n\n\n== See also ==\nElectronic media\nMedia psychology\nVirtual artifact\nDigital continuity\n\n\n== References ==\n\n\n== Further reading ==\nRamón Reichert, Annika Richterich, Pablo Abend, Mathias Fuchs, Karin Wenz (eds.), Digital Culture & Society."}