{"text": "A newspaper is a periodical publication containing written information about current events and is often typed in black ink with a white or gray background.\nNewspapers can cover a wide variety of fields such as politics, business, sports and art, and often include materials such as opinion columns, weather forecasts, reviews of local services, obituaries, birth notices, crosswords, editorial cartoons, comic strips, and advice columns.\nMost newspapers are businesses, and they pay their expenses with a mixture of subscription revenue, newsstand sales, and advertising revenue. The journalism organizations that publish newspapers are themselves often metonymically called newspapers.\nNewspapers have traditionally been published in print (usually on cheap, low-grade paper called newsprint). However, today most newspapers are also published on websites as online newspapers, and some have even abandoned their print versions entirely.\nNewspapers developed in the 17th century, as information sheets for businessmen. By the early 19th century, many cities in Europe, as well as North and South America, published newspapers.\nSome newspapers with high editorial independence, high journalism quality, and large circulation are viewed as newspapers of record.\n\n\n== Overview ==\nNewspapers are typically published daily or weekly. News magazines are also weekly, but they have a magazine format. General-interest newspapers typically publish news articles and feature articles on national and international news as well as local news. The news includes political events and personalities, business and finance, crime, weather, and natural disasters; health and medicine, science, and computers and technology; sports; and entertainment, society, food and cooking, clothing and home fashion, and the arts.\nUsually the paper is divided into sections for each of those major groupings (labeled A, B, C, and so on, with pagination prefixes yielding page numbers A1-A20, B1-B20, C1-C20, and so on). Most traditional papers also feature an editorial page containing editorials written by an editor (or by the paper's editorial board) and expressing an opinion on a public issue, opinion articles called \"op-eds\" written by guest writers (which are typically in the same section as the editorial), and columns that express the personal opinions of columnists, usually offering analysis and synthesis that attempts to translate the raw data of the news into information telling the reader \"what it all means\" and persuading them to concur. Papers also include articles which have no byline; these articles are written by staff writers.\nA wide variety of material has been published in newspapers. Besides the aforementioned news, information and opinions, they include weather forecasts; criticism and reviews of the arts (including literature, film, television, theater, fine arts, and architecture) and of local services such as restaurants; obituaries, birth notices and graduation announcements; entertainment features such as crosswords, horoscopes, editorial cartoons, gag cartoons, and comic strips; advice columns, food, and other columns; and radio and television listings (program schedules). As of 2017, newspapers may also provide information about new movies and TV shows available on streaming video services like Netflix. Newspapers have classified ad sections where people and businesses can buy small advertisements to sell goods or services; as of 2013, the huge increase in Internet websites for selling goods, such as Craigslist and eBay has led to significantly less classified ad sales for newspapers.\nMost newspapers are businesses, and they pay their expenses with a mixture of subscription revenue, newsstand sales, and advertising revenue (other businesses or individuals pay to place advertisements in the pages, including display ads, classified ads, and their online equivalents). Some newspapers are government-run or at least government-funded; their reliance on advertising revenue and on profitability is less critical to their survival. The editorial independence of a newspaper is thus always subject to the interests of someone, whether owners, advertisers, or a government. Some newspapers with high editorial independence, high journalism quality, and large circulation are viewed as newspapers of record.\nMany newspapers, besides employing journalists on their own payrolls, also subscribe to news agencies (wire services) (such as the Associated Press, Reuters, or Agence France-Presse), which employ journalists to find, assemble, and report the news, then sell the content to the various newspapers. This is a way to avoid duplicating the expense of reporting from around the world. Circa 2005, there were approximately 6,580 daily newspaper titles in the world selling 395 million print copies a day (in the U.S., 1,450 titles selling 55 million copies). The late 2000s–early 2010s global recession, combined with the rapid growth of free web-based alternatives, has helped cause a decline in advertising and circulation, as many papers had to retrench operations to stanch the losses. Worldwide annual revenue approached $100 billion in 2005-7, then plunged during the worldwide financial crisis of 2008-9. Revenue in 2016 fell to only $53 billion, hurting every major publisher as their efforts to gain online income fell far short of the goal.The decline in advertising revenues affected both the print and online media as well as all other mediums; print advertising was once lucrative but has greatly declined, and the prices of online advertising are often lower than those of their print precursors. Besides remodeling advertising, the internet (especially the web) has also challenged the business models of the print-only era by crowdsourcing both publishing in general (sharing information with others) and, more specifically, journalism (the work of finding, assembling, and reporting the news). In addition, the rise of news aggregators, which bundle linked articles from many online newspapers and other sources, influences the flow of web traffic. Increasing paywalling of online newspapers may be counteracting those effects. The oldest newspaper still published is the Ordinari Post Tijdender, which was established in Stockholm in 1645.\n\n\n=== Definitions ===\nNewspapers typically meet four criteria:\nPublic accessibility: Its contents are reasonably accessible to the public, traditionally by the paper being sold or distributed at newsstands, shops, and libraries, and, since the 1990s, made available over the Internet with online newspaper websites. While online newspapers have increased access to newspapers by people with Internet access, people without Internet or computer access (e.g., homeless people, impoverished people and people living in remote or rural regions may not be able to access the Internet, and thus will not be able to read online news). Literacy is also a factor which prevents people who cannot read from being able to benefit from reading newspapers (paper or online).\nPeriodicity: They are published at regular intervals, typically daily or weekly. This ensures that newspapers can provide information on newly-emerging news stories or events.\nCurrency: Its information is as up to date as its publication schedule allows. The degree of up-to-date-ness of a print newspaper is limited by the need of time to print and distribute the newspaper. In major cities, there may be a morning edition and a later edition of the same day's paper, so that the later edition can incorporate breaking news that have occurred since the morning edition was printed. Online newspapers can be updated as frequently as new information becomes available, even a number of times per day, which means that online editions can be very up-to-date.\nUniversality: Newspapers covers a range of topics, from political and business news to updates on science and technology, arts, culture, and entertainment.\n\n\n== History ==\n\n\n=== Gazettes and bulletins ===\nIn Ancient Rome, Acta Diurna, or government announcement bulletins, were produced. They were carved in metal or stone and posted in public places. In China, early government-produced news-sheets, called Dibao, circulated among court officials during the late Han dynasty (second and third centuries AD). Between 713 and 734, the Kaiyuan Za Bao (\"Bulletin of the Court\") of the Chinese Tang Dynasty published government news; it was handwritten on silk and read by government officials. In 1582, there was the first reference to privately published newssheets in Beijing, during the late Ming Dynasty.In early modern Europe, the increased cross-border interaction created a rising need for information which was met by concise handwritten news-sheets. In 1556, the government of Venice first published the monthly notizie scritte, which cost one gazette, a small coin. These avvisi were handwritten newsletters and used to convey political, military, and economic news quickly and efficiently to Italian cities (1500–1700)—sharing some characteristics of newspapers though usually not considered true newspapers. However, none of these publications fully met the classical criteria for proper newspapers, as they were typically not intended for the general public and restricted to a certain range of topics.\n\n\n=== Newspapers ===\n\n\n==== Europe ====\nThe first mechanical, movable type printing that allowed the mass production of printed books was invented by Johann Gutenberg. In the 50 years after Gutenberg started printing, an estimated 500,000 books were in circulation, printed on about 1,000 presses across the continent. Gutenberg's invention was a simple device, but it launched a revolution marked by repeated advances in technology and, as a result, a popularization of the ideals of liberty and freedom of information exchange. \nThe emergence of the new media in the 17th century has to be seen in close connection with the spread of the printing press from which the publishing press derives its name. The German-language Relation aller Fürnemmen und gedenckwürdigen Historien, printed from 1605 onwards by Johann Carolus in Strasbourg, is often recognized as the first newspaper. At the time, Strasbourg was a free imperial city in the Holy Roman Empire of the German Nation; the first newspaper of modern Germany was the Avisa, published in 1609 in Wolfenbüttel. They distinguished themselves from other printed material by being published on a regular basis. They reported on a variety of current events to a broad public audience. Within a few decades, newspapers could be found in all the major cities of Europe, from Venice to London.\nThe Dutch Courante uyt Italien, Duytslandt, &c. ('Courant from Italy, Germany, etc.') of 1618 was the first to appear in folio- rather than quarto-size. Amsterdam, a center of world trade, quickly became home to newspapers in many languages, often before they were published in their own country. The first English-language newspaper, Corrant out of Italy, Germany, etc., was published in Amsterdam in 1620. A year and a half later, Corante, or weekely newes from Italy, Germany, Hungary, Poland, Bohemia, France and the Low Countreys. was published in England by an \"N.B.\" (generally thought to be either Nathaniel Butter or Nicholas Bourne) and Thomas Archer. The first newspaper in France was published in 1631, La Gazette (originally published as Gazette de France).\nThe first newspaper in Italy, in accordance with the oldest issue still preserved, was Di Genova published in 1639 in Genoa. The first newspaper in Portugal, A Gazeta da Restauração, was published in 1641 in Lisbon. The first Spanish newspaper, Gaceta de Madrid, was published in 1661.\nPost- och Inrikes Tidningar (founded as Ordinari Post Tijdender) was first published in Sweden in 1645, and is the oldest newspaper still in existence, though it now publishes solely online. Opregte Haarlemsche Courant from Haarlem, first published in 1656, is the oldest paper still printed. It was forced to merge with the newspaper Haarlems Dagblad in 1942 when Germany occupied the Netherlands. Since then the Haarlems Dagblad has appeared with the subtitle Oprechte Haerlemse Courant 1656. Merkuriusz Polski Ordynaryjny was published in Kraków, Poland in 1661. The first successful English daily, The Daily Courant, was published from 1702 to 1735.\n\n\n==== Americas ====\n\nIn Boston in 1690, Benjamin Harris published Publick Occurrences Both Forreign and Domestick. This is considered the first newspaper in the American colonies even though only one edition was published before the paper was suppressed by the government. In 1704, the governor allowed The Boston News-Letter to be published and it became the first continuously published newspaper in the colonies. Soon after, weekly papers began publishing in New York and Philadelphia. These early newspapers followed the British format and were usually four pages long. They mostly carried news from Britain and content depended on the editor's interests. In 1783, the Pennsylvania Evening Post became the first American daily.In 1752, John Bushell published the Halifax Gazette, which claims to be \"Canada's first newspaper.\" However, its official descendant, the Royal Gazette, is a government publication for legal notices and proclamations rather than a proper newspaper; In 1764, the Quebec Gazette was first printed 21 June 1764 and remains the oldest continuously published newspaper in North America as the Quebec Chronicle-Telegraph. It is currently published as an English-language weekly from its offices at 1040 Belvédère, suite 218, Quebec City, Quebec, Canada. In 1808, the Gazeta do Rio de Janeiro had its first edition, printed in devices brought from England, publishing news favourable for the government of the United Kingdom of Portugal, Brazil and the Algarves since it was produced by the official press service of the Portuguese crown.\nIn 1821, after the ending of the ban of private newspaper circulation, appears the first non-imperial printed publication, Diário do Rio de Janeiro, though there existed already the Correio Braziliense, published by Hipólito José da Costa at the same time as the Gazeta, but from London and with forcefully advocated political and critical ideas, aiming to expose the administration's flaws. The first newspaper in Peru was El Peruano, established in October 1825 and still published today, but with several name changes.\n\n\n==== Asia ====\n During the Tang Dynasty in China (618–906), the Kaiyuan Za Bao published the government news; it was block-printed onto paper. It is sometimes considered one of the earliest newspapers to be published. The first recorded attempt to found a newspaper of the modern type in South Asia was by William Bolts, a Dutchman in the employ of the British East India Company in September 1768 in Calcutta. However, before he could begin his newspaper, he was deported back to Europe. In 1780 the first newsprint from this region, Hicky's Bengal Gazette, was published by an Irishman, James Augustus Hicky. He used it as a means to criticize the British rule through journalism.\n\n\n==== Middle East ====\n\nThe history of Middle Eastern newspapers goes back to the 19th century. Many editors were not only journalists but also writers, philosophers and politicians. With unofficial journals, these intellectuals encouraged public discourse on politics in the Ottoman and Persian Empires. Literary works of all genres were serialized and published in the press as well.\nThe first newspapers in the Ottoman Empire were owned by foreigners living there who wanted to make propaganda about the Western world. The earliest was printed in 1795 by the Palais de France in Pera. Indigenous Middle Eastern journalism started in 1828, when Muhammad Ali, Khedive of Egypt, ordered the local establishment of the gazette Vekayi-i Misriye (Egyptian Affairs). It was first paper written in Ottoman Turkish and Arabic on opposite pages, and later in Arabic only, under the title \"al-Waqa'i'a al-Masriya\".The first non-official Turkish newspaper, Ceride-i Havadis (Register of Events), was published by an Englishman, William Churchill, in 1840. The first private newspaper to be published by Turkish journalists, Tercüman-ı Ahvâl (Interpreter of Events), was founded by İbrahim Şinasi and Agah Efendi and issued in 1860. The first newspaper in Iran, Kaghaz-e Akhbar (The Newspaper), was created for the government by Mirza Saleh Shirazi in 1837. The first journals in the Arabian Peninsula appeared in Hijaz, once it had become independent of Ottoman rule, towards the end of World War I.One of the earliest women to sign her articles in the Arab press was the female medical practitioner Galila Tamarhan, who contributed articles to a medical magazine called \"Ya'asub al-Tib\" (Leader in Medicine) in the 1860s.\n\n\n=== Industrial Revolution ===\nBy the early 19th century, many cities in Europe, as well as North and South America, published newspaper-type publications though not all of them developed in the same way; content was vastly shaped by regional and cultural preferences. Advances in printing technology related to the Industrial Revolution enabled newspapers to become an even more widely circulated means of communication, as new printing technologies made printing less expensive and more efficient. In 1814, The Times (London) acquired a printing press capable of making 1,100 impressions per hour. Soon, this press was adapted to print on both sides of a page at once. This innovation made newspapers cheaper and thus available to a larger part of the population.\nIn 1830, the first inexpensive \"penny press\" newspaper came to the market: Lynde M. Walter's Boston Transcript. Penny press papers cost about one sixth the price of other newspapers and appealed to a wider audience, including less educated and lower-income people. In France, Émile de Girardin started \"La Presse\" in 1836, introducing cheap, advertising-supported dailies to France. In 1848, August Zang, an Austrian who knew Girardin in Paris, returned to Vienna to introduce the same methods with \"Die Presse\" (which was named for and frankly copied Girardin's publication).\n\n\n== Categories ==\nWhile most newspapers are aimed at a broad spectrum of readers, usually geographically defined, some focus on groups of readers defined more by their interests than their location: for example, there are daily and weekly business newspapers (e.g., The Wall Street Journal and India Today) and sports newspapers. More specialist still are some weekly newspapers, usually free and distributed within limited regional areas; these may serve communities as specific as certain immigrant populations, the local gay community or indie rock enthusiasts within a city or region.\n\n\n=== Frequency ===\n\n\n==== Daily ====\nA daily newspaper is printed every day, sometimes with the exception of Sundays and occasionally Saturdays, (and some major holidays) and often of some national holidays. Saturday and, where they exist, Sunday editions of daily newspapers tend to be larger, include more specialized sections (e.g., on arts, films, entertainment) and advertising inserts, and cost more. Typically, the majority of these newspapers' staff members work Monday to Friday, so the Sunday and Monday editions largely depend on content done in advance or content that is syndicated. Most daily newspapers are sold in the morning.\nAfternoon or evening papers, once common but now scarce, are aimed more at commuters and office workers. In practice (though this may vary according to country), a morning newspaper is available in early editions from before midnight on the night before its cover date, further editions being printed and distributed during the night. The later editions can include breaking news which was first revealed that day, after the morning edition was already printed. Previews of tomorrow's newspapers are often a feature of late night news programs, such as Newsnight in the United Kingdom. In 1650, the first daily newspaper appeared,  Einkommende Zeitung, published by Timotheus Ritzsch in Leipzig, Germany.In the United Kingdom, unlike most other countries, \"daily\" newspapers do not publish on Sundays. In the past there were independent Sunday newspapers; nowadays the same publisher often produces a Sunday newspaper, distinct in many ways from the daily, usually with a related name; e.g., The Times and The Sunday Times are distinct newspapers owned by the same company, and an article published in the latter would never be credited to The Times.\nIn some cases a Sunday edition is an expanded version of a newspaper from the same publisher; in other cases, particularly in Britain, it may be a separate enterprise, e.g., The Observer, not affiliated with a daily newspaper from its founding in 1791 until it was acquired by The Guardian in 1993. Usually, it is a specially expanded edition, often several times the thickness and weight of the weekday editions and contain generally special sections not found in the weekday editions, such as Sunday comics, Sunday magazines (such as The New York Times Magazine and The Sunday Times Magazine).\nIn some countries daily newspapers are not published on Christmas Day, but weekly newspapers would change their day e.g. Sunday newspapers are published on Saturday December 24, Christmas Eve when Christmas Day is falling on Sunday.\n\n\n==== Weekly and other ====\n\nWeekly newspapers are published once a week, and tend to be smaller than daily papers. Some newspapers are published two or three times a week and are known as biweekly publications. Some publications are published, for example, fortnightly (or bimonthly in American parlance). They have a change from normal weekly day of the week during the Christmas period depending the day of the week Christmas Day is falling on.\n\n\n=== Geographical scope and distribution ===\n\n\n==== Local or regional ====\nA local newspaper serves a region such as a city, or part of a large city.\nAlmost every market has one or two newspapers that dominate the area. Large metropolitan newspapers often have large distribution networks, and can be found outside their normal area, sometimes widely, sometimes from fewer sources.\n\n\n==== National ====\n\nMost nations have at least one newspaper that circulates throughout the whole country: a national newspaper. Some national newspapers, such as the Financial Times and The Wall Street Journal, are specialised (in these examples, on financial matters). There are many national newspapers in the United Kingdom, but only a few in the United States and Canada. In Canada, The Globe and Mail is sold throughout the country. In the United States, in addition to national newspapers as such, The New York Times is available throughout the country.\n\nThere is also a small group of newspapers which may be characterized as international newspapers. Some, such as The New York Times International Edition, (formerly The International Herald Tribune) have always had that focus, while others are repackaged national newspapers or \"international editions\" of national or large metropolitan newspapers. In some cases, articles that might not interest the wider range of readers are omitted from international editions; in others, of interest to expatriates, significant national news is retained. As English became the international language of business and technology, many newspapers formerly published only in non-English languages have also developed English-language editions. In places as varied as Jerusalem and Mumbai, newspapers are printed for a local and international English-speaking public, and for tourists. The advent of the Internet has also allowed non-English-language newspapers to put out a scaled-down English version to give their newspaper a global outreach.\nSimilarly, in many countries with a large foreign-language-speaking population or many tourists, newspapers in languages other than the national language are both published locally and imported. For example, newspapers and magazines from many countries, and locally published newspapers in many languages, are readily to be found on news-stands in central London. In the US state of Florida, so many tourists from the French-speaking Canadian province of Quebec visit for long stays during the winter (\"snowbirds\") that some newsstands and stores sell French-language newspapers such as Le Droit.\n\n\n=== Subject matter ===\nGeneral newspapers cover all topics, with different emphasis. While at least mentioning all topics, some might have good coverage of international events of importance; others might concentrate more on national or local entertainment or sports. Specialised newspapers might concentrate more specifically on, for example, financial matters. There are publications covering exclusively sports, or certain sports, horse-racing, theatre, and so on, although they may no longer be called newspapers.\n\n\n=== Technology ===\n\n\n==== Print ====\nFor centuries newspapers were printed on paper and supplied physically to readers either by local distribution, or in some cases by mail, for example for British expatriates living in India or Hong Kong who subscribed to British newspapers. Newspapers can be delivered to subscribers homes and/or businesses by a paper's own delivery people, sent via the mail, sold at newsstands, grocery stores and convenience stores, and delivered to libraries and bookstores. Newspaper organizations need a large distribution system to deliver their papers to these different distributors, which typically involves delivery trucks and delivery people.\nIn recent years, newspapers and other media have adapted to the changing technology environment by starting to offer online editions to cater to the needs of the public. In the future, the trend towards more electronic delivery of the news will continue with more emphasis on the Internet, social media and other electronic delivery methods. However, while the method of delivery is changing, the newspaper and the industry still has a niche in the world.\n\n\n==== Online ====\n\nAs of 2007, virtually all major printed newspapers have online editions distributed over the Internet which, depending on the country may be regulated by journalism organizations such as the Press Complaints Commission in the UK. But as some publishers find their print-based models increasingly unsustainable, Web-based \"newspapers\" have also started to appear, such as the Southport Reporter in the UK and the Seattle Post-Intelligencer, which stopped publishing in print after 149 years in March 2009 and became an online-only paper.\nSince 2005 in the UK more than 200 regional newspapers have closed down resulting in 50% decline in the number of regional journalists. A 2016 study done by King's College London found that the towns which lost their local newspapers receded from the democratic values and experienced the loss of public faith in the authorities.A new trend in newspaper publishing is the introduction of personalization through on-demand printing technologies or with online news aggregator websites like Google news. Customized newspapers allow the reader to create their individual newspaper through the selection of individual pages from multiple publications. This \"Best of\" approach allows revival of the print-based model and opens up a new distribution channel to increase coverage beneath the usual boundaries of distribution. Customized newspapers online have been offered by MyYahoo, I-Google, CRAYON, ICurrent.com, Kibboko.com, Twitter. times and many others. With these online newspapers, the reader can select how much of each section (politics, sports, arts, etc.) they wish to see in their news.\n\n\n== Organization and personnel ==\n\nIn the United States, the overall manager or chief executive of the newspaper is the publisher. In small newspapers, the owner of the publication (or the largest shareholder in the corporation that owns the publication) is usually the publisher. Although he or she rarely or perhaps never writes stories, the publisher is legally responsible for the contents of the entire newspaper and also runs the business, including hiring editors, reporters, and other staff members. This title is less common outside the U.S. The equivalent position in the film industry and television news shows is the executive producer. Most newspapers have four main departments devoted to publishing the newspaper itself—editorial, production/printing, circulation, and advertising, although they are frequently referred to by a variety of other names—as well as the non-newspaper-specific departments also found in other businesses of comparable size, such as accounting, marketing, human resources, and IT.\nThroughout the English-speaking world, the person who selects the content for the newspaper is usually referred to as the editor. Variations on this title such as editor-in-chief, executive editor, and so on are common. For small newspapers, a single editor may be responsible for all content areas. At large newspapers, the most senior editor is in overall charge of the publication, while less senior editors may each focus on one subject area, such as local news or sports. These divisions are called news bureaus or \"desks\", and each is supervised by a designated editor. Most newspaper editors copy edit the stories for their part of the newspaper, but they may share their workload with proofreaders and fact checkers.\n\nReporters are journalists who primarily report facts that they have gathered and those who write longer, less news-oriented articles may be called feature writers. Photographers and graphic artists provide images and illustrations to support articles. Journalists often specialize in a subject area, called a beat, such as sports, religion, or science. Columnists are journalists who write regular articles recounting their personal opinions and experiences. Printers and press operators physically print the newspaper. Printing is outsourced by many newspapers, partly because of the cost of an offset web press (the most common kind of press used to print newspapers) and also because a small newspaper's print run might require less than an hour of operation, meaning that if the newspaper had its own press it would sit idle most of the time. If the newspaper offers information online, webmasters and web designers may be employed to upload stories to the newspaper's website.\nThe staff of the circulation department liaise with retailers who sell the newspaper; sell subscriptions; and supervise distribution of the printed newspapers through the mail, by newspaper carriers, at retailers, and through vending machines. Free newspapers do not sell subscriptions, but they still have a circulation department responsible for distributing the newspapers. Sales staff in the advertising department not only sell ad space to clients such as local businesses, but also help clients design and plan their advertising campaigns. Other members of the advertising department may include graphic designers, who design ads according to the customers' specifications and the department's policies. In an advertising-free newspaper, there is no advertising department.\n\n\n== Zoned and other editions ==\n\nNewspapers often refine distribution of ads and news through zoning and editioning. Zoning occurs when advertising and editorial content change to reflect the location to which the product is delivered. The editorial content often may change merely to reflect changes in advertising—the quantity and layout of which affects the space available for editorial—or may contain region-specific news. In rare instances, the advertising may not change from one zone to another, but there will be different region-specific editorial content. As the content can vary widely, zoned editions are often produced in parallel. Editioning occurs in the main sections as news is updated throughout the night. The advertising is usually the same in each edition (with the exception of zoned regionals, in which it is often the 'B' section of local news that undergoes advertising changes). As each edition represents the latest news available for the next press run, these editions are produced linearly, with one completed edition being copied and updated for the next edition. The previous edition is always copied to maintain a Newspaper of Record and to fall back on if a quick correction is needed for the press. For example, both The New York Times and The Wall Street Journal offer a regional edition, printed through a local contractor, and featuring locale specific content. The Journal's global advertising rate card provides a good example of editioning.See also Los Angeles Times suburban sections.\n\n\n== Format ==\n\nMost modern newspapers are in one of three sizes:\n\nBroadsheets: 600 mm × 380 mm (23 1⁄2 in × 15 in), generally associated with more intellectual newspapers, although a trend towards \"compact\" newspapers is changing this. Examples include The Daily Telegraph in the United Kingdom.\nTabloids: half the size of broadsheets at 380 mm × 300 mm (15 in × 11 3⁄4 in), and often perceived as sensationalist in contrast to broadsheets. Examples include The Sun, The National Enquirer, The Star Magazine, New York Post, the Chicago Sun-Times, The Princely State, The Globe.\n\"Microdaily\" is infrequently used to refer to a tabloid-sized free daily newspaper that offers lower ad rates than its broadsheet competitors. The content of a microdaily can range from intense local news coverage to a combination of local and national stories.\nBerliner or Midi: 470 mm × 315 mm (18 1⁄2 in × 12 1⁄2 in) used by European papers such as Le Monde in France, La Stampa in Italy, El País in Spain and, from 2005 until 2018, The Guardian in the United Kingdom.Newspapers are usually printed on cheap, off-white paper known as newsprint. Since the 1980s, the newspaper industry has largely moved away from lower-quality letterpress printing to higher-quality, four-color process, offset printing. In addition, desktop computers, word processing software, graphics software, digital cameras and digital prepress and typesetting technologies have revolutionized the newspaper production process. These technologies have enabled newspapers to publish color photographs and graphics, as well as innovative layouts and better design.\nTo help their titles stand out on newsstands, some newspapers are printed on coloured newsprint. For example, the Financial Times is printed on a distinctive salmon pink paper, and Sheffield's weekly sports publication derives its name, the Green 'Un, from the traditional colour of its paper. The Italian sports newspaper La Gazzetta dello Sport is also printed on pink paper while L'Équipe (formerly L'Auto) is printed on yellow paper. Both the latter promoted major cycling races and their newsprint colours were reflected in the colours of the jerseys used to denote the race leader; for example the leader in the Giro d'Italia wears a pink jersey.\n\n\n== Circulation and readership ==\n\nThe number of copies distributed, either on an average day or on particular days (typically Sunday), is called the newspaper's circulation and is one of the principal factors used to set advertising rates. Circulation is not necessarily the same as copies sold, since some copies or newspapers are distributed without cost. Readership figures may be higher than circulation figures because many copies are read by more than one person, although this is offset by the number of copies distributed but not read (especially for those distributed free). In the United States, the Alliance for Audited Media maintains historical and current data on average circulation of daily and weekly newspapers and other periodicals.\nAccording to the Guinness Book of Records, the daily circulation of the Soviet newspaper Trud exceeded 21,500,000 in 1990, while the Soviet weekly Argumenty i Fakty boasted a circulation of 33,500,000 in 1991. According to United Nations data from 1995 Japan has three daily papers—the Yomiuri Shimbun, Asahi Shimbun, and Mainichi Shimbun—with circulations well above 5.5 million. Germany's Bild, with a circulation of 3.8 million, was the only other paper in that category. In the United Kingdom, The Sun is the top seller, with around 3.24 million copies distributed daily. In the U.S., The Wall Street Journal has a daily circulation of approximately 2.02 million, making it the most widely distributed paper in the country.While paid readership of print newspapers has been steadily declining in the developed OECD nations, it has been rising in the chief developing nations (Brazil, India, Indonesia, China and South Africa), whose paid daily circulation exceeded those of the developed nations for the first time in 2008. In India, The Times of India is the largest-circulation English newspaper, with 3.14 million copies daily. According to the 2009 Indian Readership Survey, the Dainik Jagran is the most-read, local-language (Hindi) newspaper, with 55.7 million readers. According to Tom Standage of The Economist, India currently has daily newspaper circulation of 110 million copies.\n\nA common measure of a newspaper's health is market penetration, expressed as a percentage of households that receive a copy of the newspaper against the total number of households in the paper's market area. In the 1920s, on a national basis in the U.S., daily newspapers achieved market penetration of 123 percent (meaning the average U.S. household received 1.23 newspapers). As other media began to compete with newspapers, and as printing became easier and less expensive giving rise to a greater diversity of publications, market penetration began to decline. It wasn't until the early 1970s, however, that market penetration dipped below 100 percent. By 2000, it was 53 percent and still falling. Many paid-for newspapers offer a variety of subscription plans. For example, someone might want only a Sunday paper, or perhaps only Sunday and Saturday, or maybe only a workweek subscription, or perhaps a daily subscription. Most newspapers provide some or all of their content on the Internet, either at no cost or for a fee. In some cases, free access is available only for a matter of days or weeks, or for a certain number of viewed articles, after which readers must register and provide personal data. In other cases, free archives are provided.\n\n\n== Advertising ==\n\nA newspaper typically generates 70–80% of its revenue from advertising, and the remainder from sales and subscriptions. The portion of the newspaper that is not advertising is called editorial content, editorial matter, or simply editorial, although the last term is also used to refer specifically to those articles in which the newspaper and its guest writers express their opinions. (This distinction, however, developed over time – early publishers like Girardin (France) and Zang (Austria) did not always distinguish paid items from editorial content.). The business model of having advertising subsidize the cost of printing and distributing newspapers (and, it is always hoped, the making of a profit) rather than having subscribers cover the full cost was first done, it seems, in 1833 by The Sun, a daily paper that was published in New York City. Rather than charging 6 cents per copy, the price of a typical New York daily at the time, they charged 1-cent, and depended on advertising to make up the difference.\n\nNewspapers in countries with easy access to the web have been hurt by the decline of many traditional advertisers. Department stores and supermarkets could be relied upon in the past to buy pages of newspaper advertisements, but due to industry consolidation are much less likely to do so now. Additionally, newspapers are seeing traditional advertisers shift to new media platforms. The classified category is shifting to sites including Craigslist, employment websites, and auto sites. National advertisers are shifting to many types of digital content including websites, rich media platforms, and mobile.\nIn recent years, the advertorial emerged. Advertorials are most commonly recognized as an opposite-editorial which third parties pay a fee to have included in the paper. Advertorials commonly advertise new products or techniques, such as a new design for golf equipment, a new form of laser surgery, or weight-loss drugs. The tone is usually closer to that of a press release than of an objective news story. Such articles are often clearly distinguished from editorial content through either the design and layout of the page or with a label declaring the article as an advertisement. However, there has been growing concern over the blurring of the line between editorial and advertorial content.\n\n\n== Journalism ==\n\nSince newspapers began as a journal (record of current events), the profession involved in the making of newspapers began to be called journalism. In the yellow journalism era of the 19th century, many newspapers in the United States relied on sensational stories that were meant to anger or excite the public, rather than to inform. The restrained style of reporting that relies on fact checking and accuracy regained popularity around World War II. Criticism of journalism is varied and sometimes vehement. Credibility is questioned because of anonymous sources; errors in facts, spelling, and grammar; real or perceived bias; and scandals involving plagiarism and fabrication.\nIn the past, newspapers have often been owned by so-called press barons, and were used for gaining a political voice. After 1920 most major newspapers became parts of chains run by large media corporations such as Gannett, The McClatchy Company, Hearst Corporation, Cox Enterprises, Landmark Media Enterprises LLC, Morris Communications, The Tribune Company, Hollinger International, News Corporation, Swift Communications, etc. Newspapers have, in the modern world, played an important role in the exercise of freedom of expression. Whistle-blowers, and those who \"leak\" stories of corruption in political circles often choose to inform newspapers before other mediums of communication, relying on the perceived willingness of newspaper editors to expose the secrets and lies of those who would rather cover them. However, there have been many circumstances of the political autonomy of newspapers being curtailed. Recent research has examined the effects of a newspaper's closing on the reelection of incumbents, voter turnout, and campaign spending.Opinions of other writers and readers are expressed in the op-ed (\"opposite the editorial page\") and letters to the editors sections of the paper. Some ways newspapers have tried to improve their credibility are: appointing ombudsmen, developing ethics policies and training, using more stringent corrections policies, communicating their processes and rationale with readers, and asking sources to review articles after publication.\n\n\n== Impact of television and Internet ==\n\nBy the late 1990s, the availability of news via 24-hour television channels and the subsequent availability of online journalism posed an ongoing challenge to the business model of most newspapers in developed countries. Paid newspaper circulation has declined, while advertising revenue—the bulk of most newspapers' income—has been shifting from print to social media and news websites, resulting in a general decline. One of the challenges is that a number of online news websites are free to access. Other online news sites have a paywall and require paid subscription for access. In less-developed countries, cheaper printing and distribution, increased literacy, a growing middle class, and other factors have compensated for the emergence of electronic media, and newspaper circulation continues to grow.In April 1995, The American Reporter became the first daily Internet-based newspaper with its own paid reporters and original content. The future of newspapers in countries with high levels of Internet access has been widely debated as the industry has faced down-soaring newsprint prices, slumping ad sales, the loss of much classified advertising, and precipitous drops in circulation. Since the late-1990s, the number of newspapers slated for closure, bankruptcy, or severe cutbacks has risen—especially in the United States, where the industry has shed a fifth of its journalists since 2001.The debate has become more urgent lately, as the 2008–2009 recession shaved newspapers' profits and as once-explosive growth in web revenue has leveled off, forestalling what the industry hoped would become an important source of revenue. At issue is whether the newspaper industry faces a cyclical trough (or dip), or whether new technology has rendered print newspapers obsolete.  As of 2017, an increasing percentage of millennials get their news from social media websites. In the 2010s, many traditional newspapers have begun offering \"digital editions,\" accessible via computers and mobile devices. Online advertising allows news websites to show catered ads,  based on a visitor's interests.\n\n\n== See also ==\nList of newspaper comic strips\nLists of newspapers\nMad Magazine\nOff stone\n\n\n== Footnotes ==\n\n\n== Further reading ==\nWillings Press Guide (134th ed. 3 vol. 2010), comprehensive guide to world press. Vol 1 UK, Vol 2 Europe and Vol 3 World. ISBN 1-906035-17-2\nEditor and Publisher International Year Book (90th ed. 2009), comprehensive guide to American newspapers\nKevin G. Barnhurst, and John Nerone. The Form of News, A History (2001) excerpt and text search\nConley, David, and Stephen Lamble. The Daily Miracle: An Introduction to Journalism (3rd ed. 2006), 518pp; global viewpoint\nHarrower, Tim. The Newspaper Designer's Handbook (6th ed. 2007) excerpt and text search\nJones, Alex. Losing the News: The Future of the News That Feeds Democracy (2009)\nSousa, Jorge Pedro Sousa (Coord.); Maria do Carmo Castelo Branco; Mário Pinto; Sandra Tuna; Gabriel Silva; Eduardo Zilles Borba; Mônica Delicato; Carlos Duarte; Nair Silva; Patrícia Teixeira. A Gazeta \"da Restauração\": Primeiro Periódico Português. Uma análise do discurso VOL. II — Reproduções(2011) ISBN 978-989-654-061-6\nWalravens, Hartmut, ed. Newspapers in Central And Eastern Europe (2004) 251pp\nWilliams, Kevin. Read All About It!: A History of the British Newspaper (2009) excerpt and text search\n\n\n== External links ==\n \"Newspaper\" . The New Student's Reference Work . 1914.\nNewsTornado – Worldwide Newspaper Circulation Map\nPrint Culture at A History of Central Florida Podcast\nChart – Real and Fake News (2016)/Vanessa Otero (basis) (Mark Frauenfelder)\nChart – Real and Fake News (2014) (2016)/Pew Research Center\nMalayalam News\n\n\n=== Newspaper archives ===\nWikipedia List\nNewspapercat – University of Florida Historical Digital Newspaper Catalog Collection\nHistorical newspapers from 1700s–Present : Newspapers.com\nHistorical newspaper database, from NewspaperARCHIVE.com\nMore than 8m pages of Historic European newspapers Free\nChronicling America: Historic American Newspapers from National Digital Newspaper Program."}