{"text": "News is information about current events. This may be provided through many different media: word of mouth, printing, postal systems, broadcasting, electronic communication, or through the testimony of observers and witnesses to events.\nCommon topics for news reports include war, government, politics, education, health, the environment, economy, business, fashion, and entertainment, as well as athletic events, quirky or unusual events. Government proclamations, concerning royal ceremonies, laws, taxes, public health, and criminals, have been dubbed news since ancient times. Humans exhibit a nearly universal desire to learn and share news, which they satisfy by talking to each other and sharing information. Technological and social developments, often driven by government communication and espionage networks, have increased the speed with which news can spread, as well as influenced its content. The genre of news as we know it today is closely associated with the newspaper, which originated in China as a court bulletin and spread, with paper and printing press, to Europe.\n\n\n== Meaning ==\n\n\n=== Etymology ===\nThe English word \"news\" developed in the 14th century as a special use of the plural form of \"new\". In Middle English, the equivalent word was newes, like the French nouvelles and the German Neues. Similar developments are found in the Slavic languages the Czech and Slovak noviny (from nový, \"new\"), the cognate Polish nowiny, the Bulgarian novini, and Russian novosti – and in the Celtic languages: the Welsh newyddion (from newydd) and the Cornish nowodhow (from nowydh).Jessica Garretson Finch is credited with coining the phrase \"current events\" while teaching at Barnard College in the 1890s.\n\n\n=== Newness ===\nAs its name implies, \"news\" typically connotes the presentation of new information. The newness of news gives it an uncertain quality which distinguishes it from the more careful investigations of history or other scholarly disciplines. Whereas historians tend to view events as causally related manifestations of underlying processes, news stories tend to describe events in isolation, and to exclude discussion of the relationships between them. News conspicuously describes the world in the present or immediate past, even when the most important aspects of a news story have occurred long in the past—or are expected to occur in the future. To make the news, an ongoing process must have some \"peg\", an event in time which anchors it to the present moment. Relatedly, news often addresses aspects of reality which seem unusual, deviant, or out of the ordinary. Hence the famous dictum that \"Dog Bites Man\" is not news, but \"Man Bites Dog\" is.Another corollary of the newness of news is that, as new technology enables new media to disseminate news more quickly, 'slower' forms of communication may move away from 'news' towards 'analysis'.\n\n\n=== Commodity ===\nAccording to some theories, \"news\" is whatever the news industry sells. Journalism, broadly understood along the same lines, is the act or occupation of collecting and providing news. From a commercial perspective, news is simply one input, along with paper (or an electronic server) necessary to prepare a final product for distribution. A news agency supplies this resource \"wholesale\" and publishers enhance it for retail.\n\n\n=== Tone ===\nMost purveyors of news value impartiality, neutrality, and objectivity, despite the inherent difficulty of reporting without political bias. Perception of these values has changed greatly over time as sensationalized 'tabloid journalism' has risen in popularity. Michael Schudson has argued that before the era of World War I and the concomitant rise of propaganda, journalists were not aware of the concept of bias in reporting, let alone actively correcting for it. News is also sometimes said to portray the truth, but this relationship is elusive and qualified.Paradoxically, another property commonly attributed to news is sensationalism, the disproportionate focus on, and exaggeration of, emotive stories for public consumption. This news is also not unrelated to gossip, the human practice of sharing information about other humans of mutual interest. A common sensational topic is violence; hence another news dictum, \"if it bleeds, it leads\".\n\n\n=== Newsworthiness ===\nNewsworthiness is defined as a subject having sufficient relevance to the public or a special audience to warrant press attention or coverage. Journalists apply news values to identify a news story. News values determine how much attention a news story is given by a media outlet, and the attention it is given by its audience or readers.In some countries and at some points in history, what news media and the public have considered \"newsworthy\" has met different definitions, such as the notion of news values. Many news values seem to be common across cultures. People seem to be interested in news to the extent which it has a big impact, describes conflicts, happens nearby, involves well-known people, and deviates from the norms of everyday happenings. War is a common news topic, partly because it involves unknown events that could pose personal danger.\n\n\n== History ==\n\n\n=== Folk news ===\nEvidence suggests that cultures around the world have found a place for people to share stories about interesting new information. Among Zulus, Mongolians, Polynesians, and American Southerners, anthropologists have documented the practice of questioning travelers for news as a matter of priority. Sufficiently important news would be repeated quickly and often, and could spread by word of mouth over a large geographic area. Even as printing presses came into use in Europe, news for the general public often travelled orally via monks, travelers, town criers, etc.The news is also transmitted in public gathering places, such as the Greek forum and the Roman baths. Starting in England, coffeehouses served as important sites for the spread of news, even after telecommunications became widely available. The history of the coffee houses is traced from Arab countries, which was introduced in England in the 16th century. In the Muslim world, people have gathered and exchanged news at mosques and other social places. Travelers on pilgrimages to Mecca traditionally stay at caravanserais, roadside inns, along the way, and these places have naturally served as hubs for gaining news of the world. In late medieval Britain, reports (\"tidings\") of major events were a topic of great public interest, as chronicled in Chaucer's 1380 The House of Fame and other works.\n\n\n=== Government proclamations ===\n\nBefore the invention of newspapers in the early 17th century, official government bulletins and edicts were circulated at times in some centralized empires. The first documented use of an organized courier service for the diffusion of written documents is in Egypt, where Pharaohs used couriers for the diffusion of their decrees in the territory of the State (2400 BC). Julius Caesar regularly publicized his heroic deeds in Gaul, and upon becoming Emperor of Rome began publishing government announcements called Acta Diurna. These were carved in metal or stone and posted in public places. In medieval England, parliamentary declarations were delivered to sheriffs for public display and reading at the market.Specially sanctioned messengers have been recognized in Vietnamese culture, among the Khasi people in India, and in the Fox and Winnebago cultures of the American midwest. The Zulu Kingdom used runners to quickly disseminate news. In West Africa, news can be spread by griots. In most cases, the official spreaders of news have been closely aligned with holders of political power.Town criers were a common means of conveying information to citydwellers. In thirteenth-century Florence, criers known as banditori arrived in the market regularly, to announce political news, to convoke public meetings, and to call the populace to arms. In 1307 and 1322–1325, laws were established governing their appointment, conduct, and salary. These laws stipulated how many times a banditoro was to repeat a proclamation (forty) and where in the city they were to read them. Different declarations sometimes came with additional protocols; announcements regarding the plague were also to be read at the city gates. These proclamations all used a standard format, beginning with an exordium—\"The worshipful and most esteemed gentlemen of the Eight of Ward and Security of the city of Florence make it known, notify, and expressly command, to whosoever, of whatever status, rank, quality and condition\"—and continuing with a statement (narratio), a request made upon the listeners (petitio), and the penalty to be exacted from those who would not comply (peroratio). In addition to major declarations, bandi (announcements) might concern petty crimes, requests for information, and notices about missing slaves. Niccolò Machiavelli was captured by the Medicis in 1513, following a bando calling for his immediate surrender. Some town criers could be paid to include advertising along with news.Under the Ottoman Empire, official messages were regularly distributed at mosques, by traveling holy men, and by secular criers. These criers were sent to read official announcements in marketplaces, highways, and other well-traveled places, sometimes issuing commands and penalties for disobedience.\n\n\n=== Early news networks ===\nThe spread of news has always been linked to the communications networks in place to disseminate it. Thus, political, religious, and commercial interests have historically controlled, expanded, and monitored communications channels by which news could spread. Postal services have long been closely entwined with the maintenance of political power in a large area.One of the imperial communication channels, called the \"Royal Road\" traversed the Assyrian Empire and served as a key source of its power. The Roman Empire maintained a vast network of roads, known as cursus publicus, for similar purposes.Visible chains of long distance signaling, known as optical telegraphy, have also been used throughout history to convey limited types of information. These can have ranged from smoke and fire signals to advanced systems using semaphore codes and telescopes. The latter form of optical telegraph came into use in Japan, Britain, France, and Germany from the 1790s through the 1850s.\n\n\n==== Asia ====\n\nThe world's first written news may have originated in eighth century BCE China, where reports gathered by officials were eventually compiled as the Spring and Autumn Annals. The annals, whose compilation is attributed to Confucius, were available to a sizeable reading public and dealt with common news themes—though they straddle the line between news and history. The Han dynasty is credited with developing one of the most effective imperial surveillance and communications networks in the ancient world. Government-produced news sheets, called tipao, circulated among court officials during the late Han dynasty (second and third centuries AD). Between 713 and 734, the Kaiyuan Za Bao (\"Bulletin of the Court\") of the Chinese Tang Dynasty published government news; it was handwritten on silk and read by government officials. The court created a Bureau of Official Reports (Jin Zhouyuan) to centralize news distribution for the court. Newsletters called ch'ao pao continued to be produced and gained wider public circulation in the following centuries. In 1582 there was the first reference to privately published newssheets in Beijing, during the late Ming Dynasty.Japan had effective communications and postal delivery networks at several points in its history, first in 646 with the Taika Reform and again during the Kamakura period from 1183–1333. The system depended on hikyaku, runners, and regularly spaced relay stations. By this method, news could travel between Kyoto and Kamakura in 5–7 days. Special horse-mounted messengers could move information at the speed of 170 kilometers per day. The Japanese shogunates were less tolerant than the Chinese government of news circulation. The postal system established during the Edo period was even more effective, with average speeds of 125–150 km/day and express speed of 200 km/day. This system was initially used only by the government, taking private communications only at exorbitant prices. Private services emerged and in 1668 established their own nakama (guild). They became even faster, and created an effective optical telegraphy system using flags by day and lanterns and mirrors by night.\n\n\n==== Europe ====\nIn Europe, during the Middle Ages, elites relied on runners to transmit news over long distances. At 33 kilometres per day, a runner would take two months to bring a message across the Hanseatic League from Bruges to Riga. In the early modern period, increased cross-border interaction created a rising need for information which was met by concise handwritten newssheets. The driving force of this new development was the commercial advantage provided by up-to-date news.In 1556, the government of Venice first published the monthly Notizie scritte, which cost one gazetta. These avvisi were handwritten newsletters and used to convey political, military, and economic news quickly and efficiently to Italian cities (1500–1700)—sharing some characteristics of newspapers though usually not considered true newspapers. Avvisi were sold by subscription under the auspices of military, religious, and banking authorities. Sponsorship flavored the contents of each series, which were circulated under many different names. Subscribers included clerics, diplomatic staff, and noble families. By the last quarter of the seventeenth century avvisi long passages from were finding their way into published monthlies such as the Mercure de France and, in northern Italy, Pallade veneta.\n\nPostal services enabled merchants and monarchs to stay abreast of important information. For the Holy Roman Empire, Emperor Maximillian I in 1490 authorized two brothers from the Italian Tasso family, Francesco and Janettto, to create a network of courier stations linked by riders. They began with a communications line between Innsbruck and Mechelen and grew from there. In 1505 this network expanded to Spain, new governed by Maximilian's son Philip. These riders could travel 180 kilometers in a day. This system became the Imperial Reichspost, administered by Tasso descendants (subsequently known as Thurn-und-Taxis), who in 1587 received exclusive operating rights from the Emperor. The French postal service and English postal service also began at this time, but did not become comprehensive until the early 1600s. In 1620, the English system linked with Thurn-und-Taxis.These connections underpinned an extensive system of news circulation, with handwritten items bearing dates and places of origin. Centred in Germany, the network took in news from Russia, the Balkans, Italy, Britain, France, and the Netherlands. The German lawyer Christoph von Scheurl and the Fugger house of Augsburg were prominent hubs in this network. Letters describing historically significant events could gain wide circulation as news reports. Indeed, personal correspondence sometimes acted only as a convenient channel through which news could flow across a larger network. A common type of business communication was a simple listing of current prices, the circulation of which quickened the flow of international trade. Businesspeople also wanted to know about events related to shipping, the affairs of other businesses, and political developments. Even after the advent of international newspapers, business owners still valued correspondence highly as a source of reliable news that would affect their enterprise. Handwritten newsletters, which could be produced quickly for a limited clientele, also continued into the 1600s.\n\n\n=== Rise of the newspaper ===\n\nThe spread of paper and the printing press from China to Europe preceded a major advance in the transmission of news. With the spread of printing presses and the creation of new markets in the 1500s, news underwent a shift from factual and precise economic reporting, to a more emotive and freewheeling format. (Private newsletters containing important intelligence therefore remained in use by people who needed to know.) The first newspapers emerged in Germany in the early 1600s. Relation aller Fürnemmen und gedenckwürdigen Historien, from 1605, is recognized as the world's first formalized 'newspaper'; while not a 'newspaper' in the modern sense, the Ancient Roman acta diurna served a similar purpose circa 131 BC.\nThe new format, which mashed together numerous unrelated and perhaps dubious reports from far-flung locations, created a radically new and jarring experience for its readers. A variety of styles emerged, from single-story tales, to compilations, overviews, and personal and impersonal types of news analysis.News for public consumption was at first tightly controlled by governments. By 1530, England had created a licensing system for the press and banned \"seditious opinions\". Under the Licensing Act, publication was restricted to approved presses—as exemplified by The London Gazette, which prominently bore the words: \"Published By Authority\". Parliament allowed the Licensing Act to lapse in 1695, beginning a new era marked by Whig and Tory newspapers. (During this era, the Stamp Act limited newspaper distribution simply by making them expensive to sell and buy.) In France, censorship was even more constant. Consequently, many Europeans read newspapers originating from beyond their national borders—especially from the Dutch Republic, where publishers could evade state censorship.The new United States saw a newspaper boom beginning with the Revolutionary era, accelerated by spirited debates over the establishment of a new government, spurred on by subsidies contained in the 1792 Postal Service Act, and continuing into the 1800s. American newspapers got many of their stories by copying reports from each other. Thus by offering free postage to newspapers wishing to exchange copies, the Postal Service Act subsidized a rapidly growing news network through which different stories could percolate. Newspapers thrived during the colonization of the West, fueled by high literacy and a newspaper-loving culture. By 1880, San Francisco rivaled New York in number of different newspapers and in printed newspaper copies per capita. Boosters of new towns felt that newspapers covering local events brought legitimacy, recognition, and community. The 1830s American, wrote Alexis de Tocqueville, was \"a very civilized man prepared for a time to face life in the forest, plunging into the wilderness of the New World with his Bible, ax, and newspapers.\" In France, the Revolution brought forth an abundance of newspapers and a new climate of press freedom, followed by a return to repression under Napoleon. In 1792 the Revolutionaries set up a news ministry called the Bureau d'Esprit.Some newspapers published in the 1800s and after retained the commercial orientation characteristic of the private newsletters of the Renaissance. Economically oriented newspapers published new types of data enabled the advent of statistics, especially economic statistics which could inform sophisticated investment decisions. These newspapers, too, became available for larger sections of society, not just elites, keen on investing some of their savings in the stock markets. Yet, as in the case other newspapers, the incorporation of advertising into the newspaper led to justified reservations about accepting newspaper information at face value. Economic newspapers also became promoters of economic ideologies, such as Keynesianism in the mid-1900s.Newspapers came to sub-Saharan Africa via colonization. The first English-language newspaper in the area was The Royal Gazette and Sierra Leone Advertiser, established in 1801, and followed by The Royal Gold Coast Gazette and Commercial Intelligencer in 1822 and the Liberia Herald in 1826. A number of nineteenth-century African newspapers were established by missionaries. These newspapers by and large promoted the colonial governments and served the interests of European settlers by relaying news from Europe. The first newspaper published in a native African language was the Muigwithania, published in Kikuyu by the Kenyan Central Association. Muigwithania and other newspapers published by indigenous Africans took strong opposition stances, agitating strongly for African independence. Newspapers were censored heavily during the colonial period—as well as after formal independence. Some liberalization and diversification took place in the 1990s.Newspapers were slow to spread to the Arab world, which had a stronger tradition of oral communication, and mistrust of the European approach to news reporting. By the end of the eighteenth century, the Ottoman Empire's leaders in Istanbul did monitor the European press, but its contents were not disseminated for mass consumption. Some of the first written news in modern North Africa arose in Egypt under Muhammad Ali, who developed the local paper industry and initiated the limited circulation of news bulletins called jurnals. Beginning in the 1850s and 1860s, the private press began to develop in the multi-religious country of Lebanon.\n\n\n=== Newswire ===\nThe development of the electrical telegraph, which often travelled along railroad lines, enabled news to travel faster, over longer distances. (Days before Morse's Baltimore–Washington line transmitted the famous question, \"What hath God wrought?\", it transmitted the news that Henry Clay and Theodore Frelinghuysen had been chosen by the Whig nominating party.) Telegraph networks enabled a new centralization of the news, in the hands of wire services concentrated in major cities. The modern form of these originated with Charles-Louis Havas, who founded Bureau Havas (later Agence France-Presse) in Paris. Havas began in 1832, using the French government's optical telegraph network. In 1840 he began using pigeons for communications to Paris, London, and Brussels. Havas began to use the electric telegraph when it became available.One of Havas's protoges, Bernhard Wolff, founded Wolffs Telegraphisches Bureau in Berlin in 1849. Another Havas disciple, Paul Reuter, began collecting news from Germany and France in 1849, and in 1851 immigrated to London, where he established the Reuters news agency—specializing in news from the continent. In 1863, William Saunders and Edward Spender formed the Central Press agency, later called the Press Association, to handle domestic news. Just before insulated telegraph line crossed the English Channel in 1851, Reuter won the right to transmit stock exchange prices between Paris and London. He maneuvered Reuters into a dominant global position with the motto \"Follow the Cable\", setting up news outposts across the British Empire in Alexandria (1865), Bombay (1866), Melbourne (1874), Sydney (1874), and Cape Town (1876). In the United States, the Associated Press became a news powerhouse, gaining a lead position through an exclusive arrangement with the Western Union company.The telegraph ushered in a new global communications regime, accompanied by a restructuring of the national postal systems, and closely followed by the advent of telephone lines. With the value of international news at a premium, governments, businesses, and news agencies moved aggressively to reduce transmission times. In 1865, Reuters had the scoop on the Lincoln assassination, reporting the news in England twelve days after the event took place. In 1866, an undersea telegraph cable successfully connected Ireland to Newfoundland (and thus the Western Union network) cutting trans-Atlantic transmission time from days to hours. The transatlantic cable allowed fast exchange of information about the London and New York stock exchanges, as well as the New York, Chicago, and Liverpool commodity exchanges—for the price of $5–10, in gold, per word. Transmitting On 11 May 1857, a young British telegraph operator in Delhi signaled home to alert the authorities of the Indian Rebellion of 1857. The rebels proceeded to disrupt the British telegraph network, which was rebuilt with more redundancies. In 1902–1903, Britain and the U.S. completed the circumtelegraphy of the planet with transpacific cables from Canada to Fiji and New Zealand (British Empire), and from the US to Hawaii and the occupied Philippines. U.S. reassertions of the Monroe Doctrine notwithstanding, Latin America was a battleground of competing telegraphic interests until World War I, after which U.S. interests finally did consolidate their power in the hemisphere.\n\nBy the turn of the century (i.e., circa 1900), Wolff, Havas, and Reuters formed a news cartel, dividing up the global market into three sections, in which each had more-or-less exclusive distribution rights and relationships with national agencies. Each agency's area corresponded roughly to the colonial sphere of its mother country. Reuters and the Australian national news service had an agreement to exchange news only with each other. Due to the high cost of maintaining infrastructure, political goodwill, and global reach, newcomers found it virtually impossible to challenge the big three European agencies or the American Associated Press. In 1890 Reuters (in partnership with the Press Association, England's major news agency for domestic stories) expanded into \"soft\" news stories for public consumption, about topics such as sports and \"human interest\". In 1904, the big three wire services opened relations with Vestnik, the news agency of Czarist Russia, to their group, though they maintained their own reporters in Moscow. During and after the Russian Revolution, the outside agencies maintained a working relationship with the Petrograd Telegraph Agency, renamed the Russian Telegraph Agency (ROSTA) and eventually the Telegraph Agency of the Soviet Union (TASS).The Chinese Communist Party created its news agency, the Red China News Agency, in 1931; its primary responsibilities were the Red China newspaper and the internal Reference News. In 1937, the Party renamed the agency Xinhua, New China. Xinhua became the official news agency of the People's Republic of China in 1949.These agencies touted their ability to distill events into \"minute globules of news\", 20–30 word summaries which conveyed the essence of new developments. Unlike newspapers, and contrary to the sentiments of some of their reporters, the agencies sought to keep their reports simple and factual. The wire services brought forth the \"inverted pyramid\" model of news copy, in which key facts appear at the start of the text, and more and more details included as it goes along. The sparse telegraphic writing style spilled over into newspapers, which often reprinted stories from the wire with little embellishment. In a 20 September 1918 Pravda editorial, Lenin instructed the Soviet press to cut back on their political rambling and produce many short anticapitalist news items in \"telegraph style\".As in previous eras, the news agencies provided special services to political and business clients, and these services constituted a significant portion of their operations and income. The wire services maintained close relationships with their respective national governments, which provided both press releases and payments. The acceleration and centralization of economic news facilitated regional economic integration and economic globalization. \"It was the decrease in information costs and the increasing communication speed that stood at the roots of increased market integration, rather than falling transport costs by itself. In order to send goods to another area, merchants needed to know first whether in fact to send off the goods and to what place. Information costs and speed were essential for these decisions.\n\n\n=== Radio and television ===\nThe British Broadcasting Company began transmitting radio news from London in 1922, dependent entirely, by law, on the British news agencies. BBC radio marketed itself as a news by and for social elites, and hired only broadcasters who spoke with upper-class accents. The BBC gained importance in the May 1926 general strike, during which newspapers were closed and the radio served as the only source of news for an uncertain public. (To the displeasure of many listeners, the BBC took an unambiguously pro-government stance against the strikers).In the USA, RCA's Radio Group established its radio network, NBC, in 1926. The Paley family founded CBS soon after. These two networks, which supplied news broadcasts to subsidiaries and affiliates, dominated the airwaves throughout the period of radio's hegemony as a news source. Radio broadcasters in the United States negotiated a similar arrangement with the press in 1933, when they agreed to use only news from the Press–Radio Bureau and eschew advertising; this agreement soon collapsed and radio stations began reporting their own news (with advertising). As in Britain, American news radio avoided \"controversial\" topics as per norms established by the National Association of Broadcasters. By 1939, 58% of Americans surveyed by Fortune considered radio news more accurate than newspapers, and 70% chose radio as their main news source. Radio expanded rapidly across the continent, from 30 stations in 1920 to a thousand in the 1930s. This operation was financed mostly with advertising and public relations money.The Soviet Union began a major international broadcasting operation in 1929, with stations in German, English and French. The Nazi Party made use of the radio in its rise to power in Germany, with much of its propaganda focused on attacking the Soviet Bolsheviks. The British and Italian foreign radio services competed for influence in North Africa. All four of these broadcast services grew increasingly vitriolic as the European nations prepared for war.The war provided an opportunity to expand radio and take advantage of its new potential. The BBC reported on Allied invasion of Normandy on 8:00 a.m. of the morning it took place, and including a clip from German radio coverage of the same event. Listeners followed along with developments throughout the day. The U.S. set up its Office of War Information which by 1942 sent programming across South America, the Middle East, and East Asia. Radio Luxembourg, a centrally located high-power station on the continent, was seized by Germany, and then by the United States—which created fake news programs appearing as though they were created by Germany. Targeting American troops in the Pacific, the Japanese government broadcast the \"Zero Hour\" program, which included news from the U.S. to make the soldiers homesick. But by the end of the war, Britain had the largest radio network in the world, broadcasting internationally in 43 different languages. Its scope would eventually be surpassed (by 1955) by the worldwide Voice of America programs, produced by the United States Information Agency.In Britain and the United States, television news watching rose dramatically in the 1950s and by the 1960s supplanted radio as the public's primary source of news. In the U.S., television was run by the same networks which owned radio: CBS, NBC, and an NBC spin-off called ABC. Edward R. Murrow, who first entered the public ear as a war reporter in London, made the big leap to television to become an iconic newsman on CBS (and later the director of the United States Information Agency).Ted Turner's creation of the Cable News Network (CNN) in 1980 inaugurated a new era of 24-hour satellite news broadcasting. In 1991, the BBC introduced a competitor, BBC World Service Television. Rupert Murdoch's Australian News Corporation entered the picture with Fox News Channel in the US, Sky News in Britain, and STAR TV in Asia. Combining this new apparatus with the use of embedded reporters, the United States waged the 1991–1992 Gulf War with the assistance of nonstop media coverage. CNN's specialty is the crisis, to which the network is prepared to shift its total attention if so chosen. CNN news was transmitted via INTELSAT communications satellites. CNN, said an executive, would bring a \"town crier to the global village\".In 1996, the Qatar-owned broadcaster Al Jazeera emerged as a powerful alternative to the Western media, capitalizing in part on anger in the Arab & Muslim world regarding biased coverage of the Gulf War. Al Jazeera hired many news workers conveniently laid off by BBC Arabic Television, which closed in April 1996. It used Arabsat to broadcast.\n\n\n=== Internet ===\nThe early internet, known as ARPANET, was controlled by the U.S. Department of Defense and used mostly by academics. It became available to a wider public with the release of the Netscape browser in 1994. At first, news websites were mostly archives of print publications. An early online newspaper was the Electronic Telegraph, published by The Daily Telegraph. A 1994 earthquake in California was one of the first big stories to be reported online in real time. In 1995, the release of web browser Netscape made news sites accessible to more people. On the day of the Oklahoma City bombing in April 1995, people flocked to newsgroups and chatrooms to discuss the situation and share information. The Oklahoma City Daily posted news to its site within hours. Two of the only news sites capable of hosting images, the San Jose Mercury News and Time magazine, posted photographs of the scene.Quantitatively, the internet has massively expanded the sheer volume of news items available to one person. The speed of news flow to individuals has also reached a new plateau. This insurmountable flow of news can daunt people and cause information overload. Zbigniew Brzezinski called this period the \"technetronic era\", in which \"global reality increasingly absorbs the individual, involves him, and even occasionally overwhelms him.\"In cases of government crackdowns or revolutions, the Internet has often become a major communication channel for news propagation; while it's a (relatively) simple act to shut down a newspaper, radio or television station, mobile devices such as smartphones and netbooks are much harder to detect and confiscate. The propagation of internet-capable mobile devices has also given rise to the citizen journalist, who provide an additional perspective on unfolding events.\n\n\n== News media today ==\nNews can travel through different communication media. In modern times, printed news had to be phoned into a newsroom or brought there by a reporter, where it was typed and either transmitted over wire services or edited and manually set in type along with other news stories for a specific edition. Today, the term \"breaking news\" has become trite as commercial broadcasting United States cable news services that are available 24 hours a day use live communications satellite technology to bring current events into consumers' homes as the event occurs. Events that used to take hours or days to become common knowledge in towns or in nations are fed instantaneously to consumers via radio, television, mobile phone, and the internet.\nSpeed of news transmission, of course, still varies wildly on the basis of where and how one lives.\n\n\n=== Newspaper ===\n\nMost large cities in the United States historically had morning and afternoon newspapers. With the addition of new communications media, afternoon newspapers have shut down and morning newspapers have lost circulation. Weekly newspapers have somewhat increased. In more and more cities, newspapers have established local market monopolies—i.e., a single newspaper is the only one in town. This process has accelerated since the 1980s, commensurate with a general trend of consolidation in media ownership. In China, too, newspapers have gained exclusive status, city-by-city, and pooled into large associations such as Chengdu Business News. These associations function like news agencies, challenging the hegemony of Xinhua as a news provider.The world's top three most circulated newspapers all publish from Japan.\nAbout one-third of newspaper revenue comes from sales; the majority comes from advertising. Newspapers have struggled to maintain revenue given declining circulation and the free flow of information over the internet; some have implemented paywalls for their websites.In the U.S., many newspapers have shifted their operations online, publishing around the clock rather than daily in order to keep pace with the internet society. Prognosticators have suggested that print newspapers will vanish from the U.S. in 5–20 years. Many newspapers have started to track social media engagement for trending news stories to cover. Spain's Público has reshaped their social media strategy and grew their audience by 40 %.\n\n\n=== Television ===\nInternationally distributed news channels include BBC News, CNN, Fox News, MSNBC, and Sky News. Televisions are densely concentrated in the United States (98% of households), and the average American watches 4 hours of television programming each day. In other parts of the world, such as Kenya—especially rural areas without much electricity—televisions are rare.The largest supplier of international video news is Reuters TV, with 409 subscribers in 83 countries, 38 bureaus, and a reported audience of 1.5 billion people each day. The other major video news service is Associated Press Television News. These two major agencies have agreements to exchange video news with ABC, NBC, CBS, CNN, and Eurovision—itself a sizeable video news exchange. CNN International is a notable broadcaster in times of crisis.\n\n\n=== Internet ===\nOnline journalism is news that is reported on the internet. News can be delivered more quickly through this method of news as well as accessed more easily. The internet era has transformed the understanding of news. Because the internet allows communication which is not only instantaneous, but also bi- or multi-directional, it has blurred the boundaries of who is a legitimate news producer. A common type of internet journalism is called blogging, which is a service of persistently written articles uploaded and written by one or more individuals. Millions of people in countries such as the United States and South Korea have taken up blogging. Many blogs have rather small audiences; some blogs are read by millions each month. Social media sites, especially Twitter and Facebook, have become an important source of breaking news information and for disseminating links to news websites. Twitter declared in 2012: \"It's like being delivered a newspaper whose headlines you'll always find interesting—you can discover news as it's happening, learn more about topics that are important to you, and get the inside scoop in real time.\" Cell phone cameras have normalized citizen photojournalism.Michael Schudson, professor at the Columbia University Graduate School of Journalism, has said that \"[e]verything we thought we once knew about journalism needs to be rethought in the Digital Age.\" Today the work of journalism can be done from anywhere and done well. It requires no more than a reporter and a laptop. In that way, journalistic authority seems to have become more individual- and less institution-based. But does the individual reporter always have to be an actual journalist? Or can journalistic work be done from anywhere and by anyone? These are questions that refer to the core of journalistic practice and the definition of \"news\" itself. As Schudson has given emphasis to, the answer is not easily found; \"the ground journalists walk upon is shaking, and the experience for both those who work in the field and those on the outside studying it is dizzying\".Schudson has identified the following six specific areas where the ecology of news in his opinion has changed:\n\nThe line between the reader and writer has blurred.\nThe distinction among tweet, blog post, Facebook, newspaper story, magazine article, and book has blurred.\nThe line between professionals and amateurs has blurred, and a variety of \"pro-am\" relationships has emerged.\nThe boundaries delineating for-profit, public, and non-profit media have blurred, and the cooperation across these models of financing has developed.\nWithin commercial news organizations, the line between the news room and the business office has blurred.\nThe line between old media and new media has blurred, practically beyond recognition.These alterations inevitably have fundamental ramifications for the contemporary ecology of news. \"The boundaries of journalism, which just a few years ago seemed relatively clear, and permanent, have become less distinct, and this blurring, while potentially the foundation of progress even as it is the source of risk, has given rise to a new set of journalistic principles and practices\", Schudson puts it. It is indeed complex, but it seems to be the future.\nOnline news has also changed the geographic reach of individual news stories, diffusing readership from city-by-city markets to a potentially global audience.The growth of social media networks have also created new opportunities for automated and efficient news gathering for journalists and newsrooms. Many newsrooms (broadcasters, newspapers, magazines, radio and TV) have started to perform news gathering on social media platforms. Social media is creating changes in the consumer behaviour and news consumption. According to a study by Pew Research, a large portion of Americans read news on digital and on mobile devices.\nBecause internet does not have the \"column inches\" limitation of print media, online news stories can, but don't always, come bundled with supplementary material. The medium of the world wide web also enables hyperlinking, which allows readers to navigate to other pages related to the one they're reading.Despite these changes, some studies have concluded that internet news coverage remains fairly homogenous and dominated by news agencies. And journalists working with online media do not identify significantly different criteria for newsworthiness than print journalists.\n\n\n== News agencies ==\n\nNews agencies are services which compile news and disseminate it in bulk. Because they disseminate information to a wide variety of clients, who repackage the material as news for public consumption, news agencies tend to use less controversial language in their reports. Despite their importance, news agencies are not well known by the general public. They keep low profiles and their reporters usually do not get bylines.The oldest news agency still operating is the Agence France-Presse (AFP). It was founded in 1835 by a Parisian translator and advertising agent, Charles-Louis Havas as Agence Havas. By the end of the twentieth century, Reuters far outpaced the other news agencies in profits, and became one of the largest companies in Europe. In 2011, Thomson Reuters employed more than 55,000 people in 100 countries, and posted an annual revenue of $12.9 billion.United Press International gained prominence as a world news agency in the middle of the twentieth century, but shrank in the 1980s and was sold off at low prices. It is owned by the Unification Church company News World Communications.\nNews agencies, especially Reuters and the newly important Bloomberg News, convey both news stories for mass audiences and financial information of interest to businesses and investors. Bloomberg LP, a private company founded by Michael Bloomberg in 1981, made rapid advances with computerized stock market reporting updated in real time. Its news service continued to exploit this electronic advantage by combining computer-generated analytics with text reporting. Bloomberg linked with Agence France Presse in the 1990s.Following the marketization of the Chinese economy and the media boom of the 1990s, Xinhua has adopted some commercial practices including subscription fees, but it remains government-subsidized. It provides newswire, news photos, economic information, and audio and video news. Xinhua has a growing number of subscribers, totaling 16,969 in 2002, including 93% of Chinese newspapers. It operates 123 foreign bureaus and produces 300 news stories each day.Other agencies with considerable reach include Deutsche Presse-Agentur (Germany), Kyodo News (Japan), the Agenzia Nazionale Stampa Associata (Italy), the Middle East News Agency (Egypt), Tanjug (Serbia), EFE (Spain), and Anadolu Agency (Turkey).On the internet, news aggregators play a role similar to that of the news agency—and, because of the sources they select, tend to transmit news stories which originate from the main agencies. Of articles displayed by Yahoo! News in the U.S., 91.7% come from news agencies: 39.4% from AP, 30.9% AFP, and 21.3% Reuters. In India, 60.1% of Yahoo! News stories come from Reuters. Google News relies somewhat less on news agencies, and has shown high volatility, in the sense of focusing heavily on the most recent handful of salient world events. In 2010, Google News redesigned its front page with automatic geotargeting, which generated a selection of local news items for every viewer.\n\n\n== Global news system ==\nIn the 20th century, global news coverage was dominated by a combination of the \"Big Four\" news agencies—Reuters, Associated Press, Agence France Press, and United Press International—representing the Western bloc, and the Communist agencies: TASS from the Soviet Union, and Xinhua from China. Studies of major world events, and analyses of all international news coverage in various newspapers, consistently found that a large majority of news items originated from the four biggest wire services.Television news agencies include Associated Press Television News, which bought and incorporated World Television News; and Reuters Television. Bloomberg News created in the 1990s, expanded rapidly to become a player in the realm of international news. The Associated Press also maintains a radio network with thousands of subscribers worldwide; it is the sole provider of international news to many small stations.By some accounts, dating back to the 1940s, the increasing interconnectedness of the news system has accelerated the pace of world history itself.\n\n\n=== New World Information and Communication Order ===\nThe global news system is dominated by agencies from Europe and the United States, and reflects their interests and priorities in its coverage. Euro-American control of the global news system has led to criticism; that events around the world are constantly compared to events like the Holocaust and World War II, which are considered foundational in the West. Since the 1960s, a significant amount of news reporting from the Third World has been characterized by some form \"development journalism\", a paradigm which focuses on long-term development projects, social change, and nation-building. When in 1987 the U.S. media reported on a riot in the Dominican Republic—the first major news item regarding that country in years—the resulting decline in tourism lasted for years and had a noticeable effect on the economy. The English language predominates in global news exchanges. Critics have accused the global news system of perpetuating cultural imperialism. Critics further charge that the Western media conglomerates maintain a bias towards the status quo economic order, especially a pro-corporate bias.The United Nations Educational, Scientific and Cultural Organization (UNESCO) has promoted a New World Information and Communication Order, which envisions an international news exchange system involving national news agencies in every country. UNESCO encouraged the new states formed from colonial territories in the 1960s to establish news agencies, to generate domestic news stories, exchange news items with international partners, and disseminate both types of news internally. Along these lines, the 1980 MacBride report, \"Many Voices, One World\", called for an interdependent global news system with more participation from different governments. To this end, also, UNESCO formed the Non-Aligned News Agencies Pool.The Inter Press Service, founded in 1964, has served as an intermediary for Third World press agencies. Inter Press Service's editorial policy favors coverage of events, institutions, and issues which relate to inequality, economic development, economic integration, natural resources, population, health, education, and sustainable development. It gives less coverage than other agencies to crime, disasters, and violence. Geographically, 70% of its news reporting concerns Africa, Asia, Latin America, and the Caribbean. IPS has the most subscribers in Latin America and southern Africa. IPS receives grants from organizations such as the United Nations Development Program and other United Nations agencies, Friedrich-Ebert-Stiftung, Federatie Nederlandse Vakbeweging, the Diocese of Graz, the Charles Stewart Mott Foundation, the Ford Foundation, the MacArthur Foundation, and the W. Alton Jones Foundation to report news on chosen topics, including the environment, sustainable development, and women's issues.Beginning in the 1960s, the United States Agency for International Development, the National Aeronautics and Space Administration, and UNESCO developed the use of satellite television for international broadcasting. In India, 1975–1976, these agencies implemented an experimental satellite television system, called the Satellite Instructional Television Experiment, with assistance from the Indian Space Research Organisation, and All India Radio.\n\n\n=== Further transformation in global news flow ===\nBy the 1980s, much of the Third World had succumbed to a debt crisis resulting from unrepayably large loans accumulated since the 1960s. At this point, the World Bank took an active role in the governance of many countries, and its authority extended to communications policy. The policy of developing Third World media gave way to a global regime of free trade institutions like the World Trade Organization, which also protected the free flow of information across borders. The World Bank also promoted privatization of national telecommunications, which afforded large multinational corporations the opportunity to purchase networks and expand operations in the Third World.In countries with less telecommunications infrastructure, people, especially youth, tend today to get their news predominantly from mobile phones and, less so, from the internet. Older folks listen more to the radio. The government of China is a major investor in Third World telecommunications, especially in Africa. Some issues relating to global information flow were revisited in light of the internet at the 2003/2005 World Summit on the Information Society, a conference which emphasized the role of civil society and the private sector in information society governance.\n\n\n== News values ==\n\nNews values are the professional norms of journalism. Commonly, news content should contain all the \"Five Ws\" (who, what, when, where, why, and also how) of an event. Newspapers normally place hard news stories on the first pages, so the most important information is at the beginning, enabling busy readers to read as little or as much as they desire. Local stations and networks with a set format must take news stories and break them down into the most important aspects due to time constraints.\nJournalists are often expected to aim for objectivity; reporters claim to try to cover all sides of an issue without bias, as compared to commentators or analysts, who provide opinion or personal points of view. The resulting articles lay out facts in a sterile, noncommittal manner, standing back to \"let the reader decide\" the truth of the matter. Several governments impose certain constraints against bias. In the United Kingdom, the government agency of Ofcom (Office of Communications) enforces a legal requirement of \"impartiality\" on news broadcasters. Both newspapers and broadcast news programs in the United States are generally expected to remain neutral and avoid bias except for clearly indicated editorial articles or segments. Many single-party governments have operated state-run news organizations, which may present the government's views.\nMid-twentieth-century news reporting in the United States focused on political and local issues with important socio-economic impacts, such as the landing of a living person on the moon or the cold war. The focus similarly remains on political and local issues; the news mass media now comes under criticism for over-emphasis on \"non-news\" and \"gossip\" such as celebrities' personal social issues, local issues of little merit, as well as biased sensationalism of political topics such as terrorism and the economy. The dominance of celebrity and social news, the blurring of the boundary between news and reality shows and other popular culture, and the advent of citizen journalism may suggest that the nature of 'news' and news values are evolving and that traditional models of the news process are now only partially relevant. Newsworthiness does not only depend on the topic, but also the presentation of the topic and the selection of information from that topic.\nAlthough newswriters have always laid claim to truth and objectivity, the modern values of professional journalism were established beginning in the late 1800s and especially after World War I, when groups like the American Society of Newspaper Editors codified rules for unbiased news reporting. These norms held the most sway in American and British journalism, and were scorned by some other countries. These ideas have become part of the practice of journalism across the world. Soviet commentators said stories in the Western press were trivial distractions from reality, and emphasized a socialist realism model focusing on developments in everyday life.Even in those situations where objectivity is expected, it is difficult to achieve, and individual journalists may fall foul of their own personal bias, or succumb to commercial or political pressure. Similarly, the objectivity of news organizations owned by conglomerated corporations fairly may be questioned, in light of the natural incentive for such groups to report news in a manner intended to advance the conglomerate's financial interests. Individuals and organizations who are the subject of news reports may use news management techniques to try to make a favourable impression. Because each individual has a particular point of view, it is recognized that there can be no absolute objectivity in news reporting. Journalists can collectively shift their opinion over what is a controversy up for debate and what is an established fact, as evidenced by homogenization during the 2000s of news coverage of climate change.Some commentators on news values have argued that journalists' training in news values itself represents a systemic bias of the news. The norm of objectivity leads journalists to gravitate towards certain types of acts and exclude others. A journalist can be sure of objectivity in reporting that an official or public figure has made a certain statement. This is one reason why so much news reporting is devoted to official statements. This lemma dates back to the early history of public news reporting, as exemplified by an English printer who on 12 March 1624 published news from Brussels in the form of letters, with the prefacing comment: \"Now because you shall not say, that either out of my owne conceit I misliked a phrase, or presumptuously tooke upon me to reforme any thing amisse, I will truly set you downe their owne words.\"Feminist critiques argue that discourse defined as objective by news organizations reflects a male-centered perspective. In their selection of sources, journalists rely heavily on men as sources of authoritative- and objective-seeming statements. News reporting has also tended to discuss women differently, usually in terms of appearance and relationship to men.The critique of traditional norms of objectivity comes from within news organizations as well. Said Peter Horrocks, head of television news at BBC: \"The days of middle-of-the-road, balancing Left and Right, impartiality are dead. […] we need to consider adopting what I like to think of as a much wider 'radical impartiality'—the need to hear the widest range of views—all sides of the story.\"\n\n\n== Social organization of news production ==\n\n\n=== News organizations ===\nViewed from a sociological perspective, news for mass consumption is produced in hierarchical organizations. Reporters, working near the bottom of the structure, are given significant autonomy in researching and preparing reports, subject to assignments and occasional intervention from higher decision-makers. Owners at the top of the news hierarchy influence the content of news indirectly but substantially. The professional norms of journalism discourage overt censorship; however, news organizations have covert but firm norms about how to cover certain topics. These policies are conveyed to journalists through socialization on the job; without any written policy, they simply learn how things are done. Journalists comply with these rules for various reasons, including job security. Journalists are also systematically influenced by their education, including journalism school.News production is routinized in several ways. News stories use familiar formats and subgenres which vary by topic. \"Rituals of objectivity\", such as pairing a quotation from one group with a quotation from a competing group, dictate the construction of most news narratives. Many news items revolve around periodic press conferences or other scheduled events. Further routine is established by assigning each journalist to a beat: a domain of human affairs, usually involving government or commerce, in which certain types of events routinely occur.A common scholarly frame for understanding news production is to examine the role of information gatekeepers: to ask why and how certain narratives make their way from news producers to news consumers. Obvious gatekeepers include journalists, news agency staff, and wire editors of newspapers. Ideology, personal preferences, source of news, and length of a story are among the many considerations which influence gatekeepers. Although social media have changed the structure of news dissemination, gatekeeper effects may continue due to the role of a few central nodes in the social network.New factors have emerged in internet-era newsrooms. One issue is \"click-thinking\", the editorial selection of news stories—and of journalists—who can generate the most website hits and thus advertising revenue. Unlike a newspaper, a news website has detailed data collection about which stories are popular and who is reading them. The drive for speedy online postings, some journalists have acknowledged, has altered norms of fact-checking so that verification takes place after publication.Journalists' sometimes unattributed echoing of other news sources can also increase the homogeneity of news feeds. The digital age can accelerate the problem of circular reporting: propagation of the same error through increasingly reliable sources. In 2009, a number of journalists were embarrassed after all reproducing a fictional quotation, originating from Wikipedia.News organizations have historically been male-dominated, though women have acted as journalists since at least the 1880s. The number of female journalists has increased over time, but organizational hierarchies remain controlled mostly by men. Studies of British news organizations estimate that more than 80% of decision-makers are men. Similar studies have found 'old boys' networks' in control of news organizations in the United States and the Netherlands. Further, newsrooms tend to divide journalists by gender, assigning men to \"hard\" topics like military, crime, and economics, and women to \"soft\", \"humanised\" topics.\n\n\n=== Relationship with institutions ===\nFor various reasons, news media usually have a close relationship with the state, and often church as well, even when they cast themselves in critical roles. This relationship seems to emerge because the press can develop symbiotic relationships with other powerful social institutions. In the United States, the Associated Press wire service developed a \"bilateral monopoly\" with the Western Union telegraph company.The news agencies which rose to power in the mid-1800s all had support from their respective governments, and in turn served their political interests to some degree. News for consumption has operated under statist assumptions, even when it takes a stance adversarial to some aspect of a government. In practice, a large proportion of routine news production involves interactions between reporters and government officials. Relatedly, journalists tend to adopt a hierarchical view of society, according to which a few people at the top of organizational pyramids are best situated to comment on the reality which serves as the basisi of news. Broadly speaking, therefore, news tends to normalize and reflect the interests of the power structure dominant in its social context.Today, international non-governmental organizations (NGOs) rival and may surpass governments in their influence on the content of news.\n\n\n=== State control ===\n\nGovernments use international news transmissions to promote the national interest and conduct political warfare, alternatively known as public diplomacy and, in the modern era, international broadcasting. International radio broadcasting came into wide-ranging use by world powers seeking cultural integration of their empires. The British government used BBC radio as a diplomatic tool, setting up Arabic, Spanish and Portuguese services in 1937. American propaganda broadcasters include Voice of America and Radio Free Europe/Radio Liberty, set up during the Cold War and still operating today. The United States remains the world's top broadcaster, although by some accounts it was surpassed for a time circa 1980 by the Soviet Union. Other major international broadcasters include the People's Republic of China, Taiwan, Germany, Saudi Arabia, Egypt, North Korea, India, Cuba, and Australia. Around the world (and especially, formerly, in the Soviet bloc), international news sources such as the BBC World Service are often welcomed as alternatives to domestic state-run media.Governments have also funneled programming through private news organizations, as when the British government arranged to insert news into the Reuters feed during and after World War Two. Past revelations have suggested that the U.S. military and intelligence agencies create news stories which they disseminate secretly into the foreign and domestic media. Investigation into the Central Intelligence Agency pursued in the 1970s found that it owned hundreds of news organizations (wire services, newspapers, magazines) outright. Soviet news warfare also involved the creation of front groups, like the International Organization of Journalists. The Russian KGB heavily pursued a strategy of disinformation, planting false stories which made their way to news outlets worldwide.Broadcasts into Iraq before the Second Gulf War mimicked the style of local programming. The US also launched Middle East Broadcasting Networks, featuring the satellite TV station Alhurra and radio station Radio Sawa to beam 24-hour programming to Iraq and environs.Today, Al Jazeera, a TV and internet news network owned by the government of Qatar, has become one of the foremost news sources in the world, appreciated by millions as an alternative to the Western media. State-owned China Central Television operates 18 channels and reaches more than a billion viewers worldwide. Iran's Press TV and Russia's Russia Today, branded as RT, also have multiplatform presences and large audiences.\n\n\n=== Public relations ===\n\nAs distinct from advertising, which deals with marketing distinct from news, public relations involves the techniques of influencing news in order to give a certain impression to the public. A standard public relations tactic, the \"third-party technique\", is the creation of seemingly independent organizations, which can deliver objective-sounding statements to news organizations without revealing their corporate connections. Public relations agencies can create complete content packages, such as Video News Releases, which are rebroadcast as news without commentary or detail about their origin. Video news releases seem like normal news programming, but use subtle product placement and other techniques to influence viewers.Public relations releases offer valuable newsworthy information to increasingly overworked journalists on deadline. (This pre-organized news content has been called an information subsidy.) The journalist relies on appearances of autonomy and even opposition to established interests—but the public relations agent seek to conceal their client's influence on the news,. Thus, public relations works its magic in secret.Public relations can dovetail with state objectives, as in the case of the 1990 news story about Iraqi soldiers taking \"babies out of incubators\" in Kuwaiti hospitals. During the Nigerian Civil War, both the federal government and the secessionist Republic of Biafra hired public relations firms, which competed to influence public opinion in the West, and between them established some of the key narratives employed in news reports about the war.Overall, the position of the public relations industry has grown stronger, while the position of news producers has grown weaker. Public relations agents mediate the production of news about all sectors of society.\n\n\n== News consumption ==\nOver the centuries, commentators on newspapers and society have repeatedly observed widespread human interest in news. Elite members of a society's political and economic institutions might rely on news as one limited source of information, for the masses, news represents a relatively exclusive window onto the operations by which a society is managed.Regular people in societies with news media often spend a lot of time reading or watching news reports. Newspapers became significant aspects of national and literary culture—as exemplified by James Joyce's Ulysses, which derives from the newspapers of June 16 (and thereabouts), 1904, and represents the newspaper office itself as a vital part of life in Dublin.A 1945 study by sociologist Bernard Berelson found that during the 1945 New York newspaper strike, New Yorkers exhibited a virtual addiction to news, describing themselves as \"lost\", \"nervous\", \"isolated\", and \"suffering\" due to the withdrawal. Television news has become still further embedded in everyday life, with specific programming anticipated at different times of day. Children tend to find the news boring, too serious, or emotionally disturbing. They come to perceive news as characteristic of adulthood, and begin watching television news in their teenage years because of the adult status it confers.People exhibit various forms of skepticism towards the news. Studies of tabloid readers found that many of them gain pleasure from seeing through the obviously fake or poorly constructed stories—and get their \"real news\" from television.\n\n\n=== Social and cultural cohesion ===\nAn important feature distinguishing news from private information transfers is the impression that when one reads (or hears, or watches) it, one joins a larger public. In this regard news serves to unify its receivers under the banner of a culture, or a society, as well as into the sub-demographics of a society targeted by their favorite kind of news. News thus plays a role in nation-building, the construction of a national identity.Images connected with news can also become iconic and gain a fixed role in the culture. Examples such as Alfred Eisenstaedt's photograph V-J Day in Times Square, Nick Ut's photograph of Phan Thi Kim Phuc and other children running from a napalm blast in Vietnam; Kevin Carter's photograph of a starving child being stalked by a vulture; etc.\nWith the new interconnectedness of global media, the experience of receiving news along with a world audience reinforces the social cohesion effect on a larger scale. As a corollary, global media culture may erode the uniqueness and cohesion of national cultures.\n\n\n=== Public sphere ===\nThis collective form experience can be understood to constitute a political realm or public sphere. In this view, the news media constitute a fourth estate which serves to check and balance the operations of government.This idea, at least as a goal to be sought, has re-emerged in the era of global communications. Today, unprecedented opportunities exist for public analysis and discussion of world events. According to one interpretation of the CNN effect, instantaneous global news coverage can rally public opinion as never before to motivate political action. In 1989, local and global communications media enabled instant exposure to and discussion of the Chinese government's actions in Tiananmen Square. The news about Tiananmen Square traveled over fax machine, telephone, newspaper, radio, and television, and continued to travel even after the government imposed new restrictions on local telecommunications.\n\n\n=== News events ===\nAs the technological means for disseminating news grew more powerful, news became an experience which millions of people could undergo simultaneously. Outstanding news experiences can exert profound influence on millions of people. Through its power to effect a shared experience, news events can mold the collective memory of a society.One type of news event, the media event, is a scripted pageant organized for mass live broadcast. Media events include athletic contests such as the Super Bowl and the Olympics, cultural events like awards ceremonies and celebrity funerals, and also political events such as coronations, debates between electoral candidates, and diplomatic ceremonies. These events typically unfold according to a common format which simplifies the transmission of news items about them. Usually they have the effect of increasing the perceived unity of all parties involved, which include the broadcasters and audience. Today, international events such as a national declaration of independence, can be scripted in advance with the major news agencies, with staff specially deployed to key locations worldwide in advance of the life news broadcast. Public relations companies can participate in these events as well.The perception that an ongoing crisis is taking place further increases the significance of live news. People rely on the news and constantly seek more of it, to learn new information and to seek reassurance amidst feelings of fear and uncertainty. Crises can also increase the effect of news on social cohesion, and lead the population of a country to \"rally\" behind its current leadership. The rise of a global news system goes hand in hand with the advent of terrorism and other sensational acts, which have power in proportion to the audience they capture. In 1979, the capture of American hostages in Iran dominated months of news coverage in the western media, gained the status of a \"crisis\", and influenced a presidential election.South Africans overwhelmingly describe the end of Apartheid as a source of the country's most important news. In the United States, news events such as the assassinations of the 1960s (of John F. Kennedy, Martin Luther King, Jr., and Robert F. Kennedy), the 1969 moon landing, the 1986 Challenger explosion, the 1997 death of Princess Diana, the intervention of the Supreme Court in the 2000 presidential election and the 2001 September 11 attacks. In Jordan, people cited numerous memorable news events involving death and war, including the death of King Hussein, Princess Diana, and Yitzhak Rabin. Positive news stories found memorable by Jordanians featured political events affecting their lives and families—such as the Israeli withdrawal from South Lebanon, and the Israel–Jordan peace treaty.News coverage can also shape collective memory in retrospect. A study of Israeli news coverage leading up to the media event of the nation's 60th birthday found that news coverage of events like the Holocaust, World War Two, and subsequent Israeli wars increased the perceived importance of these events in the minds of citizens.\n\n\n=== News making ===\nNews making is the act of making the news or doing something that is considered to be newsworthy. When discussing the act of news making, scholars refer to specific models. Five of these models are the Professional Model, Mirror Model, Organizational Model, Political Model, and Civic Journalism Model.The Professional Model is when skilled peoples put certain events together for a specific audience. The reaction of the audience is influential because it can determine the impact that the particular article or newspaper has on the readers. The Mirror Model states that news should reflect reality. This model aims to focus on particular events and provide accuracy in reporting. The Organizational Model is also known as the Bargaining Model. It focuses on influencing various news organizations by applying pressures to governmental processes. The Political Model outlines that news represents the ideological biases of the people as well as the various pressures of the political environment. This model mainly influences journalists and attempts to promote public opinion. The Civic Journalism Model is when the press discovers the concerns of the people and uses that to write stories. This allows the audience to play an active role in society.\nModels of news making help define what the news is and how it influences readers. But it does not necessarily account for the content of print news and online media. Stories are selected if they have a strong impact, incorporate violence and scandal, are familiar and local, and if they are timely.\nNews Stories with a strong impact can be easily understood by a reader. Violence and scandal create an entertaining and attention-grabbing story. Familiarity makes a story more relatable because the reader knows who is being talked about. Proximity can influence a reader more. A story that is timely will receive more coverage because it is a current event. The process of selecting stories coupled with the models of news making are how the media is effective and impactful in society.\n\n\n=== Psychological effects ===\n\nExposure to constant news coverage of war can lead to stress and anxiety. Television coverage of the destruction of the World Trade Center in 2001, which repeated the same footage over and over, led to symptoms of trauma experienced across the United States. Studies have indicated that children have been traumatized by exposure to television of other frightening events, including the Challenger disaster. Journalists themselves also experience trauma and guilt.Research also suggest that constant representations of violence in the news lead people to overestimate the frequency of its occurrence in the real world, thus increasing their level of fear in everyday situations.\n\n\n=== Influence ===\nThe content and style of news delivery certainly have effects on the general public, with the magnitude and precise nature of these effects being tough to determine experimentally. In Western societies, television viewing has been so ubiquitous that its total effect on psychology and culture leave few alternatives for comparison.News is the leading source of knowledge about global affairs for people around the world. According to agenda-setting theory, the general public will identify as its priorities those issues which are highlighted on the news. The agenda-setting model has been well-supported by research, which indicate that the public's self-reported concerns respond to changes in news coverage rather than changes in the underlying issue itself. The less an issue obviously affects people's lives, the bigger an influence media agenda-setting can have on their opinion of it. The agenda-setting power becomes even stronger in practice because of the correspondence in news topics promulgated by different media channels.\n\n\n== Influence of Sponsorship ==\nIt has been acknowledged that sponsorship has historically influenced various news stories. This history gained widespread attention following the release of the film Anchorman 2. One example in recent time is  the fact that Facebook has invested heavily in news sources and purchasing time on local news media outlets. Tech Crunch journalist Josh Constine even stated in February 2018 that the company \"stole the news business\" and used sponsorship to make many news publishers its \"ghostwriters.\" In January 2019, founder Mark Zuckerberg announced that he will spend $300 million in local news buys over a three year period.\n\n\n== See also ==\nToronto School of communication theory wikiglobals\n\n\n== References ==\n\n\n== Sources and further reading ==\nAllan, Stuart, News Culture. (2nd ed. McGraw Hill Open University Press, 2004. ISBN 0-335-21074-0)\nAyalon, Ami. The Press in the Arab Middle East: A History. (Oxford UP, 1995. ISBN 0-19-508780-1)\nBakker, Gerben. \"Trading Facts: Arrow's Fundamental Paradox and the Origins of Global News Networks\". In: International Communication and Global News Networks: Historical Perspectives. (Hampton Press, 2011).\nBerkowitz, Dan (ed.) Social Meanings of News: A Text Reader. (SAGE, 1997. ISBN 0-7619-0075-6)\nBoyd-Barrett, Oliver, and Tehri Rantanen (eds.). The Globalization of News. (SAGE, 1998. ISBN 0-7619-5386-8).\nChakravartty, Paula, and Katharine Sarikakis. Media Policy and Globalization. Palgrave Macmillan, 2006. ISBN 1-4039-7738-0\nCloud, Barbara. The Coming of the Frontier Press: How the West Was Really Won. (Northwestern UP, 2008. ISBN 978-0-8101-2508-7)\nCranfield, G.A. The Press and Society: From Caxton to Northcliffe. London: Longman, 1978. ISBN 0-582-48983-0\nDayan, Daniel, and Elihu Katz. Media Events: The Live Broadcasting of History. Harvard University Press, 1992. ISBN 0-674-55955-X\nDistelrath, Günther. \"The Development of the Information and Communication Systems in Germany and Japan up to the End of the Nineteenth Century.\" Senri Ethnological Studies 52, March, 2000.\nFang, Irving. A History of Mass Communication: Six Information Revolutions. Boston: Focal Press (Butterworth-Heineman), 1997. ISBN 0-240-80254-3\nFosu, Modestus. \"The Press and Political Participation: Newspapers and the Politics of Linguistic Exclusion and Inclusion in Ghana\". Dissertation accepted at University of Leeds Institute of Communication Studies, June 2004.\nFowler-Watt, Karen, and Stuart Allan. Journalism: New Challenges v. 1.02. Centre for Journalism & Communications, Bournemouth University, 2013. ISBN 978-1-910042-00-7\nGeniets, Anne. The Global News Challenge: Market Strategies of International Broadcasting Organizations in Developing Countries. New York: Taylor & Francis (Routledge), 2013. ISBN 978-0-415-64066-4\nHachten, William A, with Harva Hachten. The World News Prism: Changing Media of International Communication. Fourth edition. Iowa State University Press, 1996. ISBN 0-8138-1571-1\nHeyd, Uriel. Reading newspapers: press and public in eighteenth-century Britain and America. Oxford: Voltaire Foundation, 2012. ISBN 978-0-7294-1042-7\nHills, Jill. The Struggle for Control of Global Communication: The Formative Century. University of Illinois Press, 2002. ISBN 0-252-02757-4\nJohn, Richard R., and Jonathan Silberstein-Loeb, eds. Making News: The Political Economy of Journalism in Britain and America from the Glorious Revolution to the Internet (2015).\nKallioinen, Mika.\"Information, communication technology, and business in the nineteenth century: The case of a Finnish merchant house\". Scandinavian Economic History Review 52.1, 2004.\nKessler, Karlhenz. \"'Royal Roads' and Other Questions of the Neo-Assyrian Communication System\". Proceedings of the 10th Anniversary Symposium of the Neo-Assyrian Text Corpus Project: Helsinki, September 7–11, 1995.\nLampe, Markus, and Florian Ploeckl. \"Spanning the Globe: The Rise of Global Communications Systems and First Globalization\". Australian Economic History Review 54.3, November 2014.\nLim, Hyunyang Kim. \"'Take Writing': News, Information, And Documentary Culture in Late Medieval England\". Dissertation accepted at University of Maryland, 2006.\nManoff, Robert Karl, and Michael Schudson (eds.). Reading The News: A Pantheon Guide to Popular Culture. New York: Pantheon Books, 1986. ISBN 0-394-54362-9\nMcCusker, J.J., & C. Gravesteijn. The Beginnings of Commercial and Financial Journalism: The Commodity Price Currents, Exchange Rate Currents, and Money Currents of Early Modern Europe. Amsterdam: Neha, 1991. ISBN 90-71617-27-0\nMcNair, Brian. Cultural Chaos: Journalism, news and power in a globalised world. New York: Routledge (Informa), 2006. ISBN 978-0-415-33913-1\nMilner, Stephen J. \"'Fanno bandire, notificare, et expressamente comandare': Town Criers and the Information Economy of Renaissance Florence.\" I Tatti Studies in the Italian Renaissance 16.1/2, Fall 2013.\nMohammadi, Ali (ed.). International Communication and Globalization: A Critical Introduction. London: SAGE, 1997. ISBN 0-7619-5553-4\nNeiger, Motti, Oren Myers, and Eyal Zandberg. On Media Memory: Collective Memory in a New Media Age. Houndsmills, Basingstoke, UK: Palgrave Macmillan, 2011. ISBN 978-0-230-27568-3\nParenti, Michael. Inventing Reality: The Politics of News Media. New York: St. Martin's Press, 1993. ISBN 0-312-08629-6\nPark, Robert E. \"News as a Form of Knowledge: A Chapter in the Sociology of Knowledge\", American Journal of Sociology 45.5, March 1940.\nParsons, Wayne. The Power of the Financial Press: Journalism and economic opinion in Britain and America. Aldershot, England: Edward Elgar Publishing Limited, 1989. ISBN 1-85278-039-8\nPerse, Elizabeth M. Media Effects And Society. Mahwah, NJ: Lawrence Erlbau Associates, 2001. ISBN 0-8058-2505-3\nPettegree, Andrew. The Invention of News: How the World Came to Know About Itself. New Haven: Yale University Press, 2014. ISBN 978-0-300-17908-8\nRampton, Sheldon, and John Stauber. Trust Us, We're Experts: How Industry Manipulates Science and Gambles With Your Future. New York: Jeremy P. Tarcher/Putnam, 2001. ISBN 1-58542-059-X\nSalmon, Lucy Maynard. The Newspaper and the Historian. New York: Oxford University Press (American Branch), 1923.\nSchudson, Michael. Discovering the News: A Social History of American Newspapers. New York: Basic Books, Inc., 1978. ISBN 0-465-01669-3\nShoemaker, Pamela J. and Akiba A. Cohen (eds.). News Around the World: Content, Practitioners, and the Public. New York, Routledge, 2006. ISBN 0-415-97505-0\nSilberstein-Loeb, Jonathan. The International Distribution of News: The Associated Press, Press Association, and Reuters, 1848–1947 (2014)\nSilverblatt, Art, and Nikolai Zlobin. International Communications: A Media Literacy Approach. Armonk, NY: M.E. Sharpe, Inc., 2004. ISBN 0-7656-0974-6\nSmith, Anthony. The Newspaper: An International History. London: Thames & Hudson, 1979.\nStarr, Paul. The Creation of the Media: Political Origins of Modern Communication. New York: Basic Books, 2004. ISBN 0-465-08193-2\nStephens, Mitchell. A History of News: From the Drum to the Satellite. New York: Viking, 1988. ISBN 0-670-81378-8\nStraubhaar, Joseph, and Robert LaRose. Communications Media in the Information Society. Updated edition. Belmont, CA: Wadsworth Publishing Company (Thompson), 1997. ISBN 0-534-52128-2\nWenzlhuemer, Roland. Connecting the Nineteenth-Century World: The Telegraph and Globalization. Cambridge University Press, 2013. ISBN 978-1-107-02528-8\nWolfe, Thomas C. Governing Soviet Journalism: The Press and the Socialist Person After Stalin. Indiana University Press, 2005. ISBN 0-253-34589-8\nWood, James. History of International Broadcasting. London: Peter Peregrinus Ltd., 1992. ISBN 0-86341-281-5\nZhang, Xiantao. The Origins of the Modern Chinese Press: The influence of the Protestant missionary press in late Qing China. Abingdon, UK: Routledge, 2007. ISBN 0-415-38066-9\nZhong, Bu. \"Searching for Meaning: Multi-Level Cognitive Processing of News Decision Making Among U.S. and Chinese Journalists\". Dissertation accepted at University of Maryland, College Park, 2006.\n\n\n== External links ==\nNews media by country at Curlie(basis) (Mark Frauenfelder)\n\nChart – Real and Fake News (2014) (2016)/Pew Research Center"}