{"text": "An online newspaper is the online version of a newspaper, either as a stand-alone publication or as the online version of a printed periodical.\nGoing online created more opportunities for newspapers, such as competing with broadcast journalism in presenting breaking news in a more timely manner. The credibility and strong brand recognition of well established newspapers, and the close relationships they have with advertisers, are also seen by many in the newspaper industry as strengthening their chances of survival.  The movement away from the printing process can also help decrease costs. \nOnline newspapers, like printed newspapers, have legal restrictions regarding libel, privacy and copyright, also apply to online publications in most countries as in the UK.  Also, the UK Data Protection Act applies to online newspapers and news pages. Up to 2014, the PCC ruled in the UK, but there was no clear distinction between authentic online newspapers and forums or blogs.  In 2007, a ruling was passed to formally regulate UK-based online newspapers, news audio, and news video websites covering the responsibilities expected of them and to clear up what is, and what isn't, an online news publication.News reporters are being taught to shoot video and to write in the succinct manner necessary for internet news pages. Some newspapers have attempted to integrate the internet into every aspect of their operations, e.g., the writing of stories for both print and online, and classified advertisements appearing in both media, while other newspaper websites may be quite different from the corresponding printed newspaper.\n\n\n== History ==\nAn early example of an \"online only\" newspaper or magazine was (PLATO) News Report, an online newspaper created by Bruce Parrello in 1974 on the PLATO system at the University of Illinois. Beginning in 1987, the Brazilian newspaper Jornaldodia ran on the state-owned Embratel network, moving to the internet in the 1990s. By the late 1990s, hundreds of U.S. newspapers were publishing online versions, but did not yet offer much interactivity. One example is Britain's Weekend City Press Review, which provided a weekly news summary online beginning in 1995. Today, online news has become a huge part of society which leads people to argue whether or not it is good for society. Austra Taylor author of the popular book The Peoples Platform argues that online news does not provide the detail needed to fully understand what actually happened. It is more just a fast summary to inform people what happened, but does not give a solution or fixation to the problem.\n\n\n== Examples ==\nVery few newspapers in 2006 claimed to have made money from their websites, which were mostly free to all viewers. Declining profit margins and declining circulation in daily newspapers forced executives to contemplate new methods of obtaining revenue from websites, without charging for subscription. This has been difficult. Newspapers with specialized audiences such as The Wall Street Journal and The Chronicle of Higher Education successfully charge subscription fees. Most newspapers have an online edition, including The Los Angeles Times, The Washington Post, USA Today, Mid Day, and The New York Times.\nThe Guardian experimented with new media in 2005, offering a free twelve-part weekly podcast series by Ricky Gervais. Another UK daily to go online is The Daily Telegraph.\nIn Australia, most major newspapers offer an online version, with or without a paywalled subscription option.\nIn Algeria, the number of daily visitors of news websites and online editions of newspapers surpasses the number of daily readers of print newspapers since the end of 2016.\n\n\n== Online-only newspapers ==\nAn online-only paper has no print-media connections. An example is the UK Southport Reporter, introduced in 2000—a weekly regional newspaper that is not produced or run in any format than 'soft-copy' on the internet by its publishers, PCBT Photography.  Unlike blog sites and other news websites, it is run as a newspaper and is recognized by media groups such as the NUJ and/or the IFJ. They fall under relevant press regulations and are signed up to the official UK press regulator IMPRESS. \n[[Bangladesh 1st online news site Rangpur crime news\nallNovaScotia is an online newspaper based in Halifax, Nova Scotia, Canada that publishes business and political news six days a week. The website was the first online-only newspaper in Atlantic Canada and has been behind a paywall since starting in 2001.Even print media is turning to online only publication.  As of 2009, the decrease of the traditional business model of print newspapers has led to various attempts to establish local, regional or national online-only newspapers - publications that do original reporting, rather than just commentary or summaries of reporting from other publications. An early major example in the U.S. is the Seattle Post-Intelligencer, which stopped publishing after 149 years in March 2009 and went online only. In Scotland, in 2010, Caledonian Mercury became Scotland's first online-only newspaper, with the same aims as Southport Reporter in the UK, with The Yorkshire Times following suit and becoming Yorkshire's first online-only paper in 2011.\nIn the US, technology news websites such as CNET, TechCrunch, and ZDNet started as web publications and enjoy comparable readership to the conventional newspapers. Also, with the ever-rising popularity of online media, veteran publications like the U.S. News & World Report are abandoning print and going online-only. Another example of an online-only English daily newspaper is the Arabian Post,  focussing on the Middle East's current affairs and business.\n\n\n== Trends ==\nIn 2015 55 percent of people reported that print was their preferred method for reading a newspaper, down 4% from 2014. The methods people use to get their news from digital means was at 28%, as opposed to 20% of people attaining the news through print newspapers. These trends indicate an increase in digital consumption of newspapers, as opposed to print. Today, ad revenue for digital forms of newspapers is nearly 25%, while print is constituting the remaining 75%. Contrastingly, ad revenue for digital methods was 5% in 2006.\n\n\n== Hybrid newspapers ==\nHybrid newspapers are predominantly focused on online content, but also produce a print form. Trends in online newspapers indicate publications may switch to digital methods, especially online newspapers in the future. The New York Times is an example of this model of newspaper as it provides both a home delivery print subscription and a digital one as well. There are some newspapers which are predominantly online, but also provide limited hard copy publishing[11] An example is annarbor.com, which replaced the Ann Arbor News in the summer of 2009. It is primarily an online newspaper, but publishes a hard copy twice a week.[12] Other trends indicate that this business model is being adopted by many newspapers with the growth of digital media.\n\n\n== Use ==\nIn 2013, the Reuters Institute commissioned a cross-country survey on news consumption, and gathered data related to online newspaper use that emphasize the lack of use of paid online newspaper services. The countries surveyed were France, German, Denmark, Spain, Italy, Japan, Brazil, the United States, and the United Kingdom. All samples within each country were nationally representative. Half of the sample reportedly paid for a print newspaper in the past 7 days, and only one-twentieth of the sample paid for online news in the past 7 days. That only 5% of the sample had recently paid for online newspaper access is likely because most people access news that is free. People with portable devices, like tablets or smartphones, were significantly more likely to subscribe to digital news content. Additionally, younger people—25- to 34-year-olds—are more willing to pay for digital news than older people across all countries. This is in line with the Pew Research Center’s finding in a survey of U.S. Americans that the Internet is a leading source of news for people less than 50.\n\n\n== See also ==\nDigital media\nElectronic journalism\nHistory of French journalism\nInternet\nInternet radio\nInternet television\nNewspaper\nOnline magazine\nWorld Wide Web\nList of online newspaper archives\n\n\n== References ==\n\n\n== Further reading ==\nHerre van Oostendorp & Christof van Nimwegen (September 1998). \"Locating Information in an Online Newspaper\" (PDF). Journal of Computer-Mediated Communication. 4 (1).\nHsiang Iris Chyi & George Sylvie (1998). \"Competing With Whom? Where? And How? A Structural Analysis of the Electronic Newspaper Market\". Journal of Media Economics. 11 (2): 1–18. doi:10.1207/s15327736me1102_1.\nCARINA IHLSTRÖM; MARIA ÅKESSON; an STIG NORDQVIST (2004-07-07). \"FROM PRINT TO WEB TO E-PAPER — THE CHALLENGE OF DESIGNING THE E-NEWSPAPER\" (PDF).\nHanluain, D. O. (2004-02-13). \"Free content becoming thing of the past for UK's online newspaper sites\". Online Journalism Review.\nHsiang Iris Chyi & Dominic L. Lasorsa (2002). \"An Explorative Study on the Market Relation Between Online and Print Newspapers\". Journal of Media Economics. 15 (2): 91–106. doi:10.1207/S15327736ME1502_2.\n\n\n== External links ==\nList of online Newspapers by country at Newspapers List\nOnline newspapers at Curlie\nOnline archive of newspapers at Google News Archive\nUS newspaper and obituaries directory at LDS Genealogy"}