{"text": "This article lists the attendance of many sports competitions around the world, based in some cases on the number of tickets sold or given away, rather than people actually present. The list is almost exclusively field and arena ball sports. Top leagues in weekly attendance includes speedway sports.\n\n\n== Domestic professional leagues ==\n\n\n=== Top 10 stadiums in total attendance in a calendar year ===\n\n\n=== Top 10 leagues in average attendance ===\nAs of 6 June 2019\n\n\n=== Highest attended leagues by sport ===\n\n\n=== Top leagues in weekly attendance ===\nNote that other ticketed activities in motor sports such as practices and qualifying are not included in the number of \"games\" in a week.\n\n* Games in a week only by team\n* Weekly attendance only by team\n\n\n== Top leagues in recent domestic club championship event attendance ==\n\nThis section lists the most recent attendances at annual championship events (single decider matches or the final match in a best-of series only) by total attendance. It also includes domestic leagues and competitions. Additionally, it includes the finals of top-level promotion playoffs, in which teams play to determine potential or confirmed promotion to a country's top league level in the next season. It has to be noted that the listed crowd figures are often a reflection of a championship venue's capacity, as demand for these events is generally so high that any stadium or arena would be filled to capacity.\nThe method by which championship venue(s) are determined can indirectly affect the attendance of such a match.\nIn most competitions that use a best-of final series, each individual match typically takes place at one team's home venue. In the Philippine Basketball Association, a competition in which no team has its own home arena, finals matches (including any that can potentially end a series) are held at three large venues in or near Metro Manila: Smart Araneta Coliseum, Mall of Asia Arena and sometimes Philippine Arena.\nIn most competitions that have a one-off final, the site is determined well in advance. Some competitions have a permanent site for their finals. Two notable examples are the Australian Football League, whose Grand Final is always at the Melbourne Cricket Ground (MCG), and the Gaelic Athletic Association, which holds its final matches in Gaelic football and hurling at Croke Park. Others determine the final venue anywhere from months to years before the event, such as the NFL, which determines the host of the Super Bowl more than three years in advance.\nHowever, one transnational club event in rugby union (whose final attendance is listed in a separate table) uses a very different system. In Super Rugby, the final is awarded to the finalist that finished higher in the league table during the regular season. Another transnational club event in the same sport, Pro14 (originally the Celtic League), used the same method to determine the host of its final until 2015, when it began to use a predetermined site.\nAs of the 2018 season, all 10 American college sports conferences that sponsor football in the top-level Division I FBS hold season-ending conference championship games in that sport. Of these leagues, six have a permanent site for their title games and four award hosting rights to the division champion with the better record in conference play (with tiebreakers used as needed).\nFor the purposes of this table, \"domestic\" is defined to include leagues which are historically focused in one country, but may have teams in one or more nearby countries. Examples of this phenomenon include:\n\nOf the six largest professional leagues in English-speaking North America, only the two gridiron football leagues—the NFL and CFL—operate on one side of the U.S.–Canada border. Of the four traditional \"major leagues\", only the NHL has more than one team in Canada; as of the upcoming 2019–20 season, it has 24 teams in the U.S. and seven in Canada, and will add one U.S. team for 2021–22. Major League Soccer, in recent years becoming increasingly accepted as a fifth \"major league\", currently has 21 U.S. teams and three Canadian teams, and will add three more U.S. teams by 2021.\nThe Gaelic Athletic Association, which governs Gaelic games, is mostly restricted to the island of Ireland, although teams from London and New York City participate in its senior championships.\nTwo major Australian leagues—the National Rugby League (rugby league) and A-League (association football)—have included a team from New Zealand since their inception.\nThe vast majority of the teams competing in rugby league's Super League have been from England. Only three teams from outside the country, two from France and one from Wales, have ever competed in the league, and only one of these teams (from France) currently competes at this level.\nAlthough the Challenge Cup of rugby league currently includes teams from France, Ireland, Scotland, Serbia, and Wales, and has in the past also had teams from Canada and Russia, the overwhelming majority of the competing teams are from England.\nThe English association football pyramid includes several clubs from Wales, although Welsh clubs do not necessarily participate at every level in a given season. As of the current 2019–20 season, no Welsh teams play in the Premier League following the relegation of Cardiff City, which had played at that level in 2013–14 and 2018–19. Swansea City played in the Premier League from 2011–12 to 2017–18.\nThe Kontinental Hockey League is headquartered in Moscow and is mostly a Russian league, although in its most recent 2018–19 season it also had teams in Belarus, China, Finland, Kazakhstan, Latvia, and Slovakia.The EuroLeague in basketball is transnational in that it includes teams from multiple European countries, but is domestic in the sense of being a championship for the single entity of Europe. It is governed by Euroleague Basketball, an explicitly pan-European body that is independent of the continental governing body of FIBA Europe.\nThis contrasts with leagues such as Super Rugby and Pro14, which operate in multiple countries with more than one team in most (Super Rugby) or all (Pro14) of their participating countries, and also make no pretense of being a championship for a continental-size region.\n\n\n== Semi-professional and amateur leagues ==\n\nThis section lists college and amateur leagues by total attendance. Remaining amateurism requirements in the majority of top-level sports were dropped in the late 20th century, and there are now only a few amateur leagues which are of interest to a wide public.  In the United States, college sports are very popular and at least one significant ice hockey league retains an amateur requirement.  In Ireland, the All-Ireland senior championships in Gaelic football and hurling, both operated by the Gaelic Athletic Association, which continues to prohibit professionalism, each draw over 80,000 to fill Croke Park for the respective finals.The NCAA championships listed here are all composed of several separate conferences with varying attendance levels. For example, in American football, per-game home attendances for the highest level of competition, Division I FBS, in the 2018 season ranged from 15,458 for Mid-American Conference teams to 73,994 for Southeastern Conference teams. NCAA Division I FBS football has the 2nd highest average attendance worldwide for any league-wide sport (behind the National Football League) and the 2nd highest overall attendance worldwide (behind Major League Baseball).  For college baseball,\nDudy Noble Field, Polk-DeMent Stadium at Mississippi State University holds the on-campus attendance record at 15,586 and all of college baseball's Top 11 on-campus largest crowds.\n\n\n== Representative matches ==\nThis list covers special annual matches for representative sides that are not covered elsewhere by international or domestic fixtures. They include state or regional matches, annual commemorative games and publicly voted all-star selections. This type of event is unknown within European nations, except in basketball; many European domestic leagues in that sport hold an all-star game at roughly the midpoint of the regular season.\n\n\n== International club competitions ==\nThis section lists the attendances at international competitions between sport clubs, ranked by total attendance. These are usually organised on a continental basis. The teams which compete in these tournaments also compete in the domestic competitions in their home countries.\n\n1 Current competition 2 Group stage only 3 This includes all stages except for the Euroleague Final Four.\n\n\n== International tournaments ==\nThis section lists the attendances at international competitions between national teams. These are usually organised on a continental basis. The teams which compete in these tournaments may also have competed in qualifying tournaments. The winners of continental championships usually play in a world cup or championship.\n\n1The World Baseball Classic and World Cup of Hockey are hosted in different regions of the world to boost attendance, as opposed to being hosted in one region like other international tournaments.\n\n\n== International club championship final events ==\nThese are restricted to final matches of international club events.\n\n\n== International club competition final (two decider matches) ==\nThese are restricted to final matches of international club events, played in a two-legged tie format. The two matches may be held in one or two different venues.\n\n\n== See also ==\n\nList of National Football League attendance figures\nList of Major League Baseball attendance figures\nList of National Hockey League attendance figures\nList of professional sports leagues by revenue\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nFootball Stadiums\nBest Attendances in Brasil (football/soccer)\nStadium Attendances of soccer and rugby games, huge details on French soccer league\nAverage Attendances"}