{"text": "Sport includes all forms of competitive physical activity or games which, through casual or organised participation, aim to use, maintain or improve physical ability and skills while providing enjoyment to participants, and in some cases, entertainment for spectators. Hundreds of sports exist, from those between single contestants, through to those with hundreds of simultaneous participants, either in teams or competing as individuals. In certain sports such as racing, many contestants may compete, simultaneously or consecutively, with one winner; in others, the contest (a match) is between two sides, each attempting to exceed the other. Some sports allow a \"tie\" or \"draw\", in which there is no single winner; others provide tie-breaking methods to ensure one winner and one loser. A number of contests may be arranged in a tournament producing a champion. Many sports leagues make an annual champion by arranging games in a regular sports season, followed in some cases by playoffs.\nSport is generally recognised as system of activities which are based in physical athleticism or physical dexterity, with the largest major competitions such as the Olympic Games admitting only sports meeting this definition, and other organisations such as the Council of Europe using definitions precluding activities without a physical element from classification as sports. However, a number of competitive, but non-physical, activities claim recognition as mind sports. The International Olympic Committee (through ARISF) recognises both chess and bridge as bona fide sports, and SportAccord, the international sports federation association, recognises five non-physical sports: bridge, chess, draughts (checkers), Go and xiangqi, and limits the number of mind games which can be admitted as sports.Sport is usually governed by a set of rules or customs, which serve to ensure fair competition, and allow consistent adjudication of the winner. Winning can be determined by physical events such as scoring goals or crossing a line first. It can also be determined by judges who are scoring elements of the sporting performance, including objective or subjective measures such as technical performance or artistic impression.\nRecords of performance are often kept, and for popular sports, this information may be widely announced or reported in sport news. Sport is also a major source of entertainment for non-participants, with spectator sport drawing large crowds to sport venues, and reaching wider audiences through broadcasting. Sport betting is in some cases severely regulated, and in some cases is central to the sport.\nAccording to A.T. Kearney, a consultancy, the global sporting industry is worth up to $620 billion as of 2013. The world's most accessible and practised sport is running, while association football is the most popular spectator sport.\n\n\n== Meaning and usage ==\n\n\n=== Etymology ===\nThe word \"sport\" comes from the Old French desport meaning \"leisure\", with the oldest definition in English from around 1300 being \"anything humans find amusing or entertaining\".Other meanings include gambling and events staged for the purpose of gambling; hunting; and games and diversions, including ones that require exercise. Roget's defines the noun sport as an \"activity engaged in for relaxation and amusement\" with synonyms including diversion and recreation.\n\n\n=== Nomenclature ===\nThe singular term \"sport\" is used in most English dialects to describe the overall concept (e.g. \"children taking part in sport\"), with \"sports\" used to describe multiple activities (e.g. \"football and rugby are the most popular sports in England\"). American English uses \"sports\" for both terms.\n\n\n=== Definition ===\n\nThe precise definition of what separates a sport from other leisure activities varies between sources. The closest to an international agreement on a definition is provided by SportAccord, which is the association for all the largest international sports federations (including association football, athletics, cycling, tennis, equestrian sports, and more), and is therefore the de facto representative of international sport.\nSportAccord uses the following criteria, determining that a sport should:\nhave an element of competition\nbe in no way harmful to any living creature\nnot rely on equipment provided by a single supplier (excluding proprietary games such as arena football)\nnot rely on any \"luck\" element specifically designed into the sport.They also recognise that sport can be primarily physical (such as rugby or athletics), primarily mind (such as chess or Go), predominantly motorised (such as Formula 1 or powerboating), primarily co-ordination (such as billiard sports), or primarily animal-supported (such as equestrian sport).The inclusion of mind sports within sport definitions has not been universally accepted, leading to legal challenges from governing bodies in regards to being denied funding available to sports. Whilst SportAccord recognises a small number of mind sports, it is not open to admitting any further mind sports.\nThere has been an increase in the application of the term \"sport\" to a wider set of non-physical challenges such as video games, also called esports, especially due to the large scale of participation and organised competition, but these are not widely recognised by mainstream sports organisations. According to Council of Europe, European Sports Charter, article 2.i, \"'Sport' means all forms of physical activity which, through casual or organised participation, aim at expressing or improving physical fitness and mental well-being, forming social relationships or obtaining results in competition at all levels.\"\n\n\n=== Competition ===\nThere are opposing views on the necessity of competition as a defining element of a sport, with almost all professional sport involving competition, and governing bodies requiring competition as a prerequisite of recognition by the International Olympic Committee (IOC) or SportAccord.Other bodies advocate widening the definition of sport to include all physical activity. For instance, the Council of Europe include all forms of physical exercise, including those competed just for fun.\nIn order to widen participation, and reduce the impact of losing on less able participants, there has been an introduction of non-competitive physical activity to traditionally competitive events such as school sports days, although moves like this are often controversial.In competitive events, participants are graded or classified based on their \"result\" and often divided into groups of comparable performance, (e.g. gender, weight and age). The measurement of the result may be objective or subjective, and corrected with \"handicaps\" or penalties. In a race, for example, the time to complete the course is an objective measurement. In gymnastics or diving the result is decided by a panel of judges, and therefore subjective. There are many shades of judging between boxing and mixed martial arts, where victory is assigned by judges if neither competitor has lost at the end of the match time.\n\n\n== History ==\n\nArtifacts and structures suggest sport in China as early as 2000 BC. Gymnastics appears to have been popular in China's ancient past. Monuments to the Pharaohs indicate that a number of sports, including swimming and fishing, were well-developed and regulated several thousands of years ago in ancient Egypt. Other Egyptian sports included javelin throwing, high jump, and wrestling. Ancient Persian sports such as the traditional Iranian martial art of Zourkhaneh had a close connection to warfare skills. Among other sports that originated in ancient Persia are polo and jousting.\n\nA wide range of sports were already established by the time of Ancient Greece and the military culture and the development of sport in Greece influenced one another considerably. Sport became such a prominent part of their culture that the Greeks created the Olympic Games, which in ancient times were held every four years in a small village in the Peloponnesus called Olympia.Sports have been increasingly organised and regulated from the time of the ancient Olympics up to the present century. Industrialisation has brought increased leisure time, letting people attend and follow spectator sports and participate in athletic activities. These trends continued with the advent of mass media and global communication. Professionalism became prevalent, further adding to the increase in sport's popularity, as sports fans followed the exploits of professional athletes – all while enjoying the exercise and competition associated with amateur participation in sports. Since the turn of the 21st century, there has been increasing debate about whether transgender sportspersons should be able to participate in sport events that conform with their post-transition gender identity.\n\n\n== Fair play ==\n\n\n=== Sportsmanship ===\n\nSportsmanship is an attitude that strives for fair play, courtesy toward teammates and opponents, ethical behaviour and integrity, and grace in victory or defeat.Sportsmanship expresses an aspiration or ethos that the activity will be enjoyed for its own sake. The well-known sentiment by sports journalist Grantland Rice, that it's \"not that you won or lost but how you played the game\", and the modern Olympic creed expressed by its founder Pierre de Coubertin: \"The most important thing... is not winning but taking part\" are typical expressions of this sentiment.\n\n\n=== Cheating ===\n\nKey principles of sport include that the result should not be predetermined, and that both sides should have equal opportunity to win. Rules are in place to ensure fair play, but participants can break these rules in order to gain advantage.\nParticipants may cheat in order to unfairly increase their chance of winning, or in order to achieve other advantages such as financial gains. The widespread existence of gambling on the results of sports fixtures creates a motivation for match fixing, where a participant or participants deliberately work to ensure a given outcome rather than simply playing to win.\n\n\n=== Doping and drugs ===\n\nThe competitive nature of sport encourages some participants to attempt to enhance their performance through the use of medicines, or through other means such as increasing the volume of blood in their bodies through artificial means.\nAll sports recognised by the IOC or SportAccord are required to implement a testing programme, looking for a list of banned drugs, with suspensions or bans being placed on participants who test positive for banned substances.\n\n\n=== Violence ===\nViolence in sports involves crossing the line between fair competition and intentional aggressive violence. Athletes, coaches, fans, and parents sometimes unleash violent behaviour on people or property, in misguided shows of loyalty, dominance, anger, or celebration. Rioting or hooliganism by fans in particular is a problem at some national and international sporting contests.\n\n\n== Participation ==\n\n\n=== Gender participation ===\n\nFemale participation in sports continues to rise alongside the opportunity for involvement and the value of sports for child development and physical fitness. Despite gains during the last three decades, a gap persists in the enrollment figures between male and female players. Female players account for 39% of the total participation in US interscholastic athletics. Gender balance has been accelerating from a 32% increase in 1973–74 to a 63% increase in 1994–95. Hessel (2000).\n\n\n=== Youth participation ===\n\nYouth sport presents children with opportunities for fun, socialisation, forming peer relationships, physical fitness, and athletic scholarships. Activists for education and the war on drugs encourage youth sport as a means to increase educational participation and to fight the illegal drug trade. According to the Center for Injury Research and Policy at Nationwide Children's Hospital, the biggest risk for youth sport is death or serious injury including concussion. These risks come from running, basketball, association football, volleyball, gridiron, gymnastics, and ice hockey. Youth sport in the US is a $15 billion industry including equipment up to private coaching.\n\n\n=== Disabled participation ===\n\nDisabled sports also adaptive sports or parasports, are sports played by persons with a disability, including physical and intellectual disabilities. As many of these are based on existing sports modified to meet the needs of persons with a disability, they are sometimes referred to as adapted sports. However, not all disabled sports are adapted; several sports that have been specifically created for persons with a disability have no equivalent in able-bodied sports.\n\n\n=== Spectator involvement ===\n\nThe competition element of sport, along with the aesthetic appeal of some sports, result in the popularity of people attending to watch sport being played. This has led to the specific phenomenon of spectator sport.\nBoth amateur and professional sports attract spectators, both in person at the sport venue, and through broadcast media including radio, television and internet broadcast. Both attendance in person and viewing remotely can incur a sometimes substantial charge, such as an entrance ticket, or pay-per-view television broadcast.\nIt is common for popular sports to attract large broadcast audiences, leading to rival broadcasters bidding large amounts of money for the rights to show certain fixtures. The football World Cup attracts a global television audience of hundreds of millions; the 2006 final alone attracted an estimated worldwide audience of well over 700 million and the 2011 Cricket World Cup Final  attracted an estimated audience of 135 million in India alone.In the United States, the championship game of the NFL, the Super Bowl, has become one of the most watched television broadcasts of the year.\nSuper Bowl Sunday is a de facto national holiday in America; the viewership being so great that in 2015, advertising space was reported as being sold at $4.5m for a 30-second slot.\n\n\n== Amateur and professional ==\n\nSport can be undertaken on an amateur, professional or semi-professional basis, depending on whether participants are incentivised for participation (usually through payment of a wage or salary). Amateur participation in sport at lower levels is often called \"grassroots sport\".The popularity of spectator sport as a recreation for non-participants has led to sport becoming a major business in its own right, and this has incentivised a high paying professional sport culture, where high performing participants are rewarded with pay far in excess of average wages, which can run into millions of dollars.Some sports, or individual competitions within a sport, retain a policy of allowing only amateur sport. The Olympic Games started with a principle of amateur competition with those who practised a sport professionally considered to have an unfair advantage over those who practised it merely as a hobby. From 1971, Olympic athletes were allowed to receive compensation and sponsorship, and from 1986, the IOC decided to make all professional athletes eligible for the Olympics, with the exceptions of boxing, and wrestling.\n\n\n== Technology ==\n\nTechnology plays an important part in modern sport. With it being a necessary part of some sports (such as motorsport), it is used in others to improve performance. Some sports also use it to allow off-field decision making.\nSports science is a widespread academic discipline, and can be applied to areas including athlete performance, such as the use of video analysis to fine-tune technique, or to equipment, such as improved running shoes or competitive swimwear. Sports engineering emerged as a discipline in 1998 with an increasing focus not just on materials design but also the use of technology in sport, from analytics and big data to wearable technology. In order to control the impact of technology on fair play, governing bodies frequently have specific rules that are set to control the impact of technical advantage between participants. For example, in 2010, full-body, non-textile swimsuits were banned by FINA, as they were enhancing swimmers' performances.The increase in technology has also allowed many decisions in sports matches to be taken, or reviewed, off-field, with another official using instant replays to make decisions. In some sports, players can now challenge decisions made by officials. In Association football, goal-line technology makes decisions on whether a ball has crossed the goal line or not. The technology is not compulsory, but was used in the 2014 FIFA World Cup in Brazil, and the 2015 FIFA Women's World Cup in Canada, as well as in the Premier League from 2013–14, and the Bundesliga from 2015–16. In the NFL, a referee can ask for a review from the replay booth, or a head coach can issue a challenge to review the play using replays. The final decision rests with the referee. A video referee (commonly known as a Television Match Official or TMO) can also use replays to help decision-making in rugby (both league and union). In international cricket, an umpire can ask the Third umpire for a decision, and the third umpire makes the final decision. Since 2008, a decision review system for players to review decisions has been introduced and used in ICC-run tournaments, and optionally in other matches. Depending on the host broadcaster, a number of different technologies are used during an umpire or player review, including instant replays, Hawk-Eye, Hot Spot and Real Time Snickometer. Hawk-Eye is also used in tennis to challenge umpiring decisions.\n\n\n== Politics ==\n\nSports and politics can influence each other greatly.\nBenito Mussolini used the 1934 FIFA World Cup, which was held in Italy, to showcase Fascist Italy. Adolf Hitler also used the 1936 Summer Olympics held in Berlin, and the 1936 Winter Olympics held in Garmisch-Partenkirchen, to promote the Nazi ideology of the superiority of the Aryan race, and inferiority of the Jews and other \"undesirables\". Germany used the Olympics to give of itself a peaceful image while it was very actively preparing the war.When apartheid was the official policy in South Africa, many sports people, particularly in rugby union, adopted the conscientious approach that they should not appear in competitive sports there. Some feel this was an effective contribution to the eventual demolition of the policy of apartheid, others feel that it may have prolonged and reinforced its worst effects.In the history of Ireland, Gaelic sports were connected with cultural nationalism. Until the mid-20th century a person could have been banned from playing Gaelic football, hurling, or other sports administered by the Gaelic Athletic Association (GAA) if she/he played or supported Association football, or other games seen to be of British origin. Until recently the GAA continued to ban the playing of football and rugby union at Gaelic venues. This ban, also known as Rule 42, is still enforced, but was modified to allow football and rugby to be played in Croke Park while Lansdowne Road was redeveloped into Aviva Stadium. Until recently, under Rule 21, the GAA also banned members of the British security forces and members of the RUC from playing Gaelic games, but the advent of the Good Friday Agreement in 1998 led to the eventual removal of the ban.\nNationalism is often evident in the pursuit of sport, or in its reporting: people compete in national teams, or commentators and audiences can adopt a partisan view. On occasion, such tensions can lead to violent confrontation among players or spectators within and beyond the sporting venue, as in the Football War. These trends are seen by many as contrary to the fundamental ethos of sport being carried on for its own sake and for the enjoyment of its participants.\nA very famous case when sport and politics collided was the 1972 Olympics in Munich. Masked men entered the hotel of the Israeli olympic team and killed many of their men. This was known as the Munich massacre.\nA study of US elections has shown that the result of sports events can affect the results. A study published in the Proceedings of the National Academy of Sciences showed that when the home team wins the game before the election, the incumbent candidates can increase their share of the vote by 1.5 percent. A loss had the opposite effect, and the effect is greater for higher-profile teams or unexpected wins and losses. Also, when Washington Redskins win their final game before an election, then the incumbent President is more likely to win, and if the Redskins lose, then the opposition candidate is more likely to win; this has become known as the Redskins Rule.\n\n\n=== As a means of controlling and subduing populations ===\nÉtienne de La Boétie, in his essay Discourse on Voluntary Servitude describes athletic spectacles as means for tyrants to control their subjects by distracting them.\n\nDo not imagine that there is any bird more easily caught by decoy, nor any fish sooner fixed on the hook by wormy bait, than are all these poor fools neatly tricked into servitude by the slightest feather passed, so to speak, before their mouths. Truly it is a marvelous thing that they let themselves be caught so quickly at the slightest tickling of their fancy. Plays, farces, spectacles, gladiators, strange beasts, medals, pictures, and other such opiates, these were for ancient peoples the bait toward slavery, the price of their liberty, the instruments of tyranny. By these practices and enticements the ancient dictators so successfully lulled their subjects under the yoke, that the stupefied peoples, fascinated by the pastimes and vain pleasures flashed before their eyes, learned subservience as naïvely, but not so creditably, as little children learn to read by looking at bright picture books.\n\n\n== Religious views ==\n\nSport was an important form of worship in the Ancient Greek pagan religion. The ancient Olympic Games, called the Olympiad, were held in honour of the head deity, Zeus, and featured various forms of religious dedication to him and other gods. As many Greeks travelled to see the games, this combination of religion and sport also served as a way of uniting them.\nThe practice of athletic competitions has been criticised by some Christian thinkers as a form of idolatry, in which \"human beings extol themselves, adore themselves, sacrifice themselves and reward themselves.\" Sports are seen by these critics as a manifestation of \"collective pride\" and \"national self-deification\" in which feats of human power are idolized at the expense of divine worship.Tertullian condemns the athletic performances of his day, insisting \"the entire apparatus of the shows is based upon idolatry.\" The shows, says Tertullian, excite passions foreign to the calm temperament cultivated by the Christian:\n\nGod has enjoined us to deal calmly, gently, quietly, and peacefully with the Holy Spirit, because these things are alone in keeping with the goodness of His nature, with His tenderness and sensitiveness. ... Well, how shall this be made to accord with the shows? For the show always leads to spiritual agitation, since where there is pleasure, there is keenness of feeling giving pleasure its zest; and where there is keenness of feeling, there is rivalry giving in turn its zest to that. Then, too, where you have rivalry, you have rage, bitterness, wrath and grief, with all bad things which flow from them – the whole entirely out of keeping with the religion of Christ.\n\n\n== Popularity ==\nPopularity in 2018 of major sports by size of fan base:\n\n\n== See also ==\n\nRelated topics\n\n\n== References ==\n\nEuropean Commission (2007), The White Paper on Sport.\nCouncil of Europe (2001), The European sport charter.\n\n\n== Further reading ==\nThe Meaning of Sports by Michael Mandel (PublicAffairs, ISBN 1-58648-252-1).\nJournal of the Philosophy of Sport\nSullivan, George. The Complete Sports Dictionary. New York: Scholastic Book Services, 1979. 199 p. ISBN 0-590-05731-6\n\n\n== External links =="}