{"text": "The film industry or motion picture industry, comprises the technological and commercial institutions of filmmaking, i.e., film production companies, film studios, cinematography, animation, film production, screenwriting, pre-production, post production, film festivals, distribution and actors, film directors and other film crew personnel. Though the expense involved in making films almost immediately led film production to concentrate under the auspices of standing production companies, advances in affordable film making equipment, and expansion of opportunities to acquire investment capital from outside the film industry itself, have allowed independent film production to evolve.\nAs of 2018, the global box office is worth $41.7 billion. When including box office and home entertainment revenue, the global film industry is worth $136 billion as of 2018. Hollywood is the world's oldest national film industry, and remains the largest in terms of box office gross revenue. Indian cinema is the largest national film industry in terms of the number of films produced and the number of tickets sold, with 3.5 billion tickets sold worldwide annually (compared to Hollywood's 2.6 billion tickets sold annually) and 1,813 feature films produced annually.\n\n\n== Modern film industry ==\nThe worldwide theatrical market had a box office of US$38.6 billion in 2016. The top three continents/regions by box office gross were: Asia-Pacific with US$14.9 billion, the U.S. and Canada with US$11.4 billion, and Europe, the Middle East and North Africa with US$9.5 billion. As of 2016, the largest markets by box office were, in decreasing order, the United States, China, Japan, India, and the United Kingdom. As of 2011, the countries with the largest number of film productions were India, Nigeria, and the United States. In Europe, significant centers of movie production are France, Germany, Italy, Spain, and the United Kingdom.Distinct from the centers are the locations where films are filmed. Because of labor and infrastructure costs, many films are produced in countries other than the one in which the company which pays for the film is located. For example, many U.S. films are filmed in Canada, many Nigerian films are filmed in Ghana, while many Indian films are filmed in the Americas, Europe, Singapore etc.\n\n\n=== United States ===\n\nThe cinema of the United States, often generally referred to as Hollywood, has had a profound effect on cinema across the world since the early 20th century. The United States cinema (Hollywood) is the oldest film industry in the world which originated more than 121 years ago and also the largest film industry in terms of revenue. Hollywood is the primary nexus of the U.S. film industry with established film study facilities such as the American Film Institute, LA Film School and NYFA being established in the area. However, four of the six major film studios are owned by East Coast companies. The major film studios of Hollywood including Metro-Goldwyn-Mayer, 20th Century Fox, and Paramount Pictures are the primary source of the most commercially successful movies in the world, such as  Star Wars (1977), and Titanic (1997).\nAmerican film studios today collectively generate several hundred films every year, making the United States one of the most prolific producers of films in the world. Only The Walt Disney Company — which owns the Walt Disney Studios — is fully based in Southern California. And while Sony Pictures Entertainment is headquartered in Culver City, California, its parent company, the Sony Corporation, is headquartered in Tokyo, Japan. Most shooting now takes place in California, New York, Louisiana, Georgia and North Carolina. Hollywood is the most popular film industry with the highest number of screens, and is the highest-grossing film industry in the world. Between 2009-2015, Hollywood consistently grossed $10 billion (or more) annually. Hollywood's award ceremony, the Academy Awards, officially known as The Oscars, is held by the Academy of Motion Picture Arts and Sciences (AMPAS) every year and a total of 2,947 Oscars have been awarded since the inception of the award.The earliest documented account of an exhibition of projected motion pictures in the United States was in June 1894 in Richmond, Indiana by Charles Francis Jenkins which makes United States cinema the earliest cinema in the whole world. Jenkins used his Phantoscope to project his film before an audience of family, friends and reporters. The film featured a vaudeville dancer performing a Butterfly Dance. Jenkins and his new partner Thomas Armat modified the Phantoscope for exhibitions in temporary theaters at the Cotton States Exposition in the fall of 1895. The was later sold to Thomas Edison, who changed the name of the projector to Edison's Vitascope.\n\nNestor Studios was Hollywood's first film studio, founded on 27 October 1911. It was built by David Horsley for Nestor Motion Picture Company. It was then owned and operated by David Horsley and his brother, William Horsley. The first motion picture stage in Hollywood was built behind the tavern. Other East Coast studios had moved production to Los Angeles, prior to Nestor's move\nwest. The California weather allowed for year-round filming and the ambitious studio operated three principal divisions under its Canadian-born general manager, Al Christie. Other filmmakers began opening studios in the Hollywood area. The Horsleys operated the Nestor Studios at the Sunset and Gower location until 20 May 1912, when the Universal Studios was formed, headed by Carl Laemmle. Nestor, along with several other motion picture companies, including Laemmle's Independent Moving Pictures (IMP), was merged with Universal.\n\n\n=== China ===\n\nThe Cinema of China is one of three distinct historical threads of Chinese-language cinema together with the cinema of Hong Kong and the cinema of Taiwan. Cinema was introduced in China in 1896 and the first Chinese film, Dingjun Mountain, was made in 1905, with the film industry being centered on Shanghai in the first decades. China is the home of the largest film studio in the world, the Hengdian World Studios, and in 2010 it had the third largest film industry by number of feature films produced annually. For the next decade the production companies were mainly foreign-owned, and the domestic film industry was centered on Shanghai, a thriving entrepot and the largest city in the Far East. In 1913, the first independent Chinese screenplay, The Difficult Couple, was filmed in Shanghai by Zheng Zhengqiu and Zhang Shichuan.As the Sixth Generation gained international exposure, many subsequent films were joint ventures and projects with international backers, but remained quite resolutely low-key and low budget. Jia's Platform (2000) was funded in part by Takeshi Kitano's production house, while his Still Life was shot on HD video. Still Life was a surprise addition and Golden Lion winner of the 2006 Venice International Film Festival. Still Life, which concerns provincial workers around the Three Gorges region, sharply contrasts with the works of Fifth Generation Chinese directors like Zhang Yimou and Chen Kaige who were at the time producing House of Flying Daggers (2004) and The Promise (2005). It featured no star of international renown and was acted mostly by non-professionals. In 2012 the country became the second-largest market in the world by box office receipts. In 2014, the gross box office in China was ¥29.6 billion (US$4.82 billion), with domestic films having a share of 55%. The country is predicted to have the largest market in the world in 2017 or 2018. China has also become a major hub of business for Hollywood studios. In 2013, China's gross box office was ¥21.8 billion (US$3.6 billion), the second-largest film market in the world by box office receipts whereas in 2014, China's box office gross was $4.8 Billion, being the second largest box office grosser in film industry.\n\n\n=== United Kingdom ===\n\nThe United Kingdom has had a significant film industry for over a century. While film production reached an all-time high in 1936, the \"golden age\" of British cinema is usually thought to have occurred in the 1940s, during which the directors David Lean, Michael Powell, (with Emeric Pressburger) and Carol Reed produced their most highly acclaimed work. Many British actors have achieved worldwide fame and critical success, such as Maggie Smith, Roger Moore, Michael Caine, Sean Connery, Daniel Day-Lewis, Gary Oldman, and Kate Winslet. Some of the films with the largest ever box office returns have been made in the United Kingdom, including the third and fourth highest-grossing film series (Harry Potter and James Bond).\n\nThe first moving picture was shot in Leeds by Louis Le Prince in 1888 and the first moving pictures developed on celluloid film were made in Hyde Park, London in 1889 by British inventor William Friese Greene, who patented the process in 1890.\nNumerous US and international films have a British dimension (based on British people, stories or events), many of which have had enormous worldwide commercial success. Two of the top eight highest-grossing films worldwide of all time have some British historical, cultural or creative dimensions: Titanic (1997), Harry Potter and the Deathly Hallows – Part 2 (2011), The Lord of the Rings: The Return of the King (2003), made in New Zealand, and Pirates of the Caribbean: Dead Man's Chest (2005). Adding four more Harry Potter films and one more Lord of the Rings movie, plus the Tim Burton version of Alice in Wonderland (2010), and more than half of the top twenty most financially successful films, had a substantial British dimension.British influence can also be seen with the 'English Cycle' of Disney animated films, which include Alice in Wonderland (1951), Peter Pan (1953), One Hundred and One Dalmatians (1961), The Sword in the Stone (1963), and The Jungle Book (1967). Disney first became interested in live-action films as a means of using financial reserves which had built up in Britain, and could not be repatriated owing to exchange controls, by making two films from Scottish and English sources. These were Treasure Island (1950) and The Story of Robin Hood and His Merrie Men (1952), which were both successes at the box office. The studio continued to draw on British source material for its animated films after Walt Disney's death in 1967, with the cartoon feature films Robin Hood (1973), The Rescuers (1976) and The Many Adventures of Winnie the Pooh (1977), one of many Disney to draw on A. A. Milne's characters.\n\nIn the 1970s and 1980s, British studios established a reputation for great special effects in films such as Superman (1978), Alien (1979), and Batman (1989). Some of this reputation was founded on the core of talent brought together for the filming of 2001: A Space Odyssey (1968) who subsequently worked together on series and feature films for Gerry Anderson. Thanks to the Bristol-based Aardman Animations, the UK is still recognised as a world leader in the use of stop-motion animation.\nBritish special effects technicians and production designers are known for creating visual effects at a far lower cost than their counterparts in the US, as seen in Time Bandits (1981) and Brazil (1985). This reputation has continued through the 1990s and into the 21st century with films such as the James Bond series, Gladiator (2000) and the Harry Potter franchise.\nFrom the 1990s to the present day, there has been a progressive movement from traditional film opticals to an integrated digital film environment, with special effects, cutting, colour grading, and other post-production tasks all sharing the same all-digital infrastructure. The London-based visual effects company Framestore, with Tim Webber the visual effects supervisor, have worked on some of the most technically and artistically challenging projects, including, The Dark Knight (2008) and Gravity (2013), with new techniques involved in Gravity realized by Webber and the Framestore team taking three years to complete.The availability of high-speed Internet Protocol networks has made the British film industry capable of working closely with U.S. studios as part of globally distributed productions. As of 2005, this trend is expected to continue with moves towards (currently experimental) digital distribution and projection as mainstream technologies. The British film This is Not a Love Song (2003) was the first to be streamed live on the Internet at the same time as its cinema premiere.\n\n\n=== France ===\n\nCinema of France refers to the film industry based in France. The French cinema comprises the art of film and creative movies made within the nation of France or by French filmmakers abroad.\nFrance was  was responsible for many of its significant contributions to the art form and the film-making process itself. Several important cinematic movements, including the Nouvelle Vague, began in the country. It is noted for having a particularly strong film industry, due in part to protections afforded by the French government.Apart from its strong and innovative film tradition, France has also been a gathering spot for artists from across Europe and the world. For this reason, French cinema is sometimes intertwined with the cinema of foreign nations. Directors from nations such as Poland (Roman Polanski, Krzysztof Kieślowski, and Andrzej Żuławski), Argentina (Gaspar Noé and Edgardo Cozarinsky), Russia (Alexandre Alexeieff, Anatole Litvak), Austria (Michael Haneke), and Georgia (Géla Babluani, Otar Iosseliani) are prominent in the ranks of French cinema. Conversely, French directors have had prolific and influential careers in other countries, such as Luc Besson, Jacques Tourneur, or Francis Veber in the United States.\nAnother element supporting this fact is that Paris has the highest density of cinemas in the world, measured by the  number of movie theaters per inhabitant, and that in most \"downtown Paris\" movie theaters, foreign movies which would be secluded to \"art houses\" cinemas in other places are shown alongside \"mainstream\" works. Philippe Binant realized, on 2 February 2000, the first digital cinema projection in Europe, with the DLP CINEMA technology developed by Texas Instruments, in Paris. Paris also boasts the Cité du cinéma, a major studio north of the city, and Disney Studio, a theme park devoted to the cinema and the third theme park near the city behind Disneyland and Parc Asterix.France is the most successful film industry in Europe in terms of number of films produced per annum, with a record-breaking 300 feature-length films produced in 2015. France is also one of the few countries where non-English productions have the biggest share: US and UK films only represented 44.9% of total admissions in 2014. This is largely due to the commercial strength of domestic productions, which accounted for 44,5% of admissions in 2014 (35.5% in 2015; 35.3% in 2016). Also, the French film industry is closer to being entirely self-sufficient than any other country in Europe, recovering around 80–90% of costs from revenues generated in the domestic market alone.\n\n\n=== India ===\n\nIndia is the largest producer of films in the world and second oldest film industry in the world which originated around about 105 years ago. In 2009 India produced a total of 2,961 films on celluloid; this figure includes 1,288 feature films. Besides being the largest producer of films in the world, India also has the largest number of admissions. Indian film industry is multi-lingual and the largest in the world in terms of ticket sales but 3rd largest in terms of revenue mainly due to having amongst the lowest ticket prices in the world. The industry is viewed mainly by a vast film-going Indian public, and Indian films have been gaining increasing popularity in the rest of the world—notably in countries with large numbers of expatriate Indians. Indian film industry is also the dominant source of films and entertainment in its neighboring countries of South Asia. The largest film and most popular industry in India is the Hindi film industry mostly concentrated in Mumbai (Bombay), and is commonly referred to as Bollywood, an amalgamation of Bombay and Hollywood.\nThe other largest film industries are Tamil cinema, Telugu cinema, Malayalam cinema, Kannada cinema, Bangla cinema (cinema of West Bengal) and Marathi cinema, which are located in Chennai, Hyderabad, Kochi, Bengaluru, Kolkata and Mumbai respectively. The remaining majority portion is spread across northern, western, eastern and southern India (with Gujarati, Punjabi, Odia, Bhojpuri, Assamese Cinema). However, there are several smaller centres of Indian film industries in regional languages centred in the states where those languages are spoken. Indian films are filled with musicals, action, romance, comedy, and an increasing number of special effects. It encloses a number of several artforms like Indian classical music, folk music of different regions throughout the country, Indian classical dance, folk dance and much more. It is even the place for number of artists from the Indian subcontinent to showcase their talent. The Indian film industry produces more than 1000 films a year. Bollywood is the largest portion of this and is viewed all over the Indian Subcontinent, and is increasingly popular in UK, United States, Australia, New Zealand, Southeast Asia, Africa, the Gulf countries, European countries and China. The largest film studio complex in the world is Ramoji Film City located at Hyderabad, India, which opened in 1996 and measures 674 ha (1,666 acres). Comprising 47 sound stages, it has permanent sets ranging from railway stations to temples.Bollywood represents 43% of Indian net box office revenue, while Telugu and Tamil cinema represent 36%, and the rest of the regional cinema constitute 21%, as of 2014.The highest-grossing film in India is Dangal which is also the 5th highest grossing non-English film in the world.\n\n\n=== Nigeria ===\n\nThe cinema of Nigeria, often referred to informally as Nollywood, was the second largest film industry, in terms of output, in 2009 and the third largest, in terms of overall revenues generated, in 2013. Its history dates back to as early as the late 19th century and into the colonial era in the early 20th century. The history and development of the Nigerian motion picture industry is sometimes generally classified in four main eras: the Colonial era, Golden Age, Video film era and the emerging New Nigerian cinema.Film as a medium first arrived Nigeria in the late 19th century, in the form of peephole viewing of motion picture devices. These were soon replaced in the early 20th century with improved motion picture exhibition devices, with the first set of films screened at the Glover Memorial Hall in Lagos from 12 to 22 August 1903. The earliest feature film made in Nigeria is the 1926 Palaver produced by Geoffrey Barkas; the film was also the first film ever to feature Nigerian actors in speaking roles. The first film entirely copyrighted to the Nigerian Film unit is Fincho (1957) by Sam Zebba; which is also the first Nigerian film to be shot in colour.After Nigeria's independence in 1960, the cinema business rapidly expanded, with new cinema houses being established. As a result, Nigerian content in theatres increased in the late 1960s into the 1970s, especially productions from Western Nigeria, owing to former theatre practitioners such as Hubert Ogunde and Moses Olaiya transitioning into the big screen. In 1972, the Indigenization Decree was issued by Yakubu Gowon, which demands the transfer of ownership of about a total of 300 film theatres from their foreign owners to Nigerians, which resulted in more Nigerians playing active roles in the cinema and film. The oil boom of 1973 through 1978 also contributed immensely to the spontaneous boost of the cinema culture in Nigeria, as the increased purchasing power in Nigeria made a wide range of citizens to have disposable income to spend on cinema going and on home television sets.After the decline of the Golden era, Nigerian film industry experienced a second major boom in the 1990s, supposedly marked by the release of the direct-to-video film Living in Bondage (1992); the industry peaked in the mid 2000s to become the second largest film industry in the world in terms of the number of annual film productions, placing it ahead of the United States and behind only India. The films started dominating screens across the African continent and by extension, the Caribbeans and the diaspora, with the films significantly influencing cultures, and the film actors becoming household names across the continent. The boom also led to a backlash against Nigerian films in several countries, bordering on theories such as the \"Nigerialization of Africa\". Since the mid-2000s, the Nigerian cinema have undergone some restructuring to promote quality and professionalism, with The Figurine (2009) widely regarded as marking the major turn around of contemporary Nigerian cinema. There has since been a resurgence in the proliferation of cinema establishments, and a steady return of the cinema culture in Nigeria.The 2016 film The Wedding Party, directed by Kemi Adetiba, is the highest grossing Nollywood film of all time.\n\n\n=== Egypt ===\n\nSince 1976, Cairo has held the annual Cairo International Film Festival (CIFF), which is accredited by the International Federation of Film Producers Association. In 1996, the Egyptian Media Production City (EMPC) was inaugurated in 6th of October City south of Cairo, although by 2001, only one of 29 planned studios was operational. Censorship, formerly an obstacle to freedom of expression, has decreased remarkably by 2012, when the Egyptian cinema had begun to tackle boldly issues ranging from sexual issues  to heavy government criticism.The 1940s, 1950s and the 1960s are generally considered the golden age of Egyptian cinema. As in the West, films responded to the popular imagination, with most falling into predictable genres (happy endings being the norm), and many actors making careers out of playing strongly typed parts. In the words of one critic, \"If an Egyptian film intended for popular audiences lacked any of these prerequisites, it constituted a betrayal of the unwritten contract with the spectator, the results of which would manifest themselves in the box office.\" Since the 1990s, Egypt's cinema has gone in separate directions. Smaller art films attract some international attention but sparse attendance at home. Popular films, often broad comedies such as What A Lie!, and the extremely profitable works of comedian Mohamed Saad, battle to hold audiences either drawn to Western films or, increasingly, wary of the perceived immorality of film.\n\n\n=== Iran ===\n\nThe cinema of Iran (Persian: سینمای ایران) or cinema of Persia refers to the cinema and film industries in Iran which produce a variety of commercial films annually. Iranian art films have garnered international fame and now enjoy a global following.Along with China, Iran has been lauded as one of the best exporters of cinema in the 1990s. Some critics now rank Iran as the world's most important national cinema, artistically, with a significance that invites comparison to Italian neorealism and similar movements in past decades. A range of international film festivals have honored Iranian cinema in the last twenty years. Austrian filmmaker Michael Haneke and German filmmaker Werner Herzog have praised Iranian cinema as one of the world's most important artistic cinemas.\n\n\n=== Japan ===\n\nThe cinema of Japan has a history that spans more than 100 years. Japan has one of the oldest and largest film industries in the world; as of 2010, it was the fourth largest by number of feature films produced. Movies have been produced in Japan since 1897, when the first foreign cameramen arrived.\nIn a Sight & Sound list of the best films produced in Asia, Japanese works made up eight of the top 12, with Tokyo Story (1953) ranked number one. Tokyo Story also topped the 2012 Sight & Sound directors' poll of The Top 50 Greatest Films of All Time, dethroning Citizen Kane, while Akira Kurosawa's Seven Samurai (1954) was voted the greatest foreign-language film of all time in BBC's 2018 poll of 209 critics in 43 countries. Japan has won the Academy Award for the Best Foreign Language Film four times (Rashomon, Gate of Hell, Samurai I: Musashi Miyamoto, and Departures), more than any other Asian country.\n\n\n=== Korea ===\n\nThe term \"cinema of Korea\" (or \"Korean cinema\") encompasses the motion picture industries of North and South Korea. As with all aspects of Korean life during the past century, the film industry has often been at the mercy of political events, from the late Joseon dynasty to the Korean War to domestic governmental interference. While both countries have relatively robust film industries today, only South Korean films have achieved wide international acclaim. North Korean films tend to portray their communist or revolutionary themes.\nSouth Korean films enjoyed a \"Golden age\" during the late 1950s, and 1960s, but by the 1970s had become generally considered to be of low quality. Nonetheless, by 2005 South Korea had become one of few nations to watch more domestic than imported films in theatres due largely to laws placing limits on the number of foreign films able to be shown per theatre per year. In the theaters, Korean films must be played for 73 days per year since 2006. On cable TV 25% domestic film quota will be reduced to 20% after KOR-US FTA.\nThe cinema of South Korea had a total box office gross in the country in 2015 of ₩884 billion and had 113,000,000 admissions, 52% of the total admissions.\n\n\n=== Hong Kong ===\n\nHong Kong is a filmmaking hub for the Chinese-speaking world (including the worldwide diaspora) and East Asia in general.  For decades it was the third largest motion picture industry in the world (after Bollywood and Hollywood) and the second largest exporter of films. Despite an industry crisis starting in the mid-1990s and Hong Kong's return to Chinese sovereignty in July 1997 Hong Kong film has retained much of its distinctive identity and continues to play a prominent part on the world cinema stage.\nUnlike many film industries, Hong Kong has enjoyed little to no direct government support, through either subsidies or import quotas.  It has always been a thoroughly commercial cinema, concentrating on crowd-pleasing genres, like comedy and action, and heavily reliant on formulas, sequels and remakes.  Typically of commercial cinemas, its heart is a highly developed star system, which in this case also features substantial overlap with the pop music industry.\n\n\n=== Turkey ===\nThe Yeşilçam film industry is the second largest European theatrical growth market and the 7th largest theatrical market in terms of admissions, only superseded by the ‘big 5’ EU markets and the Russian Federation. The Turkish film market also stands out in the pan-European landscape as the only market where national films regularly outperform US films. It had 1.2 million number of admissions in film industry and 87 feature films were released in the year 2013. Because of the exceptional box office success of Turkish films on the domestic market, the estimated 12.9 million admissions generated on non-national European markets only account for 7% of total admissions to Turkish films in Europe (including Turkey) between 2004 and 2013. This is the third lowest share among the 30 European markets for which such data are available and clearly illustrates the strong dependence of Turkish films on the domestic market, a feature which is shared by Polish and Russian films.Over the past ten years an increasing number of Turkish films and filmmakers have been selected for international film festivals and received a large number of awards, like Kış Uykusu (Winter's Sleep) won Cannes Film Festival Award for Best Film in 2014. In terms of box office Turkey still ranks behind the Netherlands with just over EUR 200 million as Europe's eight largest box office market ahead of Sweden and Switzerland with a clear gap to the top 6 markets all of which registered GBO between EUR 504 million (Spain) up to over EUR 1 billion in France, the UK, Germany and the Russian Federation. Cinema going is comparatively cheap in Turkey. In 2013 a cinema ticket cost on average EUR 4.0 in Turkey, and this is estimated to be the lowest average ticket price - measured in Euro - in Europe, marginally cheaper than in several Central and Eastern European markets like Croatia, Romania, Lithuania or Bulgaria. When comparing ticket prices in Euro, one of course has to take into consideration that these comparisons are significantly affected by fluctuations in the exchange rates of the various currencies. Because of devaluation of the Turkish Lira against the Euro, average ticket prices measured in Euro remained fairly stable over the past 10 years.\n\n\n=== Pakistan ===\n\nThe cinema of Pakistan, or simply, Pakistani cinema (Urdu: پاکستانی سنیما‎) refers to Pakistan's film industry. Most of the feature films shot in Pakistan are in Urdu, the national language, but may also include films in English, the official language, and regional languages such as Punjabi, Pashto, Balochi, and Sindhi. Lahore has been described as the epicentre of Pakistani cinema, giving rise to the term \"Lollywood.\"\nBefore the separation of Bangladesh, Pakistan had three main film production centres: Lahore, Karachi and Dhaka. The regime of Muhammad Zia-ul-Haq, VCRs, film piracy, the introduction of entertainment taxes, strict laws based upon ultra-conservative jurisprudence, was an obstacle to the industry's growth. Once thriving, the cinema in Pakistan had a sudden collapse in the 1980s and by the 2000s \"an industry that once produced an average of 80 films annually was now struggling to even churn out more than two films a year.\". However, the industry has recently made a dramatic and remarkable comeback, evident from the fact that 18 of the 21 highest grossing Pakistani films were released from 2013 through to the present, with Pakistani films frequently outcompeting Bollywood films for the Pakistani audience, the industry is supported by Pakistani channels such as ARY and Geo whose entertainment divisions have invested significantly in Pakistani cinema when expanding from providing news and entertainment on TV channels, the lifting of strict regulations on production of films and reduction of taxes on cinemas helped to fuel an expansion across the industry from which the film industry has seen a revival.\n\n\n=== Bangladesh ===\n\nThe cinema of Bangladesh is the Bengali language film industry based in Dhaka, Bangladesh. The industry often has been a significant film industry since the early 1970s. The word \"Dhallywood\" is a portmanteau of the words Dhaka and Hollywood. The dominant style of Bangladeshi cinema is Melodramatic cinema, which developed from 1947 to 1990 and characterizes most films to this day. Cinema was introduced in Bangladesh in 1898 by Bradford Bioscope Company, credited to have arranged the first film release in Bangladesh. Between 1913 and 1914, the first production company named Picture House was opened. A short silent film titled Sukumari (The Good Girl) was the first produced film in the region during 1928. The first full-length film The Last Kiss, was released in 1931. From the separation of Bangladesh from Pakistan, Dhaka is the center of Bangladeshi film industry, and generated the majority share of revenue, production and audiences. The 1960s, 1970s, 1980s and the first half of the 1990s were the golden years for Bangladeshi films as the industry produced many successful films. The Face and the Mask, the first Bengali language Bangladeshi full-length feature film was produced in 1956.Directors such as Fateh Lohani, Zahir Raihan, Alamgir Kabir, Khan Ataur Rahman, Subhash Dutta, Ritwik Ghatak, Ehtesham, Chashi Nazrul Islam, Abdullah al Mamun, Sheikh Niamat Ali, Gazi Mazharul Anwar, Tanvir Mokammel, Tareque Masud, Morshedul Islam, Humayun Ahmed, Gias Uddin Selim, Amitabh Reza Chowdhury and others have made significant contributions to Bangladeshi mainstream cinema, parallel cinema, art films and won global acclaim.\nMatir Moina, a 2002 film by Tarek Masud, became the first Bangladeshi film to be honored at Cannes Film Festival. From the year 2014, a crossover between Bangladeshi actors and West Bengal's actors are heavily seen in the name of Bangladesh-India joint production. Among them is Shikari, Nabab, Boss 2, Black), Ekti Cinemar Golpo to name a few. Joya Ahsan earned huge reputation for 2015 film Rajkahini and Bisorjon (2017). The former was remade in Hindi as Begum Jaan and for the latter, Joya received coveted Filmfare East Award for Best Actress, the most prestigious award in Indian cinema. In course of time, several actors have worked in Bollywood Films as well. Which include Shabana Sadique in Shatru, Ferdous Ahmed in Mitti etc.\n\n\n=== Indonesia ===\n\nThe biggest film studios in Southeast Asia has been soft opened on 5 November 2011 on 10 hectares of land in Nongsa, Batam Island, Indonesia. Infinite Frameworks (IFW) is a Singapore-based company (closed to Batam Island) which is owned by a consortium with 90 percent of it hold by Indonesian businessman and film producer, Mike Wiluan. In 2010-2011, due to the substantial increase in value added tax applied to foreign films, cinemas no longer had access to many foreign films, including Oscar-winning films. Foreign films include major box offices from the west, and other major film producers of the world. This has caused a massive ripple effect on the country's economy. It is assumed that this increases the purchase of unlicensed DVDs. However, even copyright violating DVDs took longer to obtain. The minimum cost to view a foreign film not screened locally, was 1 million Rupiah. This is equivalent to US$100, as it includes a plane ticket to Singapore.\n\n\n=== Trinidad and Tobago ===\n\nTrinidad and Tobago's film sector began emerging in the late fifties to early sixties and by the late seventies, there were a handful of local productions, both feature film and television. The first full-length feature film to be produced in Trinidad and Tobago was “The Right and the Wrong” (1970) by Indian director/writer/producer, Harbance Kumar. The screenplay was written by the Trinidadian playwright, Freddie Kissoon. The rest of the 20th century saw a couple more feature films being made in the country, with “Bim” (1974), being singled out by Bruce Paddington as \"one of the most important films to be produced in Trinidad and Tobago….and one of the classics of Caribbean cinema.” It was one of the first films to feature an almost entirely Trinidadian cast and crew. There was a rise in Trinidadian film production in the 2000s. Films such as “Ivan the Terrible” (2004), “SistaGod” (2006), “I’m Santana: The Movie” (2012) and “God Loves the Fighter” (2013) were released both locally and internationally. “SistaGod” had its world premiere at the 2006 Toronto International Film Festival.The Trinidad and Tobago Film Company is the national agency that was established in 2006 to further development of the film industry. Trinidad and Tobago puts on a number of film festivals which are organized by different committees and organizations. These include the Secondary Schools Short Film Festival and Smartphone Film Festival organized by Trinidad and Tobago Film Company. There is also an annual Trinidad and Tobago Film Festival which runs for two weeks in the latter half of September.\n\n\n=== Nepal ===\n\nNepali film does not have a very long film history, but the industry has its own place in the cultural heritage of the country. It is often referred to as 'Nepali Chalchitra' (which translates to \"Nepali films\" in English). The terms Kollywood and Kallywood are also used, as a portmanteau of \"Kathmandu\" and \"Hollywood\"; \"Kollywood\" however is more frequently used to refer to Tamil cinema.[1] Chhakka Panja has been considered the highest-grossing film of all time in Nepali film industry and Kohinoor the second highest. Nepali films have recently begun receiving international acclaim with films such as The Black Hen (2015), Kagbeni (2006) and others. Nepali feature film White Sun (Seto Surya) has bagged the Best Film award at the 27th Singapore International Film Festival (SGIFF)(2016).\nThe Film Development Board (FDB) was established by the Government of Nepal for the development and promotion of the Nepali film industry. The Board is a liaison to facilitate the conceptualization, making, distribution and exhibition of Nepali films nationally. The Board attempts to bridge the gap between film entrepreneurship and government bureaucracy. The Board is a balance between the people at large, the government, and the process of film making. It is intended to act as the safeguard of the interests of the people, the watchdog of the government, and the advocate of filmmakers.\n\n\n== History ==\n\nThe first feature film to be made was the 1906 Australian silent The Story of the Kelly Gang, an account of the notorious gang led by Ned Kelly that was directed and produced by the Melburnians Dan Barry and Charles Tait. It ran, continuously, for eighty minutes.In the early 1910s, the film industry had fully emerged with D.W. Griffith's The Birth of a Nation. Also in the early 1900s motion picture production companies from New York and New Jersey started moving to California because of the good weather and longer days. Although electric lights existed at that time, none were powerful enough to adequately expose film; the best source of illumination for movie production was natural sunlight. Besides the moderate, dry climate, they were also drawn to the state because of its open spaces and wide variety of natural scenery.\n\n\n=== Hollywood ===\n\nThe earliest documented account of an exhibition of projected motion pictures in the United States was in June 1894 in Richmond, Indiana by Charles Francis Jenkins. The first movie studio in the Hollywood area, Nestor Studios, was founded in 1911 by Al Christie for David Horsley in an old building on the northwest corner of Sunset Boulevard and Gower Street.  In the same year, another fifteen Independents settled in Hollywood.  Hollywood came to be so strongly associated with the film industry that the word \"Hollywood\" came to be used colloquially to refer to the entire industry.\nIn 1913 Cecil B. DeMille, in association with Jesse Lasky, leased a barn with studio facilities on the southeast corner of Selma and Vine Streets from the Burns and Revier Studio and Laboratory, which had been established there.  DeMille then began production of The Squaw Man (1914). It became known as the Lasky-DeMille Barn and is currently the location of the Hollywood Heritage Museum.\nThe Charlie Chaplin Studios, on the northeast corner of La Brea and De Longpre Avenues just south of Sunset Boulevard, was built in 1917.  It has had many owners after 1953, including Kling Studios, which housed production for the Superman TV series with George Reeves; Red Skelton, who used the sound stages for his CBS TV variety show; and CBS, who filmed the TV series Perry Mason with Raymond Burr there.  It has also been owned by Herb Alpert's A&M Records and Tijuana Brass Enterprises.  It is currently The Jim Henson Company, home of the Muppets. In 1969 The Los Angeles Cultural Heritage Board named the studio a historical cultural monument.\nThe famous Hollywood Sign originally read \"Hollywoodland.\" It was erected in 1923 to advertise a new housing development in the hills above Hollywood. For several years the sign was left to deteriorate. In 1949 the Hollywood Chamber of Commerce stepped in and offered to remove the last four letters and repair the rest.\nThe sign, located at the top of Mount Lee, is now a registered trademark and cannot be used without the permission of the Hollywood Chamber of Commerce, which also manages the venerable Walk of Fame.\nThe first Academy Awards presentation ceremony took place on 16 May 1929, during a banquet held in the Blossom Room of the Hollywood Roosevelt Hotel on Hollywood Boulevard. Tickets were USD $10.00 and there were 250 people in attendance.\nFrom about 1930 five major Hollywood movie studios from all over the Los Angeles area, Paramount, RKO, 20th Century Fox, Metro-Goldwyn-Mayer and Warner Bros., owned large, grand theaters throughout the country for the exhibition of their movies.  The period between the years 1927 (the effective end of the silent era) to 1948 is considered the age of the \"Hollywood studio system\", or, in a more common term, the Golden Age of Hollywood.  In a landmark 1948 court decision, the Supreme Court ruled that movie studios could not own theaters and play only the movies of their studio and movie stars, thus an era of Hollywood history had unofficially ended.  By the mid-1950s, when television proved a profitable enterprise that was here to stay, movie studios started also being used for the production of programming in that medium, which is still the norm today.\n\n\n=== Bollywood ===\n\nBollywood is the Hindi-language film industry based in Mumbai (formerly known as Bombay), Maharashtra, India. The term is often incorrectly used to refer to the whole of Indian cinema; however, it is only a part of the total Indian film industry, which includes other production centres producing films in multiple languages. Bollywood is the largest film producer in India and one of the largest centres of film production in the world.Bollywood is formally referred to as Hindi cinema. Linguistically, Bollywood films tend to use a colloquial dialect of Hindi-Urdu, or Hindustani, mutually intelligible to both Hindi and Urdu speakers, while modern Bollywood films also increasingly incorporate elements of Hinglish.The Wrestlers (1899) and The Man and His Monkeys (1899), directed and produced by Harischandra Sakharam Bhatawdekar (H. S. Bhatavdekar), were the first two films made by Indian filmmakers, which were both short films. He was also the first Indian filmmaker to direct and produce the first documentary and news related film, titled The Landing of Sir M.M. Bhownuggree.\nPundalik (Shree Pundalik) (1912), by Dadasaheb Torne alias Rama Chandra Gopal, and Raja Harishchandra (1913), by Dadasaheb Phalke, were the first and second silent feature films respectively made in India. By the 1930s the industry was producing more than 200 films per annum. The first Indian sound film, Ardeshir Irani's Alam Ara (1931), was a major commercial success. There was clearly a huge market for talkies and musicals; Bollywood and all the regional film industries quickly switched to sound filming. Joymoti (1935 film) by Jyoti Prasad Agarwalla was the first Indian dubbed film, released in Calcutta on 10 March 1935. Till then, all dialogues of all talkies were had to be recorded at locations during the shooting of the film. Through Joymoti (1935 film), dubbing technology was successfully introduced to Indian cinema by Assamese filmmaker Jyoti Prasad Agarwalla.The 1930s and 1940s were tumultuous times: India was buffeted by the Great Depression, World War II, the Indian independence movement, and the violence of the Partition. Most Bollywood films were unabashedly escapist, but there were also a number of filmmakers who tackled tough social issues, or used the struggle for Indian independence as a backdrop for their plots.In 1937 Ardeshir Irani, of Alam Ara fame, made the first colour film in Hindi, Kisan Kanya. The next year, he made another colour film, a version of Mother India. However, colour did not become a popular feature until the late 1950s. At this time, lavish romantic musicals and melodramas were the staple fare at the cinema.\nFollowing India's independence, the period from the late 1940s to the early 1960s is regarded by film historians as the \"Golden Age\" of Hindi cinema. Defining key figures during this time included Raj Kapoor, Guru Dutt, Mehboob Khan, and Dilip Kumar.The 1970s was when the name \"Bollywood\" was coined, and when the quintessential conventions of commercial Bollywood films were established. Key to this was the emergence of the masala film genre, which combines elements of multiple genres (action, comedy, romance, drama, melodrama, musical). The masala film was pioneered in the early 1970s by filmmaker Nasir Hussain, along with screenwriter duo Salim-Javed, pioneering the Bollywood blockbuster format.\n\n\n== Economics ==\n\nProfitability of a film studio is crucially dependent on picking the right film projects and involving the right management and creative teams (cast, direction, visual design, score, photography, costume, set design, editing, and many additional specialties), but it also depends heavily on choosing the right scale and approach to film promotion, control over receipts through technologies such as digital rights management (DRM), sophisticated accounting practices, and management of ancillary revenue streams; in the extreme, for a major media franchise centered on film, the film might itself be only one large component of many large contributions to total franchise revenue.\nSubstantial revenues might also derive from licensing efforts and other activities centered around the management of intellectual property; for this reason, various national film industries are heavily invested in the politics and legal specifics of multilateral trade agreements. Hollywood is a large enough industry to impact America's net balance of trade, offsetting some of the decline of employment in the manufacturing sector of the American economy since the early 1980s; typical of recent economic trends in first world economies, a large number of manufacturing jobs paying moderate wages are offset by a smaller number of creating jobs paying high wages. As an intellectual property industry, the film industry (along with the software industry) are central to modern globalization.\nThe film industry differs from software, however, in functioning primarily as a cultural export. English-language culture is the most globalized of all cultures, despite China and India having internal populations to rival the global English footprint. For this reason, Hollywood is the dominant film industry in globalism and trade. India has both a large film industry and a large, internal English-language culture, though Bollywood has not yet become a center for English-language film exports on a major scale. Films designed for global export tend to be films centered on action rather than dialogue, especially nuanced dialogue which is not fully available to people speaking English as a second language (ESL). Unusually, Japanese Anime has a global audience, though these are sometimes dubbed into English by star-power Hollywood voice actors.\nOn the creative side, picking the right projects has traditionally been regarded as high risk. Increasingly the risk is being mitigated with approaches drawn from advanced data analytics, such as using models derived from machine learning (sometimes glorified as AI) to estimate the future revenue of a proposed project.\n\n\n== Statistics ==\n\n\n=== Largest industries by number of film productions ===\nThe following is a list of the top 15 countries by the number of feature films (fiction, animation and documentary) produced, according to the UNESCO Institute for Statistics, unless otherwise noted.\n\n\n=== Largest markets by box office revenue ===\n\n\n=== Largest markets by number of box office admissions ===\nThe following countries are the largest box office markets in terms of the number of tickets sold annually, according to the UNESCO Institute for Statistics.\n\n\n== See also ==\n\nCinema by country\nList of cinema of the world\nIndependent films\nOutline of film\nTelevision industry\n\n\n== Footnotes ==\n\n\n== Bibliography ==\nAllen J. Scott (2005) On Hollywood: The Place The Industry, Princeton University Press\nRobertson, Patrick (1988) The Guinness Book of Movie Facts & Feats. London: Guinness Publishing Limited\nArnab Jan Deka (27 Oct 1996) Fathers of Indian Cinema Bhatawdekar and Torney, Dainik Asam\nSanjit Narwekar (1995) Marathi Cinema : In Retrospect, Maharashtra Film, Stage & Cultural Development Corporation Ltd\nFiroze Rangoonwalla (1979) A Pictorial History of Indian Cinema, The Hamlyn Publishing Group Limited\n\n\n== External links ==\nMovie Making Manual wikibook\nEuropean Audiovisual Observatory\nOnline Movies, Taiwanese Law, and the American Film Industry at the Wayback Machine (archived 12 March 2005) - 4 February 2002 MP3 Newswire article on the potential impact of Net distribution on the film industry\nBox Office Cinefile Review\nDoctor Strange Movie (2016) Information"}