{"text": "A podcast is an episodic series of digital audio or video files which a user can download to listen. Alternatively, the word \"podcast\" may refer to the individual component of such a series or to an individual media file.Podcasting often uses a subscription model, whereby new episodes automatically download via web syndication to a user's own local computer, mobile application, or portable media player.Ben Hammersley originally suggested the word \"podcast\" as a portmanteau of \"iPod\" (a brand of media player) and \"broadcast\" in 2004.\nThe files distributed are in audio format, but may sometimes include other file formats such as PDF or EPUB. Videos shared following a podcast model are sometimes called video podcasts, vodcasts or vlogs.\nThe generator of a podcast maintains a central list of the files on a server as a web feed that one can  access through the Internet. The listener or viewer uses special client application software on a computer or media player, known as a podcatcher, which accesses this web feed, checks it for updates, and downloads any new files in the series. This process can be automated to download new files automatically; thus, it may seem to subscribers as though podcasters broadcast or \"push\" new episodes to them. Files are stored locally on the user's device, ready for offline use. Many different mobile applications allow people to subscribe and to listen to podcasts. Many of these applications allow users to download podcasts or to stream them on demand as an alternative to downloading. Many podcast players (applications as well as dedicated devices) allow listeners to skip around the podcast and to control the playback speed.\nSome have labeled podcasting a converged medium (bringing together audio, the web, and portable media players), as well as a disruptive technology that has caused some individuals in the radio business to reconsider established practices and preconceptions about audiences, consumption, production and distribution. Listeners usually consume podcasts free-of-charge, and one can often produce them for little to no cost, which sets them apart from the traditional 20th-century model of \"gate-kept\" media and their production tools. Podcast-makers can monetize their podcasts by allowing companies to purchase ad time, as well as via websites such as Patreon, which provides special extras and content to listeners for a fee. Podcasting is very much a horizontal media form – producers are consumers, consumers may become producers, and both can engage in conversations with each other.\n\n\n== Name ==\n\"Podcast\" is a portmanteau word, formed by combining \"iPod\" and \"broadcast\". The term \"podcasting\" as a name for the nascent technology was first suggested by The Guardian columnist and BBC journalist Ben Hammersley, who invented it in early February 2004 while \"padding out\" an article for The Guardian newspaper. Despite the etymology, the content can be accessed using any computer or similar device that can play media files. Use of the term \"podcast\" predated Apple's addition of formal support for podcasting to the iPod, or its iTunes software.Other names for podcasting include \"net cast\", intended as a vendor-neutral term without the loose reference to the Apple iPod. This name is used by shows from the TWiT.tv network. Some sources have also suggested the backronym \"portable on demand\" or \"POD\", for similar reasons.\n\n\n== History ==\n\nIn 2004, former MTV video jockey Adam Curry, in collaboration with Dave Winer – co-author of the RSS specification – is credited with coming up with the idea to automate the delivery and syncing of textual content to portable audio players.Podcasting, once an obscure method of spreading audio information, has become a recognized medium for distributing audio content, whether for corporate or personal use. Podcasts are similar to radio programs in form, but they exist as audio files that can be played at a listener's convenience, anytime or anywhere.The first application to make this process feasible was iPodderX, developed by August Trometer and Ray Slakinski. By 2007, audio podcasts were doing what was historically accomplished via radio broadcasts, which had been the source of radio talk shows and news programs since the 1930s. This shift occurred as a result of the evolution of internet capabilities along with increased consumer access to cheaper hardware and software for audio recording and editing.\nIn October 2003, Matt Schichter launched his weekly chat show The BackStage Pass. B.B. King, Third Eye Blind, Gavin DeGraw, The Beach Boys, and Jason Mraz were notable guests the first season. The hour long radio show was recorded live, transcoded to 16kbit/s audio for dial-up online streaming. Despite a lack of a commonly accepted identifying name for the medium at the time of its creation, The Backstage Pass which became known as Matt Schichter Interviews is commonly believed to be the first podcast to be published online.\nIn August 2004, Adam Curry launched his show Daily Source Code. It was a show focused on chronicling his everyday life, delivering news, and discussions about the development of podcasting, as well as promoting new and emerging podcasts. Curry published it in an attempt to gain traction in the development of what would come to be known as podcasting and as a means of testing the software outside of a lab setting. The name Daily Source Code was chosen in the hope that it would attract an audience with an interest in technology.Daily Source Code started at a grassroots level of production and was initially directed at podcast developers. As its audience became interested in the format, these developers were inspired to create and produce their own projects and, as a result, they improved the code used to create podcasts. As more people learned how easy it was to produce podcasts, a community of pioneer podcasters quickly appeared.In June 2005, Apple released iTunes 4.9 which added formal support for podcasts, thus negating the need to use a separate program in order to download and transfer them to a mobile device. While this made access to podcasts more convenient and widespread, it also effectively ended advancement of podcatchers by independent developers. Additionally, Apple issued cease and desist orders to many podcast application developers and service providers for using the term \"iPod\" or \"Pod\" in their products' names.\n\nWithin a year, many podcasts from public radio networks like the BBC, CBC Radio One, NPR, and Public Radio International placed many of their radio shows on the iTunes platform. In addition, major local radio stations like WNYC in New York City and WHYY-FM radio in Philadelphia, KCRW in Los Angeles placed their programs on their websites and later on the iTunes platform.\nConcurrently, CNET, This Week in Tech, and later Bloomberg Radio, the Financial Times, and other for-profit companies provided podcast content, some using podcasting as their only distribution system.\n\n\n=== IP issues in trademark and patent law ===\n\n\n==== Trademark applications ====\nBetween February 10 and 25 March 2005, Shae Spencer Management, LLC of Fairport, New York filed a trademark application to register the term \"podcast\" for an \"online prerecorded radio program over the internet\". On September 9, 2005, the United States Patent and Trademark Office (USPTO) rejected the application, citing Wikipedia's podcast entry as describing the history of the term. The company amended their application in March 2006, but the USPTO rejected the amended application as not sufficiently differentiated from the original. In November 2006, the application was marked as abandoned.As of September 20, 2005, known trademarks that attempted to capitalize on podcast included: ePodcast, GodCast, GuidePod, MyPod, Pod-Casting, Podango, PodCabin, Podcast, Podcast Realty, Podcaster, PodcastPeople, Podgram PodKitchen, PodShop, and Podvertiser.By February 2007, there had been 24 attempts to register trademarks containing the word \"PODCAST\" in the United States, but only \"PODCAST READY\" from Podcast Ready, Inc. was approved.\n\n\n==== Apple trademark protections ====\nOn September 26, 2004, it was reported that Apple Inc. had started to crack down on businesses using the string \"POD\", in product and company names. Apple sent a cease and desist letter that week to Podcast Ready, Inc., which markets an application known as \"myPodder\". Lawyers for Apple contended that the term \"pod\" has been used by the public to refer to Apple's music player so extensively that it falls under Apple's trademark cover. Such activity was speculated to be part of a bigger campaign for Apple to expand the scope of its existing iPod trademark, which included trademarking \"IPOD\", \"IPODCAST\", and \"POD\". On November 16, 2006, the Apple Trademark Department stated that \"Apple does not object to third-party usage of the generic term 'podcast' to accurately refer to podcasting services\" and that \"Apple does not license the term\". However, no statement was made as to whether or not Apple believed they held rights to it.\n\n\n==== Personal Audio lawsuits ====\nPersonal Audio, a company referred to as a \"patent troll\" by the Electronic Frontier Foundation, filed a patent on podcasting in 2009 for a claimed invention in 1996. In February 2013, Personal Audio started suing high-profile podcasters for royalties, including The Adam Carolla Show and the HowStuffWorks podcast. US Congressman Peter DeFazio's previously proposed \"SHIELD Act\" intended to curb patent trolls.In October 2013, the EFF filed a petition with the US Trademark Office to invalidate the Personal Audio patent.On August 18, 2014, the Electronic Frontier Foundation announced that Adam Carolla had settled with Personal Audio.On April 10, 2015, the U.S. Patent and Trademark Office invalidated five provisions of Personal Audio's podcasting patent.\n\n\n== Variants ==\n\n\n=== Enhanced podcasts ===\nAn enhanced podcast can display images synchronized with audio. These can contain chapter markers, hyperlinks, and artwork, all of which is synced to a specific program or device. When an enhanced podcast is played within its specific program or device, all the appropriate information should be displayed at the same time and in the same window, making it easier to display materials.\n\n\n=== Podcast novels ===\nA podcast novel (also known as a serialized audiobook or podcast audiobook) is a literary format that combines the concepts of a podcast and an audiobook. Like a traditional novel, a podcast novel is a work of long literary fiction; however, this form of the novel is recorded into episodes that are delivered online over a period of time and in the end available as a complete work for download. The episodes may be delivered automatically via RSS, through a website, blog, or another syndication method. These files are either listened to directly on a user's computer or loaded onto a portable media device to be listened to later.\nThe types of novels that are podcasted vary from new works from new authors that have never been printed, to well-established authors that have been around for years, to classic works of literature that have been in print for over a century. In the same style as an audiobook, podcast novels may be elaborately narrated with separate voice actors for each character and sound effects, similar to a radio play. Other podcast novels have a single narrator reading the text of the story with little or no sound effects.\nPodcast novels are distributed over the Internet, commonly on a weblog. Podcast novels are released in episodes on a regular schedule (e.g., once a week) or irregularly as each episode is released when completed. They can either be downloaded manually from a website or blog or be delivered automatically via RSS or another method of syndication.  Ultimately, a serialized podcast novel becomes a completed audiobook.Some podcast novelists give away a free podcast version of their book as a form of promotion. Some such novelists have even secured publishing contracts to have their novels printed. Podcast novelists have commented that podcasting their novels lets them build audiences even if they cannot get a publisher to buy their books. These audiences then make it easier to secure a printing deal with a publisher at a later date. These podcast novelists also claim the exposure that releasing a free podcast gains them makes up for the fact that they are giving away their work for free.\n\n\n=== Video podcasts ===\n\nA video podcast (sometimes shortened to \"vodcast\") includes video clips. Web television series are often distributed as video podcasts.\nDead End Days (2003–2004) is commonly believed to be the first video podcast. That serialized dark comedy about zombies was broadcast from 31 October 2003 through 2004.Since the spread of the Internet and the use of Internet broadband connection TCP, which helps to identify various applications, a faster connection to the Internet has been created and a wide amount of communication has been created. Video podcasts have become extremely popular online and are often presented as short video clips, usually excerpts of a longer recording. Video clips are being used on pre-established websites, and increasing numbers of websites are being created solely for the purpose of hosting video clips and podcasts. Video podcasts are being streamed on intranets and extranets, and private and public networks, and are taking communication through the Internet to new levels.Most video clips are now submitted and produced by individuals. Video podcasts are also being used for web television, commonly referred to as Web TV, a rapidly growing genre of digital entertainment that uses various forms of new media to deliver to an audience both reruns of shows or series and content created or delivered originally online via broadband and mobile networks, web television shows, or web series. Examples include Amazon Video, Hulu, and Netflix.  Other types of video podcasts used for web television may be short-form, anywhere from 2–9 minutes per episode, typically used for advertising, video blogs, amateur filming, journalism, and convergence with traditional media.Video podcasting is also helping build businesses, especially in the sales and marketing sectors. Through video podcasts, businesses both large and small can advertise their wares and services in a modern, cost-effective way. In the past, big businesses had better access to expensive studios where sophisticated advertisements were produced, but now even the smallest businesses can create high-quality media with just a camera, editing software, and the Internet.In a two-year study, 2012-2013, conducted by a South African university a question was raised; over the years of podcast development, is podcasting socially inclusive. The results of this study concluded with minor quarks, podcasting is socially inclusive.\n\n\n=== Oggcast ===\nAn oggcast is a podcast recorded and distributed exclusively in the Vorbis audio codec with the Ogg container format, and/or other similarly free codecs/formats. For example, a podcast distributed both in the non-free MP3 format and the free Ogg format would not technically meet the definition of an oggcast. In contrast, a podcast distributed in both the Vorbis and Speex codecs would meet the strict definition of an oggcast. The term oggcast is a combination of the word \"ogg\" from the term Ogg Vorbis, and the syllable \"cast\", from \"broadcast\".\nThe term was coined for the fifth season of the Gnu World Order by Klaatu in 2010, when the show declared itself \"the world's first oggcast\".  At the time, the show was one of the few that released only in free formats, with no MP3 feed as an option. This gave way to other shows using the term, with hosts gathering in the #oggcastplanet connect IRC channel on the Freenode network to compare notes.\nThe Linux Link Tech Show, one of the longer running Linux podcasts still in production, has a program in the Ogg Vorbis format in its archives from January 7, 2004.Oggcasters tend to be broadcasters who prefer not to use audio and video codecs that have patent and/or licensing restrictions, such as the MP3 codec.Recording and distributing podcasts in the Ogg Vorbis audio format has advantages. Mozilla Firefox and Google Chrome web browsers both support playing Vorbis files directly in the browser without requiring plugins. Vorbis may produce better audio quality with a smaller file size than alternative codecs such as AAC or MP3. However, this has not been proven conclusively. Ogg Vorbis is not bound by patents and is considered \"free software\" in the sense that no corporate entity owns the rights to the format. Some people feel that this is a safer container for their multimedia content for this reason. However, oggcasters can generally not reach as wide of an audience as more traditional podcasters. This is mainly due to the lack of native Ogg Vorbis support in Microsoft's Internet Explorer and Apple's Safari web browser, and the lack of Ogg Vorbis support in many mobile audio devices.Oggcast Planet maintains a central list of oggcasts.\n\n\n=== Political podcast ===\n\nA political podcast focuses on current events, lasts usually a half hour to an hour, often with a relaxed and conversational tone, and features journalists and politicians and pollsters and writers and others with credentials in the public sphere. Most political podcasts have a host–guest interview format and are broadcast each week based on the news cycle. Political podcasts have blossomed in the past few years in the United States because of the long election cycle. Larger news sites such as the Radio Atlantic and the Spectator have started weekly political podcasts in recent years, as well as smaller podcasts such as the Bruderhof's Life Together podcast and Danny Anderson's Sectarian Review and Crooked Media's Pod Save America.\n\n\n=== Podguide ===\nA podguide is an enhanced audio tour podcast. It is a single audio file where each chapter displays a picture and a number of what to look at a certain stopover. The numbers correspond to the numbers on a map that can be downloaded via the link incorporated into the artwork of the chapters in the podguide. Podguides are in the m4a format and can only be listened to through iTunes or an iPod. It is like a soundseeing tour but with pictures and a map, so users can take the tour themselves.\n\n\n== Uses ==\n\nCommunities use collaborative podcasts to support multiple contributors podcasting through generally simplified processes, and without having to host their own individual feeds. A community podcast can also allow members of the community (related to the podcast topic) to contribute to the podcast in many different ways. This method was first used for a series of podcasts hosted by the Regional Educational Technology Center at Fordham University in 2005. Anders Gronstedt explores how businesses like IBM and EMC use podcasts as an employee training and communication channel.The podcast industry is very profitable. Over 50 million people listen to podcasts each month. A small, yet efficient number of listeners are also podcast creators. Creating a podcast is reasonably inexpensive. It requires just a microphone, laptop or other personal computer, and a room with some sound blocking. Podcast creators tend to have a good listener base because of their relationships with the listeners.\n\n\n== See also ==\nList of podcasting companies\nList of podcatchers\nMP3 blog\nProtection of Broadcasts and Broadcasting Organizations Treaty\nScreencast\nUser-generated content\nWebcast\n\n\n== References ==\n\n\n== External links ==\n\n Podcasting at Wikibooks\n Media related to Podcasts at Wikimedia Commons\nPodcasting Legal Guide: Rules for the Revolution, information by Creative Commons"}