{"text": "Streaming media is multimedia that is constantly received by and presented to an end-user while being delivered by a provider. The verb \"to stream\" refers to the process of delivering or obtaining media in this manner; the term refers to the delivery method of the medium, rather than the medium itself, and is an alternative to file downloading, a process in which the end-user obtains the entire file for the content before watching or listening to it.\nA client end-user can use their media player to start playing digital video or digital audio content before the entire file has been transmitted. Distinguishing delivery method from the media distributed applies specifically to telecommunications networks, as most of the delivery systems are either inherently streaming (e.g. radio, television, streaming apps) or inherently non-streaming (e.g. books, video cassettes, audio CDs). For example, in the 1930s, elevator music was among the earliest popular music available as streaming media; nowadays Internet television is a common form of streamed media. The term \"streaming media\" can apply to media other than video and audio, such as live closed captioning, ticker tape, and real-time text, which are all considered \"streaming text\".\nLive streaming is the delivery of Internet content in real-time much as live television broadcasts content over the airwaves via a television signal. Live internet streaming requires a form of source media (e.g. a video camera, an audio interface, screen capture software), an encoder to digitize the content, a media publisher, and a content delivery network to distribute and deliver the content. Live streaming does not need to be recorded at the origination point, although it frequently is.\nThere are challenges with streaming content on the Internet. If the user does not have enough bandwidth in their Internet connection, they may experience stops, lags, or slow buffering of the content. Some users may not be able to stream certain content due to not having compatible computer or software systems.\nSome popular streaming services include the video sharing website YouTube; Netflix, Amazon Video and Vudu which stream films and television shows; Spotify and Apple Music which stream music; and the video game live streaming sites Twitch and Mixer.\n\n\n== History ==\n\nIn the early 1920s, George O. Squier was granted patents for a system for the transmission and distribution of signals over electrical lines, which was the technical basis for what later became Muzak, a technology streaming continuous music to commercial customers without the use of radio. Attempts to display media on computers date back to the earliest days of computing in the mid-20th century. However, little progress was made for several decades, primarily due to the high cost and limited capabilities of computer hardware. From the late 1980s through the 1990s, consumer-grade personal computers became powerful enough to display various media. The primary technical issues related to streaming were having enough CPU power bus bandwidth to support the required data rates, creating low-latency interrupt paths in the operating system to prevent buffer underrun, and enabling skip-free streaming of the content. However, computer networks were still limited in the mid-1990s, and audio and video media were usually delivered over non-streaming channels, such as by downloading a digital file from a remote server and then saving it to a local drive on the end user's computer or storing it as a digital file and playing it back from CD-ROMs. In 1991 the first commercial Ethernet Switch (see Network Switch) was introduced, which enabled more powerful computer networks leading to the first streaming video solutions (see Business developments below) used by schools and corporations such as expanding Bloomberg Television worldwide. In the mid 1990s the World Wide Web was established, but streaming audio would not be practical until years later.\n\n\n=== Multimedia compression ===\n\nPractical streaming media was only made possible with advances in data compression, due to the impractically high bandwidth requirements of uncompressed media. Raw digital audio encoded with pulse-code modulation (PCM) requires a bandwidth of 1.4 Mbps for uncompressed CD audio, while raw digital video requires a bandwidth of 168 Mbps for SD video and over 1 Gbps for FHD video.The most important compression technique that enabled practical streaming media is the discrete cosine transform (DCT), a form of lossy compression conceived in 1972 by Nasir Ahmed, who developed the algorithm with T. Natarajan and K. R. Rao at the University of Texas in 1973. The DCT algorithm is the basis for the first practical video coding format, H.261, in 1988. It was initially used for online video conferencing. It was followed by more DCT-based video coding standards, most notably MPEG video formats from 1991 onwards.The DCT algorithm was adapted into the modified discrete cosine transform (MDCT) by J. P. Princen, A. W. Johnson and A. B. Bradley at the University of Surrey in 1987. The MDCT algorithm is fundamental to the MP3 audio format introduced in 1994, and especially the most widely used Advanced Audio Coding (AAC) format introduced in 1999.\n\n\n=== Late 1990s to early 2000s ===\nDuring the late 1990s and early 2000s, users had increased access to computer networks, especially the Internet. During the early 2000s, users had access to increased network bandwidth, especially in the \"last mile\". These technological improvements facilitated the streaming of audio and video content to computer users in their homes and workplaces. There was also an increasing use of standard protocols and formats, such as TCP/IP, HTTP, HTML as the Internet became increasingly commercialized, which led to an infusion of investment into the sector. The band Severe Tire Damage was the first group to perform live on the Internet. On June 24, 1993, the band was playing a gig at Xerox PARC while elsewhere in the building, scientists were discussing new technology (the Mbone) for broadcasting on the Internet using multicasting. As proof of PARC's technology, the band's performance was broadcast and could be seen live in Australia and elsewhere. In a March 2017 interview, band member Russ Haines stated that the band had used approximately \"half of the total bandwidth of the internet\" to stream the performance, which was a 152-by-76 pixel video, updated eight to twelve times per second, with audio quality that was \"at best, a bad telephone connection\".Microsoft Research developed a Microsoft TV application which was compiled under MS Windows Studio Suite and tested in conjunction with Connectix QuickCam. RealNetworks was also a pioneer in the streaming media markets, when it broadcast a baseball game between the New York Yankees and the Seattle Mariners over the Internet in 1995. The first symphonic concert on the Internet took place at the Paramount Theater in Seattle, Washington on November 10, 1995. The concert was a collaboration between The Seattle Symphony and various guest musicians such as Slash (Guns 'n Roses, Velvet Revolver), Matt Cameron (Soundgarden, Pearl Jam), and Barrett Martin (Screaming Trees). When Word Magazine launched in 1995, they featured the first-ever streaming soundtracks on the Internet.Metropolitan Opera Live in HD is a program in which the Metropolitan Opera streams an opera performance \"live\", as the performance is taking place. In 2013–2014, 10 operas were transmitted via satellite into at least 2,000 theaters in 66 countries.\n\n\n=== Etymology ===\nThe term \"streaming\" was first used for tape drives made by Data Electronics Inc. for drives meant to slowly ramp up and run for the entire track; the slow ramp times resulted in lower drive costs, making a more competitive product. \"Streaming\" was applied in the early 1990s as a better description for video on demand and later live video on IP networks. It was first done by Starlight Networks for video streaming and Real Networks for audio streaming. At the time such video was usually referred to as \"store and forward video\", which was misleading nomenclature.\n\n\n=== Business developments ===\nThe first commercial streaming product appeared in late 1992 and was named StarWorks. StarWorks enabled on demand MPEG-1 full motion videos to be randomly accessed on corporate Ethernet networks. Starworks was from Starlight Networks, who also pioneered live video streaming on Ethernet and via Internet Protocol over satellites with Hughes Network Systems. Other early companies who created streaming media technology include RealNetworks (then known as Progressive Networks) and Protocomm both prior to wide spread World Wide Web usage and once the web became popular in the late 90s, streaming video on the internet blossomed from startups such as VDOnet, acquired by RealNetworks, and Precept, acquired by Cisco.\nMicrosoft developed a media player known as ActiveMovie in 1995 that allowed streaming media and included a proprietary streaming format, which was the precursor to the streaming feature later in Windows Media Player 6.4 in 1999. In June 1999 Apple also introduced a streaming media format in its QuickTime 4 application. It was later also widely adopted on websites along with RealPlayer and Windows Media streaming formats. The competing formats on websites required each user to download the respective applications for streaming and resulted in many users having to have all three applications on their computer for general compatibility.\nIn 2000 Industryview.com launched its \"world's largest streaming video archive\" website to help businesses promote themselves. Webcasting became an emerging tool for business marketing and advertising that combined the immersive nature of television with the interactivity of the Web. The ability to collect data and feedback from potential customers caused this technology to gain momentum quickly.Around 2002, the interest in a single, unified, streaming format and the widespread adoption of Adobe Flash prompted the development of a video streaming format through Flash, which was the format used in Flash-based players on video hosting sites. The first popular video streaming site, YouTube, was founded by Steve Chen, Chad Hurley and Jawed Karim in 2005. It initially used a Flash-based player, which played MPEG-4 AVC video and AAC audio, but now defaults to HTML5 video. Increasing consumer demand for live streaming has prompted YouTube to implement a new live streaming service to users. The company currently also offers a (secured) link returning the available connection speed of the user.The Recording Industry Association of America (RIAA) revealed through its 2015 earnings report that streaming services were responsible for 34.3 percent of the year's total music industry's revenue, growing 29 percent from the previous year and becoming the largest source of income, pulling in around $2.4 billion. US streaming revenue grew 57 percent to $1.6 billion in the first half of 2016 and accounted for almost half of industry sales.\n\n\n== Use of streaming media by consumers ==\n\nThese advances in computer networking, combined with powerful home computers and modern operating systems, made streaming media practical and affordable for ordinary consumers. Stand-alone Internet radio devices emerged to offer listeners a no-computer option for listening to audio streams. These audio streaming services have become increasingly popular over recent years, as streaming music hit a record of 118.1 billion streams in 2013. In general, multimedia content has a large volume, so media storage and transmission costs are still significant. To offset this somewhat, media are generally compressed for both storage and streaming. Increasing consumer demand for streaming of high definition (HD) content has led the industry to develop a number of technologies such as WirelessHD  or ITU-T G.hn, which are optimized for streaming HD content without forcing the user to install new networking cables. In 1996, digital pioneer Marc Scarpa produced the first large-scale, online, live broadcast in history, the Adam Yauch-led Tibetan Freedom Concert, an event that would define the format of social change broadcasts. Scarpa continued to pioneer in the streaming media world with projects such as Woodstock '99, Townhall with President Clinton, and more recently Covered CA's campaign \"Tell a Friend Get Covered\" which was live streamed on YouTube.\n\nA media stream can be streamed either \"live\" or \"on demand\". Live streams are generally provided by a means called \"true streaming\". True streaming sends the information straight to the computer or device without saving the file to a hard disk. On-demand streaming is provided by a means called progressive streaming or progressive download. Progressive streaming saves the file to a hard disk and then is played from that location. On-demand streams are often saved to hard disks and servers for extended amounts of time; while the live streams are only available at one time only (e.g., during the football game). Streaming media is increasingly being coupled with use of social media. For example, sites such as YouTube encourage social interaction in webcasts through features such as live chat, online surveys, user posting of comments online and more. Furthermore, streaming media is increasingly being used for social business and e-learning. Due the popularity of the streaming medias, many developers have introduced free HD movie streaming apps for the people who use smaller devices such as tablets and smartphones for everyday purposes.\nThe Horowitz Research State of Pay TV, OTT and SVOD 2017 report said that 70 percent of those viewing content did so through a streaming service, and that 40 percent of TV viewing was done this way, twice the number from five years earlier. Millennials, the report said, streamed 60 percent of content.\n\n\n=== Transition from a DVD based to streaming based viewing culture ===\nOne of the movie streaming industry's largest impacts was on the DVD industry, which effectively met its demise with the mass popularization of online content. The rise of media streaming caused the downfall of many DVD rental companies such as Blockbuster. In July 2015 the New York Times published an article about Netflix's DVD services. It stated that Netflix was continuing their DVD services with 5.3 million subscribers, which was a significant drop from the previous year. On the other hand, their streaming services had 65 million members. In a March 2016 study assessing the “Impact of Movie Streaming over traditional DVD Movie Rental,” it was found that respondents did not purchase DVD movies nearly as much anymore, if at all, as streaming had taken over the market. According to the study, viewers did not find movie quality to be significantly different between DVD and online streaming. Issues that respondents believed needed improvement with movie streaming included functions of fast forwarding or rewinding, as well as search functions. The article highlighted that the quality of movie streaming as an industry would only increase in time, as advertising revenue continued to soar on a yearly basis throughout the industry, providing incentive for quality content production.\n\n\n=== The roots of music streaming: Napster ===\nMusic streaming is one of the most popular ways in which consumers interact with streaming media. In the age of digitization, the private consumption of music transformed into a public good largely due to one player in the market: Napster.\nNapster, a peer-to-peer (P2P) file sharing network where users could upload and download mp3 files freely, broke all music industry conventions when it launched in early 1999 out of Hull, Massachusetts. The platform was developed by Shawn and John Fanning as well as Sean Parker. In an interview from 2009, Shawn Fanning explained that Napster “ was something that came to me as a result of seeing a sort of an unmet need and the passion people had for being able to find all this music, particularly a lot of the obscure stuff which wouldn’t be something you go to a record store and purchase, so it felt like a problem worth solving.”Not only did this development disrupt the music industry by making songs that previously required payment to acquire freely accessible to any Napster user, it demonstrated the power of P2P networks in turning any digital file into a public, shareable good. For the brief period of time that Napster existed, mp3 files fundamentally changed as a type of good. Songs were no longer financially excludable - barring access to a computer with internet access - and they were not rival, meaning if one person downloaded a song it did not diminish another user from doing the same. Napster, like most other providers of public goods, faced the problem of free riding. Every user benefits when an individual uploads an mp3 file, but there is no requirement or mechanism that forces all users to share their music. Thus, Napster users were incentivized to let others upload music without sharing any of their own files.\nThis structure revolutionized the consumer’s perception of ownership over digital goods - it made music freely replicable. Napster quickly garnered millions of users, growing faster than any other business in history. At the peak of its existence, Napster boasted about 80 million users globally. The site gained so much traffic that many college campuses had to block access to Napster because it created network congestion from so many students sharing music files.The advent of Napster sparked the creation of numerous other P2P sites including LimeWire (2000), BitTorrent (2001), and the Pirate Bay (2003). The reign of P2P networks was short lived. The first to fall was Napster in 2001. Numerous lawsuits were filed against Napster by various record labels, all of which were subsidiaries of Universal Music Group, Sony Music Entertainment, Warner Music Group, or EMI. In addition to this, the Recording Industry Association of America (RIAA) also filed a lawsuit against Napster on the grounds of unauthorized distribution of copyrighted material, which ultimately led Napster to shutting down in 2001. In an interview with Gary Stiffelman, who represents Eminem, Aerosmith, and TLC, he explained why Napster was a problem for record labels: loss in revenue. In an interview with the New York Times, Stiffelman said, “I’m not an opponent of artists’ music being included in these services, I’m just an opponent of their revenue not being shared.\"\n\n\n==== The fight for intellectual property rights: A&M Records, Inc. v. Napster, Inc. ====\nThe lawsuit A&M Records, Inc. v. Napster, Inc. fundamentally changed the way consumers interact with music streaming. It was argued on October 2, 2000 and was decided on February 12, 2001. The Court of Appeals for the Ninth Circuit ruled that a P2P file sharing service could be held liable for contributory and vicarious infringement of copyright, serving as a landmark decision for intellectual property law.The first issue that the Court addressed was “fair use,” which says that otherwise infringing activities are permissible so long as it is for purposes “such as criticism, comment, news reporting, teaching [...] scholarship, or research.” Judge Beezer, the Judge for this case, noted that Napster claimed that its services fit “three specific alleged fair uses: sampling, where users make temporary copies of a work before purchasing; space-shifting, where users access a sound recording through the Napster system that they already own in audio CD format; and permissive distribution of recordings by both new and established artists.” Judge Beezer found that Napster did not fit these criteria, instead enabling their users to repeatedly copy music, which would affect the market value of the copyrighted good.\nThe second claim by the plaintiffs was that Napster was actively contributing to copyright infringement since it had knowledge of widespread file sharing on their platform. Since Napster took no action to reduce infringement and financially benefited from repeated use, the Court ruled against the P2P site. The court found that “as much as eighty-seven percent of the files available on Napster may be copyrighted and more than seventy percent may be owned or administered by plaintiffs.”The injunction ordered against Napster ended the brief period in which music streaming was a public good - non-rival and non-excludable in nature. Other P2P networks had some success at sharing mp3’s, though they all met a similar fate in court. The ruling set the precedent that copyrighted digital content cannot be freely replicated and shared unless given consent by the owner, thereby strengthening the property rights of artists and record labels alike.\n\n\n=== Music streaming platforms ===\nAlthough music streaming is no longer a freely replicable public good, streaming platforms such as Spotify, Deezer, Apple Music, SoundCloud, and Prime Music have shifted music streaming to a club-type good. While some platforms, most notably Spotify, give customers access to a freemium service that enables the use of limited features for exposure to advertisements, most companies operate under a premium subscription model. Under such circumstances, music streaming is financially excludable, requiring that customers pay a monthly fee for access to a music library, but non-rival, since one customer’s use does not impair another’s.\nMusic streaming platforms have grown rapidly in popularity in recent years. Spotify has over 207 million users, as of January 1, 2019, in 78 different countries, Apple Music has about 60 million, and SoundCloud has 175 million. All platforms provide varying degrees of accessibility. Apple Music and Prime Music only offer their services for paid subscribers, whereas Spotify and SoundCloud offer freemium and premium services. Napster, owned by Rhapsody since 2011, has resurfaced as a music streaming platform offering subscription based services to over 4.5 million users as of January 2017. As music streaming providers have proliferated and competition has pushed the price of subscriptions down, music piracy rates have also fallen (see chart to the right).\nThe music industry’s response to music streaming was initially negative. Along with music piracy, streaming services disrupted the market and contributed to the fall in revenue from $14.6 billion in revenue in 1999 to $6.3 billion in 2009 for the U.S. CD’s and single-track downloads were not selling because content was freely available on the Internet. The result was that record labels invested more in artists that were “safe” - chart music became more appealing to producers than bands with unique sounds. In 2018, however, music streaming revenue exceeded that of traditional revenue streams (e.g. record sales, album sales, downloads). 2017 alone saw a 41.1% increase in streaming revenue alone and an 8.1% increase in overall revenue. Streaming revenue is one of the largest driving forces behind the growth in the music industry. In an interview, Jonathan Dworkin, a senior vice president of strategy and business development at Universal, said that “we cannot be afraid of perpetual change, because that dynamism is driving growth.”\n\n\n== Bandwidth and storage ==\n\nA broadband speed of 2 Mbit/s or more is recommended for streaming standard definition video without experiencing buffering or skips, especially live video, for example to a Roku, Apple TV, Google TV or a Sony TV Blu-ray Disc Player. 5 Mbit/s is recommended for High Definition content and 9 Mbit/s for Ultra-High Definition content. Streaming media storage size is calculated from the streaming bandwidth and length of the media using the following formula (for a single user and file) requires a storage size in megabytes which is equal to length (in seconds) × bit rate (in bit/s) / (8 × 1024 × 1024). For example, one hour of digital video encoded at 300 kbit/s (this was a typical broadband video in 2005 and it was usually encoded in a 320 × 240 pixels window size) will be:\n(3,600 s × 300,000 bit/s) / (8×1024×1024) requires around 128 MB of storage. \nIf the file is stored on a server for on-demand streaming and this stream is viewed by 1,000 people at the same time using a Unicast protocol, the requirement is 300 kbit/s × 1,000 = 300,000 kbit/s = 300 Mbit/s of bandwidth. This is equivalent to around 135 GB per hour. Using a multicast protocol the server sends out only a single stream that is common to all users. Therefore, such a stream would only use 300 kbit/s of serving bandwidth. See below for more information on these protocols. The calculation for live streaming is similar. Assuming that the seed at the encoder is 500 kbit/s and if the show lasts for 3 hours with 3,000 viewers, then the calculation is number of MBs transferred = encoder speed (in bit/s) × number of seconds × number of viewers / (8*1024*1024). The results of this calculation are as follows: number of MBs transferred = 500 x 1024 (bit/s) × 3 × 3,600 ( = 3 hours) × 3,000 (number of viewers) / (8*1024*1024) = 1,977,539 MB\n\n\n== Protocols ==\nThe audio stream is compressed to make the file size smaller using an audio coding format such as MP3, Vorbis, AAC or Opus. The video stream is compressed using a video coding format to make the file size smaller. Video coding formats include H.264, HEVC, VP8 or VP9. Encoded audio and video streams are assembled in a container \"bitstream\" such as MP4, FLV, WebM, ASF or ISMA. The bitstream is delivered from a streaming server to a streaming client (e.g., the computer user with their Internet-connected laptop) using a transport protocol, such as Adobe's RTMP or RTP. In the 2010s, technologies such as Apple's HLS, Microsoft's Smooth Streaming, Adobe's HDS and non-proprietary formats such as MPEG-DASH have emerged to enable adaptive bitrate streaming over HTTP as an alternative to using proprietary transport protocols. Often, a streaming transport protocol is used to send video from an event venue to a \"cloud\" transcoding service and CDN, which then uses HTTP-based transport protocols to distribute the video to individual homes and users. The streaming client (the end user) may interact with the streaming server using a control protocol, such as MMS or RTSP. The quality of the interaction between servers and users is based on the workload of the streaming service; as more users attempt to access a service, the more quality is affected unless there is enough bandwidth or the host is using enough proxy networks.\n\n\n== Protocol challenges ==\nDesigning a network protocol to support streaming media raises many problems. Datagram protocols, such as the User Datagram Protocol (UDP), send the media stream as a series of small packets. This is simple and efficient; however, there is no mechanism within the protocol to guarantee delivery. It is up to the receiving application to detect loss or corruption and recover data using error correction techniques. If data is lost, the stream may suffer a dropout. The Real-time Streaming Protocol (RTSP), Real-time Transport Protocol (RTP) and the Real-time Transport Control Protocol (RTCP) were specifically designed to stream media over networks. RTSP runs over a variety of transport protocols, while the latter two are built on top of UDP.\nAnother approach that seems to incorporate both the advantages of using a standard web protocol and the ability to be used for streaming even live content is adaptive bitrate streaming. HTTP adaptive bitrate streaming is based on HTTP progressive download, but contrary to the previous approach, here the files are very small, so that they can be compared to the streaming of packets, much like the case of using RTSP and RTP. Reliable protocols, such as the Transmission Control Protocol (TCP), guarantee correct delivery of each bit in the media stream. However, they accomplish this with a system of timeouts and retries, which makes them more complex to implement. It also means that when there is data loss on the network, the media stream stalls while the protocol handlers detect the loss and retransmit the missing data. Clients can minimize this effect by buffering data for display. While delay due to buffering is acceptable in video on demand scenarios, users of interactive applications such as video conferencing will experience a loss of fidelity if the delay caused by buffering exceeds 200 ms.\n\nUnicast protocols send a separate copy of the media stream from the server to each recipient. Unicast is the norm for most Internet connections, but does not scale well when many users want to view the same television program concurrently. Multicast protocols were developed to reduce the server/network loads resulting from duplicate data streams that occur when many recipients receive unicast content streams independently. These protocols send a single stream from the source to a group of recipients. Depending on the network infrastructure and type, multicast transmission may or may not be feasible. One potential disadvantage of multicasting is the loss of video on demand functionality. Continuous streaming of radio or television material usually precludes the recipient's ability to control playback. However, this problem can be mitigated by elements such as caching servers, digital set-top boxes, and buffered media players.\nIP Multicast provides a means to send a single media stream to a group of recipients on a computer network. A multicast protocol, usually Internet Group Management Protocol, is used to manage delivery of multicast streams to the groups of recipients on a LAN. One of the challenges in deploying IP multicast is that routers and firewalls between LANs must allow the passage of packets destined to multicast groups. If the organization that is serving the content has control over the network between server and recipients (i.e., educational, government, and corporate intranets), then routing protocols such as Protocol Independent Multicast can be used to deliver stream content to multiple Local Area Network segments. As in mass delivery of content, multicast protocols need much less energy and other resources, widespread introduction of reliable multicast (broadcast-like) protocols and their preferential use, wherever possible, is a significant ecological and economic challenge. Peer-to-peer (P2P) protocols arrange for prerecorded streams to be sent between computers. This prevents the server and its network connections from becoming a bottleneck. However, it raises technical, performance, security, quality, and business issues.\n\n\n== Applications and marketing ==\nUseful – and typical – applications of the \"streaming\" concept are, for example, long video lectures performed \"online\" on the Internet. An advantage of this presentation is that these lectures can be very long, although they can always be interrupted or repeated at arbitrary places. There are also new marketing concepts. For example, the Berlin Philharmonic Orchestra sells Internet live streams of whole concerts, instead of several CDs or similar fixed media, by their so-called \"Digital Concert Hall\" using YouTube for \"trailing\" purposes only. These \"online concerts\" are also spread over a lot of different places – cinemas – at various places on the globe. A similar concept is used by the Metropolitan Opera in New York. Many successful startup ventures have based their business on streaming media. There also is a livestream from the International Space Station.\n\n\n== Recording ==\nMedia that is live streamed can be recorded through certain media players such as VLC player, or through the use of a Screen Recorder. Live-streaming platforms such as Twitch may also incorporate a video on demand system that allows automatic recording of live broadcasts so that they can be watched later. The popular site, YouTube also has recordings of live broadcasts, including television shows aired on major networks. These streams have the potential to be recorded by anyone who has access to them, whether legally or otherwise. \n\n\n== Copyright ==\n\nStreaming copyrighted content can involve making infringing copies of the works in question. The recording and distribution of streamed content is also an issue for many companies that rely on revenue based off of views or attendance.\n\n\n== Greenhouse gas emissions ==\nThe net greenhouse gas emissions from streaming music have been estimated at between 200 and 350 million kilograms per year in the United States, according to a 2019 study. This is an increase from emissions in the pre-digital music period, which were estimated at \"140 million kilograms in 1977, 136 million kilograms in 1988, and 157 million in 2000.\"There are several ways to decrease GHGs associated with streaming music, including efforts to make data centers carbon neutral, by converting to electricity produced from renewable sources. On an individual level, purchase of a physical CD may be more environmentally friendly if it is to be played more than 27 times. Another option for reducing energy use can be downloading the music for offline listening, to reduce the need for streaming over distance. The Spotify service has a built-in local cache to reduce the necessity of repeating song streams.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nJ. Preston. \"Occupy Video Showcases Live Streaming,\" New York Times, December 11, 2011\n\n\n== External links ==\nWhat is Streaming? A high-level view of streaming media technology, history, retrieved 2016-03-25\nThe Early History Of The Streaming Media Industry and The Battle Between Microsoft & Real, retrieved 2016-03-25"}