{"text": "A television show (often simply TV show) is any content produced for broadcast via over-the-air, satellite, cable, or internet and typically viewed on a television set, excluding breaking news, advertisements, or trailers that are typically placed between shows. Television shows are most often scheduled well ahead of time and appear on electronic guides or other TV listings.\nA television show might also be called a television program (British English: programme), especially if it lacks a narrative structure. A television series is usually released in episodes that follow a narrative, and are usually divided into seasons (US and Canada) or series (UK) – yearly or semiannual sets of new episodes. A show with a limited number of episodes may be called a miniseries, serial, or limited series. A one-time show may be called a \"special\". A television film (\"made-for-TV movie\" or \"television movie\") is a film that is initially broadcast on television rather than released in theaters or direct-to-video.\nTelevision shows can be viewed as they are broadcast in real time (live), be recorded on home video or a digital video recorder for later viewing, or be viewed on demand via a set-top box or streamed over the internet.\n\n\n== History ==\n\nThe first television shows were experimental, sporadic broadcasts viewable only within a very short range from the broadcast tower starting in the 1930s. Televised events such as the 1936 Summer Olympics in Germany, the 1937 coronation of King George VI in the UK, and David Sarnoff's famous introduction at the 1939 New York World's Fair in the US spurred a growth in the medium, but World War II put a halt to development until after the war. The 1947 World Series inspired many Americans to buy their first television set and then in 1948, the popular radio show Texaco Star Theater made the move and became the first weekly televised variety show, earning host Milton Berle the name \"Mr Television\" and demonstrating that the medium was a stable, modern form of entertainment which could attract advertisers. The first national live television broadcast in the US took place on September 4, 1951 when President Harry Truman's speech at the Japanese Peace Treaty Conference in San Francisco was transmitted over AT&T's transcontinental cable and microwave radio relay system to broadcast stations in local markets.The first national color broadcast (the 1954 Tournament of Roses Parade) in the US occurred on January 1, 1954. During the following ten years most network broadcasts, and nearly all local programming, continued to be in black-and-white. A color transition was announced for the fall of 1965, during which over half of all network prime-time programming would be broadcast in color. The first all-color prime-time season came just one year later. In 1972, the last holdout among daytime network shows converted to color, resulting in the first completely all-color network season.\n\n\n== Formats and genres ==\n\nTelevision shows are more varied than most other forms of media due wide variety formats and genres that can be presented. A show may be fictional (as in comedies and dramas), or non-fictional (as in documentary, news, and reality television). It may be topical (as in the case of a local newscast and some made-for-television films), or historical (as in the case of many documentaries and fictional series). They could be primarily instructional or educational, or entertaining as is the case in situation comedy and game shows.A drama program usually features a set of actors playing characters in a historical or contemporary setting. The program follows their lives and adventures. Except for soap opera-type serials, many shows especially before the 1980s, remained static without story arcs, and the main characters and premise changed little. If some change happened to the characters' lives during the episode, it was usually undone by the end. Because of this, the episodes could be broadcast in any order. Since the 1980s, there are many series that feature progressive change to the plot, the characters, or both. For instance, Hill Street Blues and St. Elsewhere were two of the first American prime time drama television series to have this kind of dramatic structure. While the later series, Babylon 5 is an extreme example of such production that had a predetermined story running over its intended five-season run.In 2012, it was reported that television was growing into a larger component of major media companies' revenues than film. Some also noted the increase in quality of some television programs. In 2012, Academy-Award-winning film director Steven Soderbergh, commenting on ambiguity and complexity of character and narrative, stated: \"I think those qualities are now being seen on television and that people who want to see stories that have those kinds of qualities are watching television.\"\n\n\n== Production ==\n\n\n=== Development ===\n\n\n==== United States ====\nWhen a person or company decides to create a new series, they develop the show's elements, consisting of the concept, the characters, the crew, and cast. Then they often \"pitch\" it to the various networks in an attempt to find one interested enough to order a prototype first episode of the series, known as a pilot. Eric Coleman, an animation executive at Disney, told an interviewer, \"One misconception is that it's very difficult to get in and pitch your show, when the truth is that development executives at networks want very much to hear ideas. They want very much to get the word out on what types of shows they're looking for.\"To create the pilot, the structure and team of the whole series must be put together. If audiences respond well to the pilot, the network will pick up the show to air it the next season (usually Fall). Sometimes they save it for mid-season, or request rewrites and further review (known in the industry as development hell). Other times, they pass entirely, forcing the show's creator to \"shop it around\" to other networks. Many shows never make it past the pilot stage.The show hires a stable of writers, who usually work in parallel: the first writer works on the first episode, the second on the second episode, etc. When all the writers have been used, episode assignment starts again with the first writer. On other shows, however, the writers work as a team. Sometimes they develop story ideas individually, and pitch them to the show's creator, who folds them together into a script and rewrites them.If the show is picked up, the network orders a \"run\" of episodes—usually only six or 13 episodes at first, though a season typically consists of at least 22 episodes. The midseason seven and last nine episodes are sometimes called the \"mid-seven\" and \"back nine\"—borrowing the colloquial terms from bowling and golf.\n\n\n==== United Kingdom ====\nThe method of \"team writing\" is employed on some longer dramatic series (usually running up to a maximum of around 13 episodes)                                                               . The idea for such a program may be generated \"in-house\" by one of the networks; it could originate from an independent production company (sometimes a product of both). For example, the BBC's long-running soap opera EastEnders is wholly a BBC production, whereas its popular drama Life on Mars was developed by Kudos in association with the broadcaster.\nThere are still a significant number of programs, however, (usually sitcoms) that are built around just one or two writers, and a small, close-knit production team. These are \"pitched\" in the traditional way, but since the creator(s) handle all the writing requirements, there is a run of six or seven episodes per series once approval has been given. Many of the most popular British comedies have been made this way, including Monty Python's Flying Circus (albeit with an exclusive team of six writer-performers), Fawlty Towers, Blackadder and The Office.\n\n\n==== Other nations ====\nThe production company is often separate from the broadcaster. The executive producer, often the show's creator, is in charge of running the show. They pick the crew and help cast the actors, approve and sometimes write series plots—some even write or direct major episodes—while various other producers help to ensure that the show runs smoothly. Very occasionally, the executive producer will cast themselves in the show. As with filmmaking or other electronic media production, producing of an individual episode can be divided into three parts: pre-production, principal photography, and post-production.\n\n\n=== Pre-production ===\n\nPre-production begins when a script is approved. A director is chosen to plan the episode's final look.\nPre-production tasks include storyboarding, construction of sets, props, and costumes, casting guest stars, budgeting, acquiring resources like lighting, special effects, stunts, etc. Once the show is planned, it must then be scheduled; scenes are often filmed out of sequence, guest actors or even regulars may only be available at certain times. Sometimes the principal photography of different episodes must be done at the same time, complicating the schedule (a guest star might shoot scenes from two episodes on the same afternoon). Complex scenes are translated from storyboard to animatics to further clarify the action. Scripts are adjusted to meet altering requirements.\nSome shows have a small stable of directors, but also usually rely on outside directors. Given the time constraints of broadcasting, a single show might have two or three episodes in pre-production, one or two episodes in principal photography, and a few more in various stages of post-production. The task of directing is complex enough that a single director can usually not work on more than one episode or show at a time, hence the need for multiple directors.\n\n\n=== Principal photography ===\n\nPrincipal photography is the actual filming of the episode. Director, actors and crew gather at a television studio or on location for filming or videoing a scene. A scene is further divided into shots, which should be planned during pre-production. Depending on scheduling, a scene may be shot in non-sequential order of the story. Conversations may be filmed twice from different camera angles, often using stand-ins, so one actor might perform all their lines in one set of shots, and then the other side of the conversation is filmed from the opposite perspective. To complete a production on time, a second unit may be filming a different scene on another set or location at the same time, using a different set of actors, an assistant director, and a second unit crew. A director of photography supervises the lighting of each shot to ensure consistency.\nLive events are usually covered by Outside Broadcast crews using mobile television studios, known as scanners or OB trucks. Although varying greatly depending on the era and subject covered, these trucks were normally crewed by up to 15 skilled operators and production personnel. In the UK, for most of the 20th century, the BBC was the preeminent provider of outside broadcast coverage. BBC crews worked on almost every major event, including Royal weddings and funerals, major political and sporting events, and even drama programmes.\n\n\n=== Post-production ===\n\nOnce principal photography is complete, producers coordinate tasks to begin the video editing. Visual and digital video effects are added to the film; this is often outsourced to companies specializing in these areas. Often music is performed with the conductor using the film as a time reference (other musical elements may be previously recorded). An editor cuts the various pieces of film together, adds the musical score and effects, determines scene transitions, and assembles the completed show.\n\n\n== Budgets and revenues ==\nMost television networks throughout the world are 'commercial', dependent on selling advertising time or acquiring sponsors. Broadcasting executives' main concern over their programming is on audience size. Once the number of 'free to air' stations was restricted by the availability of channel frequencies, but cable TV (outside the United States, satellite television) technology has allowed an expansion in the number of channels available to viewers (sometimes at premium rates) in a much more competitive environment.In the United States, the average broadcast network drama costs $3 million an episode to produce, while cable dramas cost $2 million on average. The pilot episode may be more expensive than a regular episode. In 2004, Lost's two-hour pilot cost $10–$14 million, in 2008 Fringe's two-hour pilot cost $10 million, and in 2010, Boardwalk Empire was $18 million for the first episode. In 2011, Game of Thrones was $5–$10 million, Pan Am cost an estimated $10 million, while Terra Nova's two-hour pilot was between $10 to $20 million.Many scripted network television shows in the United States are financed through deficit financing: a studio finances the production cost of a show and a network pays a license fee to the studio for the right to air the show. This license fee does not cover the show's production costs, leading to the deficit. Although the studio does not make its money back in the original airing of the show, it retains ownership of the show. This ownership retention allows the studio to make its money back and earn a profit through syndication and DVD and Blu-ray disc sales. This system places most of the financial risk on the studios, however a show that is a hit in the syndication and home video markets can more than make up for the misses. Although the deficit financing system places minimal financial risk on the networks, they lose out on the future profits of big hits, since they are only licensing the shows.Costs are recouped mainly by advertising revenues for broadcast networks and some cable channels, while other cable channels depend on subscription revenues. In general, advertisers, and consequently networks that depend on advertising revenues, are more interested in the number of viewers within the 18–49 age range than the total number of viewers. Advertisers are willing to pay more to advertise on shows successful with young adults because they watch less television and are harder to reach than older adults. According to Advertising Age, during the 2007–08 season, Grey's Anatomy was able to charge $419,000 per commercial, compared to only $248,000 for a commercial during CSI, despite CSI having almost five million more viewers on average. Due to its strength in young demos, Friends was able to charge almost three times as much for a commercial as Murder, She Wrote, even though the two series had similar total viewer numbers during the seasons they were on the air together. Glee and The Office drew fewer total viewers than NCIS during the 2009–10 season, but earned an average of $272,694 and $213,617 respectively, compared to $150,708 for NCIS.\n\n\n== Distribution ==\n\nAfter production, the show is handed over to the television network, which sends it out to its affiliate stations, which broadcast it in the specified broadcast programming time slot. If the Nielsen ratings are good, the show is kept alive as long as possible. If not, the show is usually canceled. The show's creators are then left to shop around remaining episodes, and the possibility of future episodes, to other networks. On especially successful series, the producers sometimes call a halt to a series on their own like Seinfeld, The Cosby Show, Corner Gas, and M*A*S*H and end it with a concluding episode, which sometimes is a big series finale.\nOn rare occasions, a series that has not attracted particularly high ratings and has been canceled can be given a reprieve if home video viewership has been particularly strong. This has happened in the cases of Family Guy in the US and Peep Show in the UK.\nIf the show is popular or lucrative, and a number of episodes (usually 100 episodes or more) are made, it goes into broadcast syndication (in the United States) where rights to broadcast the program are then resold for cash or put into a barter exchange (offered to an outlet for free in exchange for airing additional commercials elsewhere in the station's broadcast day).\n\n\n== Seasons/series ==\nThe terminology used to define a set of episodes produced by a television series varies from country to country.\n\n\n=== North American usage ===\n\nIn North American television, a series is a connected set of television program episodes that run under the same title, possibly spanning many seasons. Since the late 1960s, this broadcast programming schedule typically includes between 20 and 26 episodes. Before then, a regular television season could average at least 30 episodes, and some TV series may have had as many as 39 episodes in a season.\nUntil the 1980s, most (but certainly not all) new programs for the American broadcast networks debuted in the \"fall season\", which ran from September through March and nominally contained from 24 to 26 episodes. These episodes were rebroadcast during the spring (or summer) season, from April through August. Because of cable television and the Nielsen sweeps, the \"fall\" season now normally extends to May. Thus, a \"full season\" on a broadcast network now usually runs from September through May for at least 22 episodes.A full season is sometimes split into two separate units with a hiatus around the end of the calendar year, such as the first season of Jericho on CBS. When this split occurs, the last half of the episodes sometimes are referred to with the letter B as in \"The last nine episodes (of The Sopranos) will be part of what is being called either \"Season 6, Part 2\" or \"Season 6B\", or in \"Futurama is splitting its seasons similar to how South Park does, doing half a season at a time, so this is season 6B for them.\" Since the 1990s, these shorter seasons also have been referred to as \".5\" or half seasons, where the run of shows between September and December is labeled \"Season X\", and the second run between January and May labeled \"Season X.5\". Examples of this include the 2004 incarnation of Battlestar Galactica, ABC's FlashForward, and ABC Family's Make It or Break It.\nSince at least the 2000s, new broadcast television series are often ordered (funded) for just the first 10 to 13 episodes, to gauge audience interest. If a series is popular, the network places a \"back nine order\" and the season is completed to the regular 20 to 26 episodes. An established series which is already popular, however, will typically receive an immediate full-season order at the outset of the season. A midseason replacement is a less-expensive short-run show of generally 10–13 episodes designed to take the place of an original series that failed to garner an audience and has not been picked up. A \"series finale\" is the last show of the series before the show is no longer produced. (In the UK, it means the end of a season, what is known in the United States as a \"season finale\").\nA standard television season in United States television runs predominantly across the fall and winter, from September to May. Historically, the US networks filled their summer schedules primarily by airing reruns of their fall and winter shows, although they now typically air a more diverse mixture of reruns, burnoff runs of cancelled series, new limited or event series or reality shows, and other specials.\nIn Canada, the commercial networks air most US programming in tandem with the US television season, but their original Canadian shows follow a model closer to British than American television production. Due to the smaller production budgets available in Canada, a Canadian show's season normally runs to a maximum of 13 episodes rather than 20 or more, although an exceptionally popular series such as Corner Gas or Murdoch Mysteries might receive 20-episode orders in later seasons. Canadian shows do not normally receive \"back nine\" extensions within the same season, however; even a popular series simply ends for the year when the original production order has finished airing, and an expanded order of more than 13 episodes is applied to the next season's renewal order rather than an extension of the current season. Only the public CBC Television normally schedules Canadian-produced programming throughout the year; the commercial networks typically now avoid scheduling Canadian productions to air in the fall, as such shows commonly get lost amid the publicity onslaught of the US fall season. Instead, Canadian-produced shows on the commercial networks typically air either in the winter as mid-season replacements for cancelled US shows, or in the summer.\n\n\n==== Miniseries, limited series, and event series ====\nWhile network orders for 13- or 22-episode seasons are still pervasive in the television industry, several shows have deviated from this traditional trend. Written to be close-ended and of shorter length than other shows, they are marketed with a variety of terms.\n\nMiniseries: a very short, closed-ended series, typically six or more hours in two or more parts (nights), similar to an extended television movie. Many early miniseries were adaptations of popular novels of the day, such as The National Dream (1974), Roots (1977), and North and South (1985). In recent years, as described by several television executives interviewed by The Hollywood Reporter, the term miniseries has grown to have a negative connotations within the industry, having become associated with melodrama-heavy works that were commonly produced under the format, while limited series or event series receive higher respect.\n\nLimited series: distinct from miniseries in that the production is seen to have potential to be renewed, but without the requirement of it having as many episodes as a typical order per season. Under the Dome, Killer Women, and Luther were marketed as limited series. Individual season-length stories of anthology series such as American Horror Story, Fargo, and True Detective are also described as \"limited series\". The Primetime Emmys have had to make numerous changes to their miniseries/limited series category to accommodate anthology and other limited series.\nEvent series: largely considered a marketing term, falling under the general category of event television. The term can be applied to almost any new, short-run series, such as 24: Live Another Day. It has also been used to describe game shows like The Million Second Quiz which aired for just two weeks.\n\n\n=== UK and Australia usage ===\nIn the United Kingdom and other countries, these sets of episodes are referred to as a \"series\". In Australia, the broadcasting may be different from North American usage; however, the terms series and season are both used and are the same. For example, Battlestar Galactica has an original series as well as a remake, both are considered a different series each with their own number of individual seasons.\nAustralian television does not follow \"seasons\" in the way that US television does; for example, there is no \"fall season\" or \"fall schedule\". For many years, popular night-time dramas in Australia would run for much of the year, and would only go into recess during the summer period (December–February, as Australia is in the Southern Hemisphere), when ratings are not taken. Therefore, popular dramas would usually run from February through November each year. This schedule was used in the 1970s for popular dramas including Number 96. Many drama series, such as McLeod's Daughters, have received in the majority of between 22 and 32 episodes per season. Typically, a soap opera such as Home and Away would begin a new season in late January and the season finale would air in late November, with 220–230 episodes per season. However, during the Olympics, Home and Away would often go on hiatus, which is referred to as an \"Olympic cliffhanger\". Therefore, the number of episodes would decrease. Australian situation comedy series' seasons are approximately 13 episodes long and premiere any time in between February and November.\nBritish shows have tended toward shorter series in recent years. For example, the first series of long-running science fiction show Doctor Who in 1963 featured forty-two 25‑minute episodes, this dropped to twenty-five by 1970 to accommodate changes in production and continued to 1984. For 1985 fewer but longer episodes were shown, but even after a return to shorter episodes in 1986, lack of support within the BBC meant fewer episodes were commissioned leading to only fourteen 25‑minute episodes up to those in 1989 after which it was cancelled. The revival of Doctor Who from 2005 has comprised thirteen 45‑minute installments. However, there are some series in the UK that have a larger number of episodes, for example Waterloo Road started with 8 to 12 episodes, but from series three onward it increased to twenty episodes, and series seven will contain 30 episodes. Recently, American non-cable networks have also begun to experiment with shorter series for some programs, particularly reality shows, such as Survivor. However, they often air two series per year, resulting in roughly the same number of episodes per year as a drama.\nThis is a reduction from the 1950s, in which many American shows (e.g. Gunsmoke) had between 29 and 39 episodes per season. Actual storytelling time within a commercial television hour has also gradually reduced over the years, from 50 minutes out of every 60 to the current 44 (and even less on some networks), beginning in the early 21st century.\nThe usage of \"season\" and \"series\" differ for DVD and Blu-ray releases in both Australia and the UK. In Australia, many locally produced shows are termed differently on home video releases. For example, a set of the television drama series Packed to the Rafters or Wentworth is referred to as \"season\" (\"The Complete First Season\", etc.), whereas drama series such as Tangle are known as a \"series\" (\"Series 1\", etc.). However, British-produced shows such as Mrs. Brown's Boys are referred to as \"season\" in Australia for the DVD and Blu-ray releases.\nIn the UK, most programmes are referred to as \"series\". However, \"season\" is now starting to be used for some American and international releases.\n\n\n== Running time ==\nIn the United States, dramas produced for hour-long time slots typically are 39 to 42 minutes in length (excluding advertisements), while sitcoms produced for 30-minute time slots typically are 18 to 21 minutes long. There are exceptions as subscription-based TV channels (such as HBO, Starz, Cinemax, and Showtime) have episodes with 45 to 48 minutes of program, similar to Britain.\nIn Britain dramas typically run from 46 to 48 minutes on commercial channels, and 57 to 59 minutes on the BBC. Half-hour programmes are around 22 minutes on commercial channels, and around 28 minutes on the BBC. The longer duration on the BBC is due to the lack of advertising breaks.\nIn France most television shows (whether dramas, game shows or documentaries) have a duration of 52 minutes. This is the same on nearly all French networks (TF1, France 2, France 5, M6, Canal+, etc.).\n\n\n== See also ==\n\nLists of actors by television series\nLists of television programs\nList of American public access television programs\n\n\n== References ==\n\n\n== External links ==\nNational Television Guides\nRecreation of a 1970s BBC Outside Broadcast production\nRecreation of 1960s 16mm television crew planning to shoot for a basic interview sequence\nDemonstration of telecine process which allows programmes shot on film to be broadcast"}