{"text": "Web television is original episodic content produced for broadcast via the Internet. The phrase \"web television\" is also sometimes used to refer to Internet television in general, which includes Internet-transmission of programs produced for both online and traditional terrestrial, cable, or satellite broadcast.\nWeb television content includes web series such as Red vs. Blue, Husbands, The Lizzie Bennet Diaries, Video Game High School, Carmilla, and Teenagers, among hundreds of others; original miniseries such as Dr. Horrible's Sing-Along Blog; animated shorts such as those of Homestar Runner; and exclusive video content that supplements conventional television broadcasts. The current major distributors of web television are Amazon, Blip.tv, Crackle, Hulu, Netflix, Newgrounds, Roku, and YouTube. Examples of web television production companies include: Generate LA-NY, Next New Networks, Revision3, and Vuguru.\nIn 2008, the International Academy of Web Television, headquartered in Los Angeles, formed in order to organize and support web television authors, actors, producers, and executives. The organization also administers the selection of winners for the Streamy Awards. In 2009, the Los Angeles Web Series Festival was founded. Several other festivals and award shows have been dedicated solely to web content, including the Indie Series Awards and the Vancouver Web Series Festival.\nIn 2013, in response to the soap opera All My Children shifting from broadcast to web television, a new category for \"Fantastic web-only series\" in the Daytime Emmy Awards was created. Later that year, Netflix made history by earning the first Primetime Emmy Award nominations for web television series, for Arrested Development, Hemlock Grove, and House of Cards, at the 65th Primetime Emmy Awards. Hulu earned the first Emmy win for Outstanding Series, for The Handmaid's Tale at the 69th Primetime Emmy Awards.\n\n\n== History ==\n\n\n=== 1994 to 2000 ===\nIn April 1995, Rox, a small public access program from Bloomington, Indiana, became the first series distributed via the web, with an episode titled \"Global Village Idiots\".Later the same year, New York advertising creative Scott Zakarin persuaded his employers Fattal and Collins to finance an online television drama along the lines of the contemporary television drama Melrose Place. The Spot became the first episodic fiction website, the first web soap opera. Fattal and Collins asked their Vice President, Sheri Herman, to obtain venture capital to finance it, because it was draining the resources of this boutique agency. Herman raised 7 million in a round led by Intel. She brought in advertisers including Visa and Apple to sponsor both The Spot and additional pieces through via banner ads and product placement. This was the first time advertising sponsored novel fictional content on the web. The Spot featured beautiful actors in a Santa Monica, California beach house called “The Spot”. The characters authored what would be later termed blogs, with movie clips and photos of their current activities. Viewers could post to the site and email the cast to offer advice and became part of the storyline. Audience opinion was used by the writers to shift the plot-lines around.\nAccording to Zakarin, at its height the site received over 100,000 hits a day. The site earned one of the original Webby Awards, however the business was unable to generate sufficient revenue against competitors such as The East Village. Zakarin sold his interest in 1996 to investors who formed American Cybercast and was later fired. Zakarin produced another comic soap, Grape Jam, before returning to television and film (notably producing the Shatner-Nimoy dialogue Mind Meld) before returning to the Internet with Soup of the Day and Roommates. The Spot continued alongside other American Cybercast web series, notably the first sci-fi series Eon-4 and The Pyramid, until the company fell into bankruptcy in 1997.\nIn January 1999, Showtime licensed the animated sci-fi web series WhirlGirl, making it the first independently produced web series licensed by a national television network. A month later,  the series, created by David B. Williams and produced by his Visionary Media studio, premiered on Showtime in a first-ever simultaneous web/telecast. The WhirlGirl character went on to appear occasionally on Showtime, hosting a “Lethal Ladies” programming block, for example, but spent most of her time online, appearing in 100 webisodes.In 1999, Santa Monica based Television Internet premiered the eight-minute weekly series Muscle Beach. It was a sitcom, news and fitness program in one, viewable for free with the just introduced Windows Media Player. The series lasted three seasons.\nIn 2000, The Raven started Daytona Beach Live. The station showed video about life, events, and attractions in the Daytona Beach area for up to 17,000 viewers.\n\n\n=== 2000 to 2005 ===\nAs broadband bandwidth began to increase in speed and availability, delivering high quality video over the Internet became a reality. Web Central TV, YouTube, Vimeo and DailyMotion launched their services to deliver original video. Shows such as Rocketboom appeared and post-dot-com-bust video networks such as ManiaTV!, iSTATION TV and the Ripe Digital Entertainment networks launched. In 2003, The Spot executive producer and head writer Stewart St. John revived the brand for online audiences with a new cast, and created a separate mobile series to air on Sprint PCS Vision-enabled phones. St. John and partner Todd Fisher produced over 2,500 daily videos of the first American mobile phone soap, driving story lines across platforms to the web counterpart, The Spot (2.0). By 2005, St. John-Fisher created and launched the first online half-hour scripted drama, California Heaven. In 2004-2005, Spanish producer Pedro Alonso Pablos recorded a series of video interviews featuring international well-known actors and directors like Guillermo del Toro or Keanu Reeves, plus other successful Spanish filmmakers like Santiago Segura or Álex de la Iglesia, which were distributed through his own website.\n\n\n=== 2006 ===\nIn mid-2006, several independent Web series began to achieve popularity, most notably lonelygirl15 (created by Miles Beckett, Mesh Flinders and Greg Goodfried),Soup of the Day (Zakarin and Rob Cesternino), California Heaven (St. John and Todd Fisher), \"The Burg\" (Dinosaur Diorama) and SamHas7Friends (Big Fantastic). These series were distributed independently, often using online video portals YouTube and Revver. All series acquired audiences in the millions, led by lonelygirl15s over 100 million views during its 26-month run. The series was so successful that it secured a sponsorship deal with Neutrogena. Soup of the Day was later re-crafted and edited as a feature-length film, making it the first web series distributed on disc by distribution company Echo Bridge Entertainment. SamHas7Friends was nominated for an Emmy and temporarily removed from the Internet when it was acquired by Michael Eisner.\nMarch 2006 also saw the debut of Goodnight Burbank (created by Hayden Black) as a \"webisodic\" series. The original series was named one of iTunes best podcasts of 2006.  Also hitting the scene during the summer towards the end of the year was Feed Me Bubbe which ended up showcasing that even a Grandmother and Grandson can achieve internet celebrity status. Fortuna TV Channel is the first web TV in Turkey.\nAlejo & Valentina, an Argentine flash cartoon series launched in 2002, began to be broadcast by MTV in 2005.\n\n\n=== 2007 ===\nIn 2007, Beckett and Goodfried followed up their lonelygirl15 success with KateModern, a series which debuted on social network Bebo, and took place in the same fictional universe as lonelygirl15. Big Fantastic created and produced Prom Queen, which was financed and distributed by Michael Eisner's nascent online studio Vuguru, and debuted on MySpace. These web serials highlighted interactivity with the audience in addition to the narrative on relatively low budgets.\nIn contrast, the web series Sanctuary, starring actor/producer Amanda Tapping, cost $4.3 Million to produce. Both Sanctuary and Prom Queen were nominated for a Daytime Emmy Award. Award-winning producer/director Marshall Herskovitz created Quarterlife, which debuted on MySpace and was later distributed on NBC. Meanwhile, IronSink produced Roommates, the second original series hosted by MySpace. Roommates ran for two seasons, was sponsored by companies such as Ford, and was known for its sophisticated product placement. Felicia Day created and starred in the independent comedy web series The Guild, which won the 2007 YouTube Video Award for Best Series.\n\n\n=== 2008 ===\nThe Internet continued to grow as a marketing tool and outlet for independent creators to display their work. Web television continued to improve in quality, rivaling network television. Online viewing was becoming less foreign to viewers and creativity flourished. Independent producers gained popularity, demonstrating that web television was a legitimate medium, and that web series would be more than a passing fad. The major networks and studios took notice of the trend, and began to debut their own original series.\nABC started the year with the comedy web series \"Squeegies,\" created by Handsome Donkey and produced by digital studio Stage 9. NBC debuted Gemini Division, a science fiction series starring Rosario Dawson, produced and created by Electric Farm Entertainment (the creators of the cult web series Afterworld). Warner Bros. relaunched The WB as an online network beginning with their first original web series, \"Sorority Forever\", created and produced by Big Fantastic and executive produced by McG. With the rise of studio based web series, MTV announced a new original series created by Craig Brewer that brought together the indie music world and new media expansion. In 2008 Bravo launched its first weekly web series called \"The Malan Show\". It followed New York fashion designer Malan Breton through the process of making it in America as an independent fashion designer.Established creators also started producing high-profile original web series in 2008. Joss Whedon created, produced and self-financed Dr. Horrible's Sing-Along Blog starring Neil Patrick Harris and Felicia Day. Big Fantastic wrote and produced Foreign Body, a mystery web series that served as a prequel to Robin Cook's novel of the same name. Beckett and Goodfried founded a new Internet studio, EQAL, and produced a spin-off from '\"lonelygirl15\" entitled \"LG15: The Resistance\". Dedicated media coverage of the web television space debuted with organizations such as GigaOm's NewTeeVee and Tubefilter News. Mainstream press also began converate. In the UK, KateModern ended its run on Bebo. That site also hosted a six-month-long reality/travel show, The Gap Year, produced by Endemol UK, who also made Kirill, a drama for MSN.\nAustralia emerged separate market for online series. Most notable was the made-for-MySpace series the MySpace Road Tour produced by FremantleMedia Australia. The first series, which ran from July to October 2008 drew the MySpace audience and the show received positive press. During MipCom in October 2008 MySpace announced plans for a second series and indicated that it was in talks with cable network Foxtel to distribute series 1 on network television. Additionally MySpace spoke of their plans to produce versions of the MySpace Road Tour in other countries.\n\n\n=== 2009 ===\nThe International Academy of Web Television formed in 2009, followed by the first awards program for the web television industry, called the Streamy Awards.\nThe emerging potential for success in web video caught the attention of top entertainment executives in America, including former Disney executive and current head of the Tornante Company, Michael Eisner. Torante's Vuguru subdivision partnered with Canadian media conglomerate Rogers Media on October 26, securing plans to produce upwards of 30 new web shows a year. Rogers Media agreed to help fund and distribute Vuguru's upcoming productions, thereby solidifying a connection between old and new media.\n\n\n=== 2010–present ===\nSeveral produced-for-web shows gained mainstream popularity and media coverage in 2012, 2013, and 2014, including House of Cards, Orange Is the New Black, and the revival of Arrested Development on Netflix.\nAmazon Studios produced a number of shows for Amazon Video, including Alpha House, Betas, and various situation comedy and children's shows. Amazon's Transparent, went on to win a Golden Globe for Best Series.\nThere were brief revivals of the long running soap operas All My Children and One Life to Live on Hulu and iTunes before the shows were cancelled again a short time later.\nOn July 13, 2015, Comcast, a cable company announced an HBO plus broadcast TV package at a price discounted from basic broadband plus basic cable.\n\n\n== Production and distribution ==\nThe rise in the popularity of the Internet and improvements in streaming video technology mean that producing and distributing a web series is relatively cheap by traditional standards and allows producers to reach a potentially global audience who can access the shows 24 hours a day.\n\n\n=== Methods used for distributing online television ===\nStreaming from a single or multiple websites.\nDownloadable media, in the form of video podcasts or individual files\nPeercasting\n\n\n=== Technologies ===\nDirac\nHTTP\nRSS\nRSS enclosure\nRTSP\nSMIL\nWTVML\nRTMP\n\n\n== See also ==\n\nContent delivery network\nInteractive television\nInternet television\nIPTV\nList of web television series\nProtection of Broadcasts and Broadcasting Organizations Treaty\nSmart TV\nWeb-to-TV\n\n\n== References ==\n\n\n== External links ==\nstreaming web\nweb television from around the world (Spanish)"}