{"text": "A web series is a series of scripted or non-scripted videos, generally in episodic form, released on the Internet and part of the web television medium, which first emerged in the late 1990s and became more prominent in the early 2000s. A single instance of a web series program can be called an episode or \"webisode\", however the latter term is not often used. In general, web series can be watched on a range of platforms, including desktop, laptop, tablets and smartphones. They can also be watched on television.\nIn 2013, streaming video website Netflix earned the first Primetime Emmy Award nominations for original online-only web television at the 65th Primetime Emmy Awards. Three of its web series, House of Cards, Arrested Development, and Hemlock Grove, earned nominations that year.As of 2016, there are a number of awards that have been established to award excellence in web series production, including the Streamys, Webbys, IAWTV, and Indie Series Awards; there are also several web series festivals, most notably in Los Angeles and Vancouver. Most major award ceremonies have also created web series and digital media award categories, including the Emmy Awards and the Canadian Screen Awards.\n\n\n== History ==\n\nThe Spot, or thespot.com, was the first episodic online story, and the first website to integrate photos, videos and what later became known as blogs into the story line. Created by Scott Zakarin in 1995, The Spot was likened to \"Melrose Place-on-the-Web\" and featured a rotating cast of attractive actors playing trendy and hip twenty somethings who rented rooms in a fabled southern California beach house called “The Spot”, in Santa Monica, California. The site earned the title of Infoseek's “Cool Site of the Year,” an award which later became the Webby. In that same year, Bullseye Art was one of the first web publishers to create animated webisodes. The first few webisodic content to come out of Bullseye Art included Porkchops, Internet the Animated Series and Rat Chicken.  In 1998 Bullseye Art had a hit with Miss Muffy and the Muf Mob, which led to a development deal with MTV. Bullseye Art also created Space Dog which gained popularity on Atom Films. The original Bullseye Art content can be seen currently on the Magic Butter web network. 1998 was also the first year of the Stella Shorts, perhaps the first comedic live action web series, first seen on Heavy.com and Comedynet.com.\nIn 2003 Microsoft launched MSN Video, which featured the original web series Weird TV 2000 (from the creators of the syndicated television series, Weird TV). Weird TV 2000 featured dozens of shorts, comedy sketches and mini-documentaries produced exclusively for MSN Video. From 2003 to 2006, several independent web series began to achieve popularity, most notably Red vs. Blue (created by Rooster Teeth). The series was distributed independently using online portals YouTube and Revver, as well as the Rooster Teeth website, and acquired over 100 million views during its run. Sam Has 7 Friends, which ran in the summer and fall of 2006, was nominated for a Daytime Emmy Award, and was temporarily removed from the Internet when it was acquired by Michael Eisner.In 2008, Bravo launched its first weekly web series called The Malan Show. It was about a New York City fashion designer named Malan Breton who was trying to become a successful independent designer. In 2009, the first web series festival was established, called the Los Angeles Web Series Festival.\n\n\n== Production and distribution ==\nThe rise in the popularity of the Internet and improvements the accessibility and affordability of high speed broadband and streaming video technology meant that producing and distributing a web series became a feasible alternative to \"traditional\" series production, which was formerly mostly done for broadcast and cable TV. In comparison with traditional TV series production, web series are less expensive to produce. This has allowed a wider range of creators to develop web series. As well, since web series are made available online, instead of being aired at a single preset time to specific regions, they enable producers to reach a potentially global audience who can access the shows 24 hours a day and seven days a week, at the time of their choosing. Moreover, in the 2010s, the rising affordability of tablets and smartphones and the rising ownership rates of these devices in industrialized nations means that web series are available to a wider range of potential viewers, including commuters, travellers and other people who are on the go.\nThe emerging potential for success in web video has caught the eye of some of the top entertainment executives in America, including former Disney executive and current head of the Tornante Company, Michael Eisner.  Eisner's Vuguru subdivision of Tornante partnered with Canadian media conglomerate Rogers Media on October 26, 2009, securing plans to produce over 30 new web shows a year.  Rogers Media will help fund and distribute Vuguru's upcoming productions, solidifying a connection between traditional media and new media such as web series. Web series can be distributed directly from the producers' websites, through streaming services such as Netflix, Ullu, Hoichoi, Altbalaji , TVF, VB on the web, Viu and Hulu, or via online video sharing websites such as YouTube, Vimeo or Koldcast.\n\n\n== Web 2.0 ==\nA number of web series incorporate interactive Web 2.0 features on their producer's websites, the show website, or other online fora. These Web 2.0 features enable viewers and fans to post comments online about episodes and link or \"tag\" favorite shows, episodes or video clips. These activities help to build viewer and fan engagement. Some producers use social media and social networking websites to market their web series and seek new viewers. As well, some producers monitor social media and networking comments as a way to obtain fan feedback on their shows.\n\n\n== Awards ==\nThe Webby Awards, established in 1995, and the Indie Series Awards, established in 2009, recognize top web series in the comedy, drama, and reality TV categories. In 2009, the International Academy of Web Television was founded with the mission to organize and support the community of web television creators, actors, producers and executives. It administered the selection of winners for the Streamy Awards, (which awards web television and web series content,) in 2009 and 2010. Due to poor reception and execution from the 2010 Streamy Awards, the IAWTV decided to halt its production of the award ceremony. The IAWTV followed this decision by forming their own award presentation, the IAWTV Awards.\n\n\n== See also ==\nList of web television series\nWeb television\nTubefilter\nNewTeeVee\nStreamy Awards\nChannel 101\nPodcast\n\n\n== References =="}