{"text": "Mobile payment (also referred to as mobile money, mobile money transfer, and mobile wallet) generally refer to payment services operated under financial regulation and performed from or via a mobile device. Instead of paying with cash, cheque, or credit cards, a consumer can use a mobile to pay for a wide range of services and digital or hard goods. Although the concept of using non-coin-based currency systems has a long history, it is only in the 21st century that the technology to support such systems has become widely available.\nMobile payment is being adopted all over the world in different ways. The first patent exclusively defined \"Mobile Payment System\" was filed in 2000. In 2008, the combined market for all types of mobile payments was projected to reach more than $600 billion globally by 2013, which would be double the figure as of February 2011. The mobile payment market for goods and services, excluding contactless payments using near field communication (NFC) and money transfers, is expected to exceed $300 billion globally by 2013. Investment on mobile money services is expected to grow by 22.2% during the next two years across the globe. It will result in revenue share of mobile money reaching up to 9% by 2018. Asia and Africa will observe significant growth for mobile money with technological innovation and focus on interoperability emerging as prominent trends by 2018.In developing countries mobile payment solutions have been deployed as a means of extending financial services to the community known as the \"unbanked\" or \"underbanked\", which is estimated to be as much as 50% of the world's adult population, according to Financial Access' 2009 Report \"Half the World is Unbanked\". These payment networks are often used for micropayments. The use of mobile payments in developing countries has attracted public and private funding by organizations such as the Bill & Melinda Gates Foundation, United States Agency for International Development and Mercy Corps.\nMobile payments are becoming a key instrument for PSPs and other market participants, in order to achieve new growth opportunities, according to the European Payments Council (EPC). The EPC states that \"new technology solutions provide a direct improvement to the operations efficiency, ultimately resulting in cost savings and in an increase in business volume\".\n\n\n== Models ==\nThere are five primary models for mobile payments:\n\nMobile wallets\nCard-based payments\nCarrier billing (Premium SMS or direct carrier billing)\nContactless payments NFC (Near Field Communication)\nDirect transfers between payer and payee bank accounts in near real-time (bank-led model, intra/inter-bank transfers/payments that are both bank and mobile operator agnostic)There can be combinations: \n\nDirect carrier/bank co-operation, emerging in Haiti. \nBoth bank account and card, like Vipps and MobilePay (users with an account at the right bank can debit their account, while other users can debit their card)Financial institutions and credit card companies as well as Internet companies such as Google and a number of mobile communication companies, such as mobile network operators and major telecommunications infrastructure such as w-HA from Orange and smartphone multinationals such as Ericsson and BlackBerry have implemented mobile payment solutions.\n\n\n== Mobile wallets ==\n\nA mobile wallet is an app that contain your debit and credit card information so that users can pay for goods and services digitally by using their mobile devices. Notable mobile wallets include:\n\nAlipay\nApplePay\neWallet (Ilium Software)\nGooglePay\nGyft\nVenmo\nWeChatGenerally, this is the process:First payment:\n\nUser registers, inputs their phone number, and the provider sends them an SMS with a PIN\nUser enters the received PIN, authenticating the number\nUser inputs their credit card info or another payment method if necessary (not necessary if the account has already been added) and validates paymentSubsequent payments:\n\nThe user re enters their PIN to authenticate and validates paymentRequesting a PIN is known to lower the success rate (conversion) for payments. \nThese systems can be integrated with directly or can be combined with operator and credit card payments through a unified mobile web payment platform.\n\n\n== Credit card ==\nA simple mobile web payment system can also include a credit card payment flow allowing a consumer to enter their card details to make purchases. This process is familiar but any entry of details on a mobile phone is known to reduce the success rate (conversion) of payments.\nIn addition, if the payment vendor can automatically and securely identify customers then card details can be recalled for future purchases turning credit card payments into simple single click-to-buy giving higher conversion rates for additional purchases.\n\n\n== Carrier billing ==\nThe consumer uses the mobile billing option during checkout at an e-commerce site—such as an online gaming site—to make a payment. After two-factor authentication involving the consumer's mobile number and a PIN or One-Time-Password (often abbreviated as OTP), the consumer's mobile account is charged for the purchase. It is a true alternative payment method that does not require the use of credit/debit cards or pre-registration at an online payment solution such as PayPal, thus bypassing banks and credit card companies altogether. This type of mobile payment method, which is prevalent in Asia, provides the following benefits: \n\nSecurity – Two-factor authentication and a risk management engine prevents fraud.\nConvenience – No pre-registration and no new mobile software is required.\nEasy – It's just another option during the checkout process.\nFast – Most transactions are completed in less than 10 seconds.\nProven – 70% of all digital content purchased online in some parts of Asia uses the Direct Mobile Billing method\n\n\n=== SMS/USSD-based transactional payments ===\nPremium SMS / Premium MMS\nIn the predominant model for SMS payments, the consumer sends a payment request via an SMS text message or an USSD to a short code and a premium charge is applied to their phone bill or their online wallet. The merchant involved is informed of the payment success and can then release the paid for goods.Since a trusted physical delivery address has typically not been given, these goods are most frequently digital with the merchant replying using a Multimedia Messaging Service to deliver the purchased music, ringtones, wallpapers etc.\nA Multimedia Messaging Service can also deliver barcodes which can then be scanned for confirmation of payment by a merchant. This is used as an electronic ticket for access to cinemas and events or to collect hard goods.\nTransactional payments by SMS have been popular in Asia and Europe and are now accompanied by other mobile payment methods, such as mobile web payments (WAP), mobile payment client (Java ME, Android...) and Direct Mobile Billing.\nInhibiting factors of Premium SMS include:\nPoor reliability – transactional premium SMS payments can easily fail as messages get lost.\nSlow speed – sending messages can be slow and it can take hours for a merchant to get receipt of payment. Consumers do not want to be kept waiting more than a few seconds.\nSecurity –  The SMS/USSD encryption ends in the radio interface, then the message is a plaintext.\nHigh cost – There are many high costs associated with this method of payment. The cost of setting up short codes and paying for the delivery of media via a Multimedia Messaging Service and the resulting customer support costs to account for the number of messages that get lost or are delayed.\nLow payout rates – operators also see high costs in running and supporting transactional payments which results in payout rates to the merchant being as low as 30%. Usually around 50%\nLow follow-on sales – once the payment message has been sent and the goods received there is little else the consumer can do. It is difficult for them to remember where something was purchased or how to buy it again. This also makes it difficult to tell a friend.Remote Payment by SMS and Credit Card Tokenization\nEven as the volume of Premium SMS transactions have flattened, many cloud-based payment systems continue to use SMS for presentment, authorization, and authentication, while the payment itself is processed through existing payment networks such as credit and debit card networks.  These solutions combine the ubiquity of the SMS channel, with the security and reliability of existing payment infrastructure.  Since SMS lacks end-to-end encryption, such solutions employ a higher-level security strategies known as 'tokenization' and 'target removal'  whereby payment occurs without transmitting any sensitive account details, username, password, or PIN.\nTo date, point-of-sales mobile payment solutions have not relied on SMS-based authentication as a payment mechanism, but remote payments such as bill payments, seat upgrades on flights, and membership or subscription renewals are commonplace.\nIn comparison to premium short code programs which often exist in isolation, relationship marketing and payment systems are often integrated with CRM, ERP, marketing-automation platforms, and reservation systems.  Many of the problems inherent with premium SMS have been addressed by solution providers.  Remembering keywords is not required since sessions are initiated by the enterprise to establish a transaction specific context.  Reply messages are linked to the proper session and authenticated either synchronously through a very short expiry period  (every reply is assumed to be to the last message sent) or by tracking session according to varying reply addresses and/or reply options.\n\n\n=== Mobile web payments (WAP) ===\n\nThe consumer uses web pages displayed or additional applications downloaded and installed on the mobile phone to make a payment. It uses WAP (Wireless Application Protocol) as underlying technology and thus inherits all the advantages and disadvantages of WAP. Benefits include:\nFollow-on sales where the mobile web payment can lead back to a store or to other goods the consumer may like. These pages have a URL and can be bookmarked making it easy to re-visit or share.\nHigh customer satisfaction from quick and predictable payments\nEase of use from a familiar set of online payment pagesHowever, unless the mobile account is directly charged through a mobile network operator, the use of a credit/debit card or pre-registration at online payment solution such as PayPal is still required just as in a desktop environment.\nMobile web payment methods are now being mandated by a number of mobile network operators.\n\n\n=== Direct operator billing ===\nDirect operator billing, also known as mobile content billing, WAP billing, and carrier billing, \nrequires integration with the mobile network operator. It provides certain benefits:\n\nMobile network operators already have a billing relationship with consumers, the payment will be added to their bill.\nProvides instantaneous payment\nProtects payment details and consumer identity\nBetter conversion rates\nReduced customer support costs for merchants\nAlternative monetization option in countries where credit card usage is lowOne of the drawbacks is that the payout rate will often be much lower than with other mobile payments options. Examples from a popular provider:\n\n92% with PayPal\n85 to 86% with Credit Card\n45 to 91.7% with operator billing in the US, UK and some smaller European countries, but usually around 60%More recently, Direct operator billing is being deployed in an in-app environment, where mobile application developers are taking advantage of the one-click payment option that Direct operator billing provides for monetising mobile applications. This is a logical alternative to credit card and Premium SMS billing.\nIn 2012, Ericsson and Western Union partnered to expand the direct operator billing market, making it possible for mobile operators to include Western Union Mobile Money Transfers as part of their mobile financial service offerings. Given the international reach of both companies, the partnership is meant to accelerate the interconnection between the m-commerce market and the existing financial world.\n\n\n== Contactless near-field communication ==\nNear-field communication (NFC) is used mostly in paying for purchases made in physical stores or transportation services. A consumer using a special mobile phone equipped with a smartcard waves his/her phone near a reader module. Most transactions do not require authentication, but some require authentication using PIN, before transaction is completed. The payment could be deducted from a pre-paid account or charged to a mobile or bank account directly.\nMobile payment method via NFC faces significant challenges for wide and fast adoption, due to lack of supporting infrastructure, complex ecosystem of stakeholders, and standards. Some phone manufacturers and banks, however, are enthusiastic. Ericsson and Aconite are examples of businesses that make it possible for banks to create consumer mobile payment applications that take advantage of NFC technology.NFC vendors in Japan are closely related to mass-transit networks, like the Mobile Suica used on the JR East rail network. Osaifu-Keitai system, used for Mobile Suica and many others including Edy and nanaco, has become the de facto standard method for mobile payments in Japan. Its core technology, Mobile FeliCa IC, is partially owned by Sony, NTT DoCoMo and JR East. Mobile FeliCa utilize Sony's FeliCa technology, which itself is the de facto standard for contactless smart cards in the country.\nOther NFC vendors mostly in Europe use contactless payment over mobile phones to pay for on- and off-street parking in specially demarcated areas. Parking wardens may enforce the parkings by license plate, transponder tags or barcode stickers. First conceptualized in the 1990s, the technology has seen commercial use in this century in both Scandinavia and Estonia. End users benefit from the convenience of being able to pay for parking from the comfort of their car with their mobile phone, and parking operators are not obliged to invest in either existing or new street-based parking infrastructures. Parking wardens maintain order in these systems by license plate, transponder tags or barcode stickers or they read a digital display in the same way as they read a pay and display receipt.\nOther vendors use a combination of both NFC and a barcode on the mobile device for mobile payment, because many mobile devices in the market do not yet support NFC.\n\n\n== Others ==\n\n\n=== QR code payments ===\nQR Codes 2D barcode are square bar codes. QR codes have been in use since 1994. Originally used to track products in warehouses, QR codes were designed to replace traditional (1D bar codes). Traditional bar codes just represent numbers, which can be looked up in a database and translated into something meaningful. QR, or “Quick Response” bar codes were designed to contain the meaningful info right in the bar code.\nQR Codes can be of two main categories:\nThe QR Code is presented on the mobile device of the person paying and scanned by a POS or another mobile device of the payee\nThe QR Code is presented by the payee, in a static or one time generated fashion and it is scanned by the person executing the paymentMobile self-checkout allows for one to scan a QR code or barcode of a product inside a brick-and-mortar establishment in order to purchase the product on the spot. This theoretically eliminates reduces the incidence of long checkout lines, even at self-checkout kiosks.\n\n\n=== Cloud-based mobile payments ===\nGoogle, PayPal, GlobalPay and GoPago use a cloud-based approach to in-store mobile payment. The cloud based approach places the mobile payment provider in the middle of the transaction, which involves two separate steps. First, a cloud-linked payment method is selected and payment is authorized via NFC or an alternative method.  During this step, the payment provider automatically covers the cost of the purchase with issuer linked funds.  Second, in a separate transaction, the payment provider charges the purchaser's selected, cloud-linked account in a card-not-present environment to recoup its losses on the first transaction.\n\n\n=== Audio signal-based payments ===\nThe audio channel of the mobile phone is another wireless interface that is used to make payments. Several companies have created technology to use the acoustic features of cell phones to support mobile payments and other applications that are not chip-based. The technologies Near sound data transfer (NSDT), Data Over Voice and NFC 2.0 produce audio signatures that the microphone of the cell phone can pick up to enable electronic transactions.\n\n\n=== Direct carrier/bank co-operation ===\nIn the T-Cash model, the mobile phone and the phone carrier is the front-end interface to the consumers. The consumer can purchase goods, transfer money to a peer, cash out, and cash in. A 'mini wallet' account can be opened as simply as entering *700# on the mobile phone, presumably by depositing money at a participating local merchant and the mobile phone number. Presumably, other transactions are similarly accomplished by entering special codes and the phone number of the other party on the consumer's mobile phone.\n\n\n=== Bank transfer systems ===\nSwish is the name of a system established in Sweden. It was established through a collaboration from major banks in 2012 and has been very successful, with 66 percent of the population as users in 2017.  It is mainly used for peer-to-peer payments between private people, but is also used by church collect, street vendors and small businesses. A person's account is tied to his or her phone number and the connection between the phone number and the actual bank account number is registered in the internet bank. The electronic identification system mobile BankID, issued by several Swedish banks, is used to verify the payment. Users with a simple phone or without the app can still receive money if the phone number is registered in the internet bank. Like many other mobile payment system, its main obstacle is getting people to register and download the app, but it has managed to reach a critical mass and it has become part of everyday life for many Swedes.\nSwedish payments company Trustly also enables mobile bank transfers, but is used mainly for business-to-consumer transactions that occur solely online. If an e-tailer integrates with Trustly, its customers can pay directly from their bank account. As opposed to Swish, users don't need to register a Trustly account or download software to pay with it.\nThe Danish MobilePay and Norwegian Vipps are also popular in their countries. They use direct and instant bank transfers, but also for users not connected to a participating bank, credit card billing.\nIn India, a new direct bank transfer system has emerged called as Unified Payments Interface (BHIM UPI). This system enables users to transfer money to other users and businesses in real-time directly from their bank accounts. Users download BHIM UPI supporting app on their Android or iOS device, verify their mobile number by sending one outgoing SMS to app provider, link their bank accounts basis mobile number and generate a banking PIN for secure transactions. Fund transfer can then be initiated to other users or businesses. Settlement of funds happen in real-time, i.e. money is debited from payer's bank account and credited in recipient's bank account in real-time. BHIM UPI service works 24x7, including weekends and holidays. This is slowly becoming a very popular service in India and is processing monthly payments worth approximately $10 billion as in October 2018.\n\n\n== Mobile payment service provider model ==\nThere are four potential mobile payment models:\nOperator-Centric Model: The mobile operator acts independently to deploy mobile payment service. The operator could provide an independent mobile wallet from the user mobile account(airtime). A large deployment of the Operator-Centric Model is severely challenged by the lack of connection to existing payment networks. Mobile network operator should handle the interfacing with the banking network to provide advanced mobile payment service in banked and under banked environment. Pilots using this model have been launched in emerging countries but they did not cover most of the mobile payment service use cases. Payments were limited to remittance and airtime top up.\nBank-Centric Model: A bank deploys mobile payment applications or devices to customers and ensures merchants have the required point-of-sale (POS) acceptance capability. Mobile network operator are used as a simple carrier, they bring their experience to provide Quality of service (QOS) assurance.\nCollaboration Model: This model involves collaboration among banks, mobile operators and a trusted third party.\nPeer-to-Peer Model: The mobile payment service provider acts independently from financial institutions and mobile network operators to provide mobile payment.\n\n\n== See also ==\nComparison of payment systems\nCryptocurrency wallet\nDigital wallets\nElectronic money\nFinancial cryptography\nLibra (cryptocurrency)\nMobile Payment Using USSD\nMobile ticketing\nPoint of sale\nPoint-of-sale malware\nSecure Mobile Payment Service\nSMS banking\nUniversal card\n\n\n== References =="}