{"text": "Online shopping is a form of electronic commerce which allows consumers to directly buy goods or services from a seller over the Internet using a web browser. Consumers find a product of interest by visiting the website of the retailer directly or by searching among alternative vendors using a shopping search engine, which displays the same product's availability and pricing at different e-retailers. As of 2016, customers can shop online using a range of different computers and devices, including desktop computers, laptops, tablet computers and smartphones.\nAn online shop evokes the physical analogy of buying products or services at a regular \"bricks-and-mortar\" retailer or shopping center; the process is called business-to-consumer (B2C) online shopping. When an online store is set up to enable businesses to buy from another businesses, the process is called business-to-business (B2B) online shopping. A typical online store enables the customer to browse the firm's range of products and services, view photos or images of the products, along with information about the product specifications, features and prices.\nOnline stores usually enable shoppers to use \"search\" features to find specific models, brands or items. Online customers must have access to the Internet and a valid method of payment in order to complete a transaction, such as a credit card, an Interac-enabled debit card, or a service such as PayPal. For physical products (e.g., paperback books or clothes), the e-tailer ships the products to the customer; for digital products, such as digital audio files of songs or software, the e-tailer usually sends the file to the customer over the Internet. The largest of these online retailing corporations are Alibaba, Amazon.com, and eBay.\n\n\n== Terminology ==\nAlternative names for the activity are \"e-tailing\", a shortened  form of \"electronic retail\" or \"e-shopping\", a shortened form of \"electronic shopping\". An online store may also be called an e-web-store, e-shop, e-store, Internet shop, web-shop, web-store, online store, online storefront and virtual store. Mobile commerce (or m-commerce) describes purchasing from an online retailer's mobile device-optimized website or software application (\"app\"). These websites or apps are designed to enable customers to browse through a companies' products and services on tablet computers and smartphones.\n\n\n== History ==\n\n\n=== History of online shopping ===\nOne of the earliest forms of trade conducted online was IBM's online transaction processing (OLTP) developed in the 1960s and it allowed the processing of financial transactions in real-time. The computerized ticket reservation system developed for American Airlines called Semi-Automatic Business Research Environment (SABRE) was one of its applications. Here, computer terminals located in different travel agencies were linked to a large IBM mainframe computer, which processed transactions simultaneously and coordinated them so that all travel agents had access to the same information at the same time.The emergence of online shopping as we know today developed with the emergence of the Internet. Initially, this platform only functioned as an advertising tool for companies, providing information about its products. It quickly moved on from this simple utility to actual online shopping transaction due to the development of interactive Web pages and secure transmissions. Specifically, the growth of the internet as a secure shopping channel has developed since 1994, with the first sales of Sting album 'Ten Summoner's Tales'.  Wine, chocolates, and flowers soon followed and were among the pioneering retail categories which fueled the growth of online shopping. Researchers found that having products that are appropriate for e-commerce was a key indicator of Internet success.  Many of these products did well as they are generic products which shoppers did not need to touch and feel in order to buy.  But also importantly, in the early days, there were few shoppers online and they were from a narrow segment: affluent, male, 30+.  Online shopping has come along way since these early days and -in the UK- accounts for significant percents (depending on product category as percentages can vary).\n\n\n=== Growth in online shoppers ===\nAs the revenues from online sales continued to grow significantly researchers identified different types of online shoppers, Rohm & Swaninathan identified four categories and named them \"convenience shoppers, variety seekers, balanced buyers, and store-oriented shoppers\". They focused on shopping motivations and found that the variety of products available and the perceived convenience of the buying online experience were significant motivating factors.  This was different for offline shoppers, who were more motivated by time saving and recreational motives.\nDigital High Street 2020\n\nEnglish entrepreneur Michael Aldrich was a pioneer of online shopping in 1979. His system connected a modified domestic TV to a real-time transaction processing computer via a domestic telephone line. He believed that videotex, the modified domestic TV technology with a simple menu-driven human–computer interface, was a 'new, universally applicable, participative communication medium — the first since the invention of the telephone.' This enabled 'closed' corporate information systems to be opened to 'outside' correspondents not just for transaction processing but also for e-messaging and information retrieval and dissemination, later known as e-business. His definition of the new mass communications medium as 'participative' [interactive, many-to-many] was fundamentally different from the traditional definitions of mass communication and mass media and a precursor to the social networking on the Internet 25 years later. In March 1980 he launched Redifon's Office Revolution, which allowed consumers, customers, agents, distributors, suppliers and service companies to be connected on-line to the corporate systems and allow business transactions to be completed electronically in real-time. During the 1980s he designed, manufactured, sold, installed, maintained and supported many online shopping systems, using videotex technology. These systems which also provided voice response and handprint processing pre-date the Internet and the World Wide Web, the IBM PC, and Microsoft MS-DOS, and were installed mainly in the UK by large corporations.\nThe first World Wide Web server and browser, created by Tim Berners-Lee in 1989, opened for commercial use in 1991. Thereafter, subsequent technological innovations emerged in 1994: online banking, the opening of an online pizza shop by Pizza Hut, Netscape's SSL v2 encryption standard for secure data transfer, and Intershop's first online shopping system. The first secure retail transaction over the Web was either by NetMarket or Internet Shopping Network in 1994. Immediately after, Amazon.com launched its online shopping site in 1995 and eBay was also introduced in 1995. Alibaba's sites Taobao and Tmall were launched in 2003 and 2008, respectively. Retailers are increasingly selling goods and services prior to availability through \"pretail\" for testing, building, and managing demand.\n\n\n== International statistics ==\nStatistics show that in 2012, Asia-Pacific increased their international sales over 30% giving them over $433 billion in revenue. That is a $69 billion difference between the U.S. revenue of $364.66 billion. It is estimated that Asia-Pacific will increase by another 30% in the year 2013 putting them ahead by more than one-third of all global ecommerce sales. The largest online shopping day in the world is Singles Day, with sales just in Alibaba's sites at US$9.3 billion in 2014.\n\n\n== Customers ==\nOnline customers must have access to the Internet and a valid method of payment in order to complete a transaction. Generally, higher levels of education and personal income correspond to more favorable perceptions of shopping online. Increased exposure to technology also increases the probability of developing favorable attitudes towards new shopping channels.\n\n\n== Customer buying behaviour in digital environment ==\nThe marketing around the digital environment, customer's buying behaviour may not be influenced and controlled by the brand and firm, when they make a buying decision that might concern the interactions with search engine, recommendations, online reviews and other information. With the quickly separate of the digital devices environment, people are more likely to use their mobile phones, computers, tablets and other digital devices to gather information. In other words, the digital environment has a growing effect on consumer's mind and buying behaviour. In an online shopping environment, interactive decision may have an influence on aid customer decision making. Each customer is becoming more interactive, and though online reviews customers can influence other potential buyers' behaviors.Subsequently, risk and trust would also are two important factors affecting people's' behavior in digital environments. Customer consider to switch between e-channels, because they are mainly influence by the comparison with offline shopping, involving growth of security, financial and performance-risks In other words, a customer shopping online that they may receive more risk than people shopping in stores. There are three factors may influence people to do the buying decision, firstly, people cannot examine whether the product satisfy their needs and wants before they receive it. Secondly, customer may concern at after-sale services. Finally, customer may afraid that they cannot fully understand the language used in e-sales. Based on those factors customer perceive risk may as a significantly reason influence the online purchasing behaviour.Online retailers has place much emphasis on customer trust aspect, trust is another way driving customer's behaviour in digital environment, which can depend on customer's attitude and expectation. Indeed, the company's products design or ideas can not met customer's expectations. Customer's purchase intension based on rational expectations, and additionally impacts on emotional trust. Moreover, those expectations can be also establish on the product information and revision from others.\n\n\n== Product selection ==\nConsumers find a product of interest by visiting the website of the retailer directly or by searching among alternative vendors using a shopping search engine. Once a particular product has been found on the website of the seller, most online retailers use shopping cart software to allow the consumer to accumulate multiple items and to adjust quantities, like filling a physical shopping cart or basket in a conventional store. A \"checkout\" process follows (continuing the physical-store analogy) in which payment and delivery information is collected, if necessary. Some stores allow consumers to sign up for a permanent online account so that some or all of this information only needs to be entered once. The consumer often receives an e-mail confirmation once the transaction is complete. Less sophisticated stores may rely on consumers to phone or e-mail their orders (although full credit card numbers, expiry date, and Card Security Code, or bank account and routing number should not be accepted by e-mail, for reasons of security).\n\n\n== Payment ==\nOnline shoppers commonly use a credit card or a PayPal account in order to make payments. However, some systems enable users to create accounts and pay by alternative means, such as:\n\nBilling to mobile phones and landlines\nCash on delivery (C.O.D.)\nCheque/ Check\nDebit card\nDirect debit in some countries\nElectronic money of various types\nGift cards\nPostal money order\nWire transfer/delivery on payment\nInvoice, especially popular in some markets/countries, such as Switzerland\nBitcoin or other cryptocurrenciesSome online shops will not accept international credit cards. Some require both the purchaser's billing and shipping address to be in the same country as the online shop's base of operation. Other online shops allow customers from any country to send gifts anywhere. The financial part of a transaction may be processed in real time (e.g. letting the consumer know their credit card was declined before they log off), or may be done later as part of the fulfillment process.\n\n\n== Product delivery ==\nOnce a payment has been accepted, the goods or services can be delivered in the following ways.  For physical items:\n\nShipping: The product is shipped to a customer-designated address.  Retail package delivery is typically done by the public postal system or a retail courier such as FedEx, UPS, DHL, or TNT.\nDrop shipping: The order is passed to the manufacturer or third-party distributor, who then ships the item directly to the consumer, bypassing the retailer's physical location to save time, money, and space.\nIn-store pick-up: The customer selects a local store using a locator software and picks up the delivered product at the selected location. This is the method often used in the bricks and clicks business model.For digital items or tickets:\n\nDownloading/Digital distribution: The method often used for digital media products such as software, music, movies, or images.\nPrinting out, provision of a code for, or e-mailing of such items as admission tickets and scrip (e.g., gift certificates and coupons). The tickets, codes, or coupons may be redeemed at the appropriate physical or online premises and their content reviewed to verify their eligibility (e.g., assurances that the right of admission or use is redeemed at the correct time and place, for the correct dollar amount, and for the correct number of uses).\nWill call, COBO (in Care Of Box Office), or \"at the door\" pickup: The patron picks up pre-purchased tickets for an event, such as a play, sporting event, or concert, either just before the event or in advance. With the onset of the Internet and e-commerce sites, which allow customers to buy tickets online, the popularity of this service has increased.\n\n\n== Shopping cart systems ==\nSimple shopping cart systems allow the off-line administration of products and categories. The shop is then generated as HTML files and graphics that can be uploaded to a webspace. The systems do not use an online database. A high-end solution can be bought or rented as a stand-alone program or as an addition to an enterprise resource planning program. It is usually installed on the company's web server and may integrate into the existing supply chain so that ordering, payment, delivery, accounting and warehousing can be automated to a large extent. Other solutions allow the user to register and create an online shop on a portal that hosts multiple shops simultaneously from one back office. Examples are BigCommerce, Shopify and FlickRocket. Open source shopping cart packages include advanced platforms such as Interchange, and off-the-shelf solutions such as Magento, osCommerce, Shopgate, PrestaShop, and Zen Cart. Commercial systems can also be tailored so the shop does not have to be created from scratch. By using an existing framework, software modules for various functionalities required by a web shop can be adapted and combined.\n\n\n== Design ==\nCustomers are attracted to online shopping not only because of high levels of convenience, but also because of broader selections, competitive pricing, and greater access to information. Business organizations seek to offer online shopping not only because it is of much lower cost compared to bricks and mortar stores, but also because it offers access to a worldwide market, increases customer value, and builds sustainable capabilities.\n\n\n=== Information load ===\nDesigners of online shops are concerned with the effects of information load. Information load is a product of the spatial and temporal arrangements of stimuli in the web store. Compared with conventional retail shopping, the information environment of virtual shopping is enhanced by providing additional product information such as comparative products and services, as well as various alternatives and attributes of each alternative, etc. Two major dimensions of information load are complexity and novelty. Complexity refers to the number of different elements or features of a site, often the result of increased information diversity. Novelty involves the unexpected, suppressed, new, or unfamiliar aspects of the site. The novelty dimension may keep consumers exploring a shopping site, whereas the complexity dimension may induce impulse purchases.\n\n\n=== Consumer needs and expectations ===\nAccording to the output of a research report by Western Michigan University published in 2005, an e-commerce website does not have to be good looking with listing on a lot of search engines. It must build relationships with customers to make money. The report also suggests that a website must leave a positive impression on the customers, giving them a reason to come back. However, resent research has proven that sites with higher focus on efficiency, convenience, and personalised services increased the customers motivation to make purchases.\nDyn, an Internet performance management company conducted a survey on more than 1400 consumers across 11 countries in North America, Europe, Middle-East and Asia and the results of the survey are as follows:\n\nOnline retailers must improve the website speed\nOnline retailers must ease consumers fear around securityThese concerns majorly affect the decisions of almost two thirds of the consumers.\n\n\n=== User interface ===\n\nThe most important factors determining whether customers return to a website are ease of use and the presence of user-friendly features. Usability testing is important for finding problems and improvements in a web site. Methods for evaluating usability include heuristic evaluation, cognitive walkthrough, and user testing. Each technique has its own characteristics and emphasizes different aspects of the user experience.\n\n\n== Market share ==\nThe popularity of online shopping continues to erode sales of conventional retailers. For example, Best Buy, the largest retailer of electronics in the U.S. in August 2014 reported its tenth consecutive quarterly dip in sales, citing an increasing shift by consumers to online shopping.  Amazon.com has the largest market share in the United States.  As of May 2018, a survey found two-thirds of Americans had bought something from Amazon (92% of those who had bought anything online), with 40% of online shoppers buying something from Amazon at least once a month. The survey found shopping began at amazon.com 44% of the time, compared to a general search engine at 33%.  It estimated 75 million Americans subscribe to Amazon Prime and 35 million more use someone else's account.There were 242 million people shopping online in China in 2012. For developing countries and low-income households in developed countries, adoption of e-commerce in place of or in addition to conventional methods is limited by a lack of affordable Internet access.\n\n\n== Advantages ==\n\n\n=== Convenience ===\nOnline stores are usually available 24 hours a day, and many consumers in Western countries have Internet access both at work and at home. Other establishments such as Internet cafes, community centers and schools provide internet access as well. In contrast, visiting a conventional retail store requires travel or commuting and costs such as gas, parking, or bus tickets, and must usally take place during business hours. Delivery was always a problem which affected the convenience of online shopping. However to overcome this many retailers including online retailers in Taiwan brought in a store pick up service. This now meant that customers could purchase goods online and pick them up at a nearby convenience store, making online shopping more advantageous to customers.  In the event of a problem with the item (e.g., the product was not what the consumer ordered or the product was not satisfactory), consumers are concerned with the ease of returning an item in exchange for  the correct product or a refund. Consumers may need to contact the retailer, visit the post office and pay return shipping, and then wait for a replacement or refund. Some online companies have more generous return policies to compensate for the traditional advantage of physical stores. For example, the online shoe retailer Zappos.com includes labels for free return shipping, and does not charge a restocking fee, even for returns which are not the result of merchant error.  (Note: In the United Kingdom, online shops are prohibited from charging a restocking fee if the consumer cancels their order in accordance with the Consumer Protection (Distance Selling) Act 2000). A 2018 survey in the United States found 26% of online shoppers said they never return items, and another 65% said they rarely do so.\n\n\n=== Information and reviews ===\nOnline stores must describe products for sale with text, photos, and multimedia files, whereas in a physical retail store, the actual product and the manufacturer's packaging will be available for direct inspection (which might involve a test drive, fitting, or other experimentation). Some online stores provide or link to supplemental product information, such as instructions, safety procedures, demonstrations, or manufacturer specifications. Some provide background information, advice, or how-to guides designed to help consumers decide which product to buy. Some stores even allow customers to comment or rate their items. There are also dedicated review sites that host user reviews for different products. Reviews and even some blogs give customers the option of shopping for cheaper purchases from all over the world without having to depend on local retailers. In a conventional retail store, clerks are generally available to answer questions. Some online stores have real-time chat features, but most rely on e-mails or phone calls to handle customer questions. Even if an online store is open 24 hours a day, seven days a week, the customer service team may only be available during regular business hours.\n\n\n=== Price and selection ===\nOne advantage of shopping online is being able to quickly seek out deals for items or services provided by many different vendors (though some local search engines do exist to help consumers locate products for sale in nearby stores). Search engines, online price comparison services and discovery shopping engines can be used to look up sellers of a particular product or service. Shipping costs (if applicable) reduce the price advantage of online merchandise, though depending on the jurisdiction, a lack of sales tax may compensate for this. Shipping a small number of items, especially from another country, is much more expensive than making the larger shipments bricks-and-mortar retailers order. Some retailers (especially those selling small, high-value items like electronics) offer free shipping on sufficiently large orders. Another major advantage for retailers is the ability to rapidly switch suppliers and vendors without disrupting users' shopping experience.\n\n\n== Disadvantages ==\n\n\n=== Fraud and security concerns ===\nGiven the lack of ability to inspect merchandise before purchase, consumers are at higher risk of fraud than face-to-face transactions. When ordering merchandise online, the item may not work properly, it may have defects, or it might not be the same item pictured in the online photo. Merchants also risk fraudulent purchases if customers are using stolen credit cards or fraudulent repudiation of the online purchase. However, merchants face less risk from physical theft by using a warehouse instead of a retail storefront. Secure Sockets Layer (SSL) encryption has generally solved the problem of credit card numbers being intercepted in transit between the consumer and the merchant. However, one must still trust the merchant (and employees) not to use the credit card information subsequently for their own purchases, and not to pass the information to others. Also, hackers might break into a merchant's web site and steal names, addresses and credit card numbers, although the Payment Card Industry Data Security Standard is intended to minimize the impact of such breaches. Identity theft is still a concern for consumers. A number of high-profile break-ins in the 2000s has prompted some U.S. states to require disclosure to consumers when this happens. Computer security has thus become a major concern for merchants and e-commerce service providers, who deploy countermeasures such as firewalls and anti-virus software to protect their networks. Phishing is another danger, where consumers are fooled into thinking they are dealing with a reputable retailer, when they have actually been manipulated into feeding private information to a system operated by a malicious party. Denial of service attacks are a minor risk for merchants, as are server and network outages.\nQuality seals can be placed on the Shop web page if it has undergone an independent assessment and meets all requirements of the company issuing the seal. The purpose of these seals is to increase the confidence of online shoppers. However, the existence of many different seals, or seals unfamiliar to consumers, may foil this effort to a certain extent.\nA number of resources offer advice on how consumers can protect themselves when using online retailer services. These include:\n\nSticking with well-known stores, or attempting to find independent consumer reviews of their experiences; also ensuring that there is comprehensive contact information on the website before using the service, and noting if the retailer has enrolled in industry oversight programs such as a trust mark or a trust seal.\nBefore buying from a new company, evaluating the website by considering issues such as: the professionalism and user-friendliness of the site; whether or not the company lists a telephone number and/or street address along with e-contact information; whether a fair and reasonable refund and return policy is clearly stated; and whether there are hidden price inflators, such as excessive shipping and handling charges.\nEnsuring that the retailer has an acceptable privacy policy posted. For example, note if the retailer does not explicitly state that it will not share private information with others without consent.\nEnsuring that the vendor address is protected with SSL (see above) when entering credit card information. If it does the address on the credit card information entry screen will start with \"HTTPS\".\nUsing strong passwords which do not contain personal information such as the user's name or birthdate. Another option is a \"pass phrase,\" which might be something along the lines: \"I shop 4 good a buy!!\" These are difficult to hack, since they do not consist of words found in a dictionary, and provides a variety of upper, lower, and special characters. These passwords can be site specific and may be easy to remember.Although the benefits of online shopping are considerable, when the process goes poorly it can create a thorny situation. A few problems that shoppers potentially face include identity theft, faulty products, and the accumulation of spyware. If users are required to put in their credit card information and billing/shipping address and the website is not secure, customer information can be accessible to anyone who knows how to obtain it. Most large online corporations are inventing new ways to make fraud more difficult. However, criminals are constantly responding to these developments with new ways to manipulate the system. Even though online retailers are making efforts to protect consumer information, it is a constant fight to maintain the lead. It is advisable to be aware of the most current technology and scams to protect consumer identity and finances. Product delivery is also a main concern of online shopping. Most companies offer shipping insurance in case the product is lost or damaged. Some shipping companies will offer refunds or compensation for the damage, but this is up to their discretion.\n\n\n=== Lack of full cost disclosure ===\nThe lack of full cost disclosure may also be problematic. While it may be easy to compare the base price of an item online, it may not be easy to see the total cost up front. Additional fees such as shipping are often not visible until the final step in the checkout process. The problem is especially evident with cross-border purchases, where the cost indicated at the final checkout screen may not include additional fees that must be paid upon delivery such as duties and brokerage. Some services such as the Canadian-based Wishabi attempts to include estimates of these additional cost, but nevertheless, the lack of general full cost disclosure remains a concern.\n\n\n=== Privacy ===\nPrivacy of personal information is a significant issue for some consumers. Many consumers wish to avoid spam and telemarketing which could result from supplying contact information to an online merchant. In response, many merchants promise to not use consumer information for these purposes, Many websites keep track of consumer shopping habits in order to suggest items and other websites to view. Brick-and-mortar stores also collect consumer information. Some ask for a shopper's address and phone number at checkout, though consumers may refuse to provide it. Many larger stores use the address information encoded on consumers' credit cards (often without their knowledge) to add them to a catalog mailing list. This information is obviously not accessible to the merchant when paying in cash or through a bank (money transfer, in which case there is also proof of payment).\n\n\n== Product suitability ==\nMany successful purely virtual companies deal with digital products, (including information storage, retrieval, and modification), music, movies, office supplies, education, communication, software, photography, and financial transactions. Other successful marketers use drop shipping or affiliate marketing techniques to facilitate transactions of tangible goods without maintaining real inventory. Some non-digital products have been more successful than others for online stores. Profitable items often have a high value-to-weight ratio, they may involve embarrassing purchases, they may typically go to people in remote locations, and they may have shut-ins as their typical purchasers. Items which can fit in a standard mailbox—such as music CDs, DVDs and books—are particularly suitable for a virtual marketer.\nProducts such as spare parts, both for consumer items like washing machines and for industrial equipment like centrifugal pumps, also seem good candidates for selling online. Retailers often need to order spare parts specially, since they typically do not stock them at consumer outlets—in such cases, e-commerce solutions in spares do not compete with retail stores, only with other ordering systems. A factor for success in this niche can consist of providing customers with exact, reliable information about which part number their particular version of a product needs, for example by providing parts lists keyed by serial number. Products less suitable for e-commerce include products that have a low value-to-weight ratio, products that have a smell, taste, or touch component, products that need trial fittings—most notably clothing—and products where colour integrity appears important. Nonetheless, some web sites have had success delivering groceries and clothing sold through the internet is big business in the U.S.\n\n\n== Aggregation ==\nHigh-volume websites, such as Yahoo!, Amazon.com, and eBay, offer hosting services for online stores to all size retailers. These stores are presented within an integrated navigation framework, sometimes known as virtual shopping malls or online marketplaces.\n\n\n== Impact of reviews on consumer behavior ==\nOne of the great benefits of online shopping is the ability to read product reviews, written either by experts or fellow online shoppers. The Nielsen Company conducted a survey in March 2010 and polled more than 27,000 Internet users in 55 markets from the Asia-Pacific, Europe, Middle East, North America, and South America to look at questions such as \"How do consumers shop online?\", \"What do they intend to buy?\", \"How do they use various online shopping web pages?\", and the impact of social media and other factors that come into play when consumers are trying to decide how to spend their money on which product or service. According to the research, reviews on electronics (57%) such as DVD players, cellphones, or PlayStations, and so on, reviews on cars (45%), and reviews on software (37%) play an important role in influencing consumers who tend to make purchases online.  Furthermore, 40% of online shoppers indicate that they would not even buy electronics without consulting online reviews first.\nIn addition to online reviews, peer recommendations on online shopping pages or social media websites play a key role for online shoppers when they are researching future purchases. 90% of all purchases made are influenced by social media.\n\n\n== See also ==\n\n\n== References =="}